[
  {
    "title": "Looking for a turnaround in transmission",
    "description": "After years of stalled transmission buildout, there are new signs of progress. Earlier this month, SPP approved $8.6 billion in transmission projects across 14 states. Major plans are emerging in MISO, PJM, and ERCOT. Despite the DOE canceling its loan guarantee, the Grain Belt Express is still moving forward. And regardless of court battles, so is the New England Clean Energy Connect. \n\nAre these signs that the U.S. could start building transmission at scale again?\n\nIn this episode, Shayle talks to Rob Gramlich, founder and president of Grid Strategies. He and Shayle cover topics like:\n\nWhy Rob says the DOE’s efforts to fast-track large-load interconnection is a positive sign for transmission buildout\n\nThe recent buildout of 880 miles of transmission and why it may look better than it is\n\nWhy transmission hasn’t benefited from data center investment \n\nSpecific projects, including SPP’s transmission backbone and the Grain Belt Express\n\nRob’s outlook on buildout over the coming year\n\nThe uncertain future of permitting reform despite bipartisan support\n\nResources:\n\nCatalyst: Unpacking DOE’s proposal to transform data center interconnection   \n\nLatitude Media: How the Grain Belt Express lost its LPO loan  \n\nE&E News: Data center growth cited in defense of MISO transmission plan \n\nFill out our short podcast listener survey for a chance to win a $100 Amazon gift card.\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is our executive editor. \n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.Catalyst is brought to you by Bloom Energy. AI data centers can’t wait years for grid power—and with Bloom Energy’s fuel cells, they don’t have to. Bloom Energy delivers affordable, always-on, ultra-reliable onsite power, built for chipmakers, hyperscalers, and data center leaders looking to power their operations at AI speed. Learn more by visiting BloomEnergy.com.",
    "summary": "The podcast discusses the challenges and importance of expanding the US transmission grid to support clean energy, data centers, and AI industry growth. Key points include the slow progress in building new transmission lines, the impact of federal policies like FERC Order 1920, and the need for federal leadership in infrastructure development. Recent developments, such as SPP's approval for a 765 KV transmission backbone and the cancellation of a loan guarantee for the Greenbelt Express project, are also analyzed. The episode emphasizes the critical role of transmission infrastructure in meeting increasing electricity demand and enabling the transition to a cleaner and more reliable energy system.",
    "transcript": " A very brief word before we start the show. We've got a survey for listeners of Catalyst and Open Circuit, and we would be so grateful if you could take a few moments to fill it out. As our audience continues to expand, it's an opportunity to understand how and why you listen to our shows, and it helps us continue bringing relevant content on the tech and markets you care about in clean energy. If you fill it out, you'll get a chance to win a $100 gift card from Amazon, and you can find it at latitudemedia.com slash survey, or just click the survey link in the show notes. Thank you so much. Latitude media covering the new frontiers of the energy transition. I'm Shell Kahn, and this is Catalyst. It was quite dramatic that the Secretary of Energy, Secretary Wright, wrote this letter to FERC saying, here's a rulemaking I'm putting before you on access to the grid. It strongly proves the point the whole AI industry needs the grid and that this current administration is willing to do anything and everything to support AI. So now we need to see the next step of, okay, well, let's expand the grid. Coming up, transmission, transmission. Clean energy is under attack, and it's more important than ever to understand why projects fail and how to get them back on track. The center left think tank third way surveyed over 200 clean energy professionals to answer that exact question. Their newest study identifies the top non-cost barriers to getting projects over the finish line from permitting challenges to nimbism to read third ways full report and to learn more about their pace initiative, visit thirdway.org slash pace, or click the link in the show notes. The AI boom is here, but the grid wasn't built for it. Bloom energy is helping the AI industry take charge. Bloom energy delivers affordable, always on ultra reliable on-site power. That's why chip makers, hyperscalers, and data center leaders are already using bloom to power their operations with electricity that scales from megawatts to gigawatts. This isn't yesterday's fuel cell. This is on-site power built to deliver at AI speed. To learn more about how fuel cells are powering the AI era, visit bloomenergy.com or click the link in the show notes. Surging electricity demand is testing the limits of the grid, but Energy Hub is helping utilities stay ahead. Energy Hub's platform transforms millions of connected devices, like thermostats, EVs, batteries, and more into flexible energy resources. That means more reliability, lower costs, and cleaner power without new infrastructure. Energy Hub partners with over 120 utilities nationwide to build virtual power plants that scale. Learn how the industry's leading flexibility provider is shaping the future of the grid. Visit energyhub.com. I'm Shale Khan. I lead the early stage venture capital strategy at Energy Impact Partners. Welcome. I'm going to talk about the new technologies for my singing voice. We're talking transmission this week because I had robbed Gramlich on a year ago, a little over a year ago, to talk about the woeful state of US transmission build-out, which has truly been embarrassing for the past decade or so, and even worse in recent years. We talked about all the reasons why that was true and what might change and so on. I'd say the outlook was we're in a tough spot and a bunch of things need to change in order to for us to start building significant transmissions lines again. And just as a reminder, we need to build new transmission lines for lots of reasons. We need to integrate lots more renewables on the grid and other generation. And also now, we need to serve all of this new load that's showing up in the former data centers. So the need is doubled. And that speaks to why I want to have the conversation again today, which is a lot has changed in the past year in the electricity sector. Things in other parts of the market have changed substantially and transmission may or may not be the hardest thing to change. So I wanted to see whether all of the rapid change, all of the money that is flowing into the sector has moved the needle on building out new high voltage power lines in the US. So I brought back Rob Gramlich from Grid Strategies to do an update. Here's Rob. Rob, welcome back. Thanks, Cheryl. Could we with you? All right. So you and I talked on this podcast a little over a year ago about transmission and new transmission, I would say in particular in the US. And it was a tale of woes and a big long exclamation of how amazing it is that we've been able to build so little transmission new high voltage transmission in particular in the United States in the past decade or so. And I wanted to have you back on because the past year has changed many things about the electricity sector. And I wonder whether it has changed this thing. So my high level question for you is, do you think we're in a fundamentally different position with regard to your outlook on new transmission build in the US relative to a year ago or is it more the same place? Well, we're still struggling to put the pieces together. I think we do have a good platform that actually has a pretty decent shot of surviving the political change we've all experienced because transmission is so critical for data centers and AI driven data center demand. But we don't really know that for sure yet. Things are just sort of getting settled with the relevant agencies here in Washington Department of Energy and FERC. So we don't really know how that's going to turn out. We did actually have an uptick in new lines in 2024. So that was new because I think when we spoke, we were talking about how there were only 55 miles of new high voltage transmission lines in 2023, which is down a trickle from the 4,000 that had been built 10 years prior, which hopefully I wasn't all well with me. What was us? I mean, I do like to point at that experience 10 years ago and say, hey, look, we were able, in this country, with all the permitting challenges we have to build 4,000 miles of new high voltage transmission. I connected all this clean energy. So there is hope and we like to point to that example saying, look, when we get the pieces together, right, we can do this. But then some things happened and we went down to a trickle of only 55 miles. There wasn't an uptick to like 880-ish miles in 2024. So that's some good news. When I first saw that, I thought, oh, great. We're starting to turn things around. But if you look a little bit closer, you kind of see, oh, wait a minute, these were lines that were begun 10 or 15 years ago that just finally got finished. Now, you could say, all right, that's a good story because a number of these did need like federal permits from federal agencies. And I think during the Biden administration, they were approving transmission projects. And so that's good news and that could continue, might not continue in the current administration. We don't know yet. But there wasn't uptick. So in some ways, we've gotten some permitting. But some of the key policies like at FERC in order 1920, it could be branded as a democratic thing. I think it was bipartisan and it actually had no preferences for renewable energy or anything like that. So I think it should be safe and robust to a partisan change with new commissioners coming in. But we don't know yet. We don't know what the new commissioners are going to do about 1920. Are they going to implement it or just kind of render it sort of a dead letter and just in a week or just briefly redescribe in 1920? Sure. So that was the order. I asked the issue a few years ago for proactive long-term transmission planning, 20-year plans for each region. So it applies to the grid operators like PJM and MISO and SPP and California ISO, but also to the non-RTO utilities they need to get with their neighbors and put regional plans together. And so significant order, very well crafted in my opinion, Chairman Glick and his team separated it through and Commissioner Clemens and others, Chairman and then Commissioner Christie was there for the latter part of it. He made some changes. So it kind of wound up very sort of bipartisan. And technology neutral, which is fine. But it's there. Should be done. The courts will have their say, hopefully people will revoke their challenges from the courts and just let it stay as it is. And then hopefully FERC will actually implement it with teeth and not just accept any old thing that comes in on compliance. But that is the next step is the region's father. Compliance approaches with FERC and FERC kind of on the margin can either make it be a weak rule or remain a strong rule. I mean, is this the fundamental reason why things, so like in other parts of the electricity world, things have changed a lot in the past year, right? And it's driven by just the, it's like necessity is the mother of invention. It's a combination of necessity is the mother invention. And there is essentially an endless pool of money willing to throw itself at any solution that gets more power to data centers faster. Is the reason why this hasn't, like transmission hasn't benefited from that, that like the only way to solve it is kind of, it's like what you're describing. It's like a FERC order that has to go through the ISO's that takes years to go through the process. And so it's just inherently a slower thing because you could imagine a scenario where sort of similar to what we're seeing in other categories, right? Like hyperscaler wants to build data center and strikes a deal with utility where they can get interconnected faster if they pay for 100 miles of new 765 kV line or something like that. You think that kind of thing would be happening. Yeah, I think it's just, it's not right in the bullseye of the data centers immediate need or the utilities immediate need. It's sort of the background infrastructure that everybody relies on and absolutely you need to build up that network, that backbone network to support all this new load. And it's not the obvious thing. It's not what incoming officials at the Department of Energy immediately go to as, oh, here's immediately what we need to go focus on. And it's not, it doesn't catch a lot of the press attention. A lot of the press attention is about, oh, look at this onsite generation option or a new, now we're doing rice generators or this or that or the other onsite option. For some reason, more attention. But I mean, my understanding from the hyperscalers and the data center developers is that they all really, really want the full network transmission service with all of the good backup and cushion that that network provides to their operations and the five nines reliability that you only get that way. And so I think the message is starting to filter through the process. I mean, it was quite dramatic that the Secretary of Energy, Secretary Wright, wrote this letter to FERC saying, here's a rulemaking I'm putting before you on access to the grid. Right. But it's not really, it doesn't really have anything about transmission in it, right? Well, it's access to transmission. And then so the next, it begs the next question of, well, if you care that much to do this dramatic order that's almost never used authority and take all the beating from state regulators who would be losing some jurisdiction, if you're willing to do that, well, then you must care about the size of the grid, the actual capacity of the grid. What's access to a grid if it has no capacity for you? So to me, it strongly proves the point that the whole AI industry, if you want to call it that, needs the grid and that this current administration, which is willing to do anything and everything to support AI being done in this country, it proves that the transmission network is critical to that because they're taking this major action to get access to the transmission grid. So now we need to see the next step of, okay, well, let's expand the grid and all the things that come with that, which is order 1920 and then interregional transmission and then using the DOE programs like the transmission facilitation program we could go on. But there are a lot of things that FERC and DOE can do to actually enable the expansion of the grid. Is this a little bit of a tragedy of the commons kind of a problem? A hundred percent. Yeah, it's where it's like any given data center company needs transmission expansion, but you can't attribute that transmission build out to that specific data center necessarily. And so they can't say, I will put down money for you to build out new transmission lines specifically for me. And as a result, it gets pushed down the order of priority list because they're like, okay, immediate concern is getting this data center connected to the grid. So instead, I'm just going to go buy a bunch of gas generators or whatever it is. Exactly right. Look, these hyperscalers, and you and I know them all, and I'm sure we both have many friends that at each of them, they're an intense competition with each other. To the point where the people I know at the hyperscaler, they don't actually know which data centers are being developed for their company because it's so commercially sensitive that only a few people, even in the company, know which ones they're really planning to go forward with. And so if they're in that intense competition, like company to company, then it's of much less interest, just much less incentive for them to go work on the network that all of their competitors get to use just as much as they do. So that's classic public good, tragedy the commons. And it's the reason why in this scenario, this is a classic reason why you have government leadership. And as a nation, if we are in an AI race with China, then we should be using federal leadership to build out the network for all of those data centers here that want to be in this country and operating here in the Middle East or Asia or wherever else. And so for this to happen right, you really need federal leadership. States and regions can do a lot as well and localities, but we really need to build out the transmission network, which is an interstate federally regulated network. Do you ever wonder why it takes so long to get clean energy projects up and running? Do you have permitting reform on the brain? Are you NEPA reform curious? The new pace study from Third Way pinpoints the non-cost barriers that stand in the way of clean energy deployment and keep new solar and transmission projects in limbo. They surveyed more than 200 industry professionals to understand what's slowing down deployment and offer practical solutions on how to fix it. To read Third Way's full report and to learn more about the pace initiative, visit thirdway.org slash pace. You heard the phrase speed to power a lot lately, but here's what it really means. AI data centers are being told that it will take years to get grid power. They can't afford to wait, so they're turning to on-site power solutions like bloom energy. Bloom can deliver clean, ultra reliable, affordable power that's always on in as little as 90 days. Bloom's fuel cells offer data centers other important advantages. They adapt to volatile AI workloads. They have an ultra low emissions profile that usually allows for faster and simpler permitting and their cost effective too. That's why leaders from across the industry trust Bloom to power their data centers. Ready to power your AI future? Visit bloom energy dot com to learn more. The grid wasn't built for what's coming next. Electricity demand is surging from data centers to EVs and utilities they need reliable, affordable solutions that don't require building expensive new infrastructure. Energy Hub helps by turning everyday devices like smart thermostats, EVs, home batteries and more into virtual power plants. These flexible energy resources respond in near real time to grid needs, balancing supply and demand. Plus they can be deployed in under a year and at 40 to 60 percent lower cost than traditional infrastructure. That means more reliability, lower costs, cleaner energy, you can't get much better than that. And that is why over 120 utilities across North America trust Energy Hub to manage more than 1.8 million devices. Learn more at energyhub.com or click the link in the show notes. Let me throw a couple of recent announcements at you and just get your take on like what how big a deal is this and what does it mean. Okay, so one was I think just recently, SPP, Southwest Power Pool got I think approval to build this 765 KV transmission backbone as they called it. That sounds quite positive. How big a deal is that? Yeah, that plan, the ITP plan is huge. I mean they went back and forth and I don't know the like the final number in terms of it might be closer to the 10 billion version rather than the 20 billion dollar version. Yeah, it's like 8.6 or something. Yeah, okay. So, you know, it got unfortunately cut back. I hope there's a way here's another way like the federal government could come in and say, hey, for you know, AI race with China, we want to get you back up to the 20 billion and we're going to help you. But hopefully it ain't over till it's over on that. But at any rate, directionally, it's fantastic. 765 KV collector loop with, you know, I mean anybody's favorite generation source is available in that, you know, great planes footprint and you know, the market will decide which ones go forward. But there certainly could be a tremendous amount of clean energy that connects to that system and powers a tremendous amount of data center and new manufacturing and other load in that area. Okay, so now an announcement that points in the opposite direction, which is that the DOE the loan program's office canceled the loan guarantee that was going to be offered to the Greenbelt Express project. So it's your point there. It seems from all the other indications that this administration would be super in favor of new transmission build out that cancellation seems like an odd decision in in light of that. What do you make of it? Yeah, so many people interpreted that as so maybe they don't care about transmission. I don't interpret it that way. I think that was a very unique circumstance where a senator decided to use his minutes in the Oval Office to talk about a specific loan to a specific transmission line. Okay, that's not going to happen very often in our, you know, in the future. And if it does, anytime a senator uses his time with the president to talk about a specific loan to a specific line, that project, that loan anyway will be in trouble. The project, I expect, will go forward. It's a great project. But that loan is no longer. So I just think, you know, I mean, presidents do things at the request of senators sometimes. And, you know, that's what happened. How many, okay, I guess the way to ask this question is you said before, like, okay, did the extent that we built anything out recently? It's been stuff that was in the works for the past 10 years, et cetera. So presumably we should have pretty good visibility then into how much we will build for the next two, three, four, five years. How much is it? Yeah, I think it's looking pretty good. I mean, you've got 765 KV AC plans. We mentioned SPP, but MISO in the more of the, like, the Great Lakes part of the Midwest and is looking at 765 PJM as well. And they just came out with a new very much more ambitious plan than we've seen from them in the Mid-Atlantic and Urcott in Texas. Also have 765 KV plans. So that's four regions who are, for the first time in many decades, doing the highest AC voltage transmission lines that we have. So you know, they take time, but those are now being planned. And there were also plans that, you know, started more like five, seven years ago. MISO long-range transmission plan. Some of these are still facing some challenges like that one has. There's a challenge at FERC with some states. But hopefully that will go forward. California ISO has continued. They've been cranking along quietly for many years. Pretty much they're the only ones who have kind of gone nonstop on transmission. So every year they're doing more and it's bringing in resources from around the West. So yeah, I do think there's a lot of indications. New York has some. There's a new line that the NECEC and from Quebec into New England is finally going forward after, you know, some back and forth and tough court decisions and opposition. But I do think there are a bunch that are on their way and looking promising. So the curve may bend back up a little bit, at least. Like that stuff comes together. We could be building hundreds, thousands of miles per year? Yeah, we could be getting into a few thousand or more miles per year. And then how much is all this stuff tied up in the question of permitting reform? How much does that matter? Because it's not clear to me whether that's actually on the horizon, it may be, but certainly hasn't happened yet. Do we need it? I do think we need it. I mean, you can build things here and there under the current regime, which again, you know, was proven by 10 years ago, we did it. But there are real limitations with that. And some of it is this big interregional opportunity. Like we don't really have a system in place to build interregional transmission from region to region, Myshod SPP or SPP to the interior west or interior west to the coast. All of these neighboring regions, there's a massive untapped value of transmission there. And we don't have a regional transmission organization with a planning process to deal with that. And this whole more, looking at the whole industry on a more macro scale, we're evolving out of an industry that started with 3,000 utilities doing their local thing and their local fiefdom without much of a tie between them. And so we're crafting onto the top this more regional and then interregional approach. And it's a process, a multi-decadal process that we're still working through and we're nowhere near the endgame on that. So we're still working through on that. Permitting reform, at least as set up in the Manchin-Barrasso Energy Permitting Reform Act, EPRA from a couple years ago, it has a transmission title. But it has a big focus on interregional transmission planning and determining what are the list of benefits that are the basis for cost allocation and some federal permitting role in there. So those things, in my opinion, are extremely helpful. It's a great bill. It was bipartisan past the Senate Energy Committee, 11 to 4, only one Republican opposed. One Senator Hawley who opposed the Greenbelt loan. But otherwise, very strong showing at the Senate Energy Committee. And now it's, I think it's teed up for the broader permitting package, which there are complexities on the other components of the package that both House and Senate are working through. I expect to see the House moving pretty quickly on one piece, the deeper related piece. And that'll be an important milestone. So I do think there's a chance and I do think it would have a very big impact on transmission and enabling transmission going forward. How much innovation do you see in the transmission world? In the sense of either planning, right? Like people talked about citing transmission lines along railways, that kind of thing. Undergrounding technology innovation. What do you think is interesting? Yeah, I do think there are some very interesting, I'll call them advanced, transmission. Transmission technologies, one category is high performance conductors with carbon core or superconductors where you put up a new wire either on the same tower or rebuild the towers. That's for re-conductoring more than new build, right? Yeah, that's right. It's for both. But yeah, but it does open up the opportunity for re-conductoring, which is very fast because you don't need a new right of way for that. So that's one category. Another category is grid enhancing technologies, which are more the operational type technologies, topology optimization, advanced power flow control, dynamic line rating, that sort of thing in storage as transmission you could put in there. And those increase headroom and capacity in a quick way. And again, the mantra in Washington anyway is speed to power because that's kind of the mantra for the data center community right now. And those things are speedy. They're relatively inexpensive and they're speedy. They don't fully solve the problem. It's not like you don't need new transmission as well. But they do increase the headroom and we all need headroom because it's a very constrained, congested grid right now. So final question, I guess. You mentioned we don't really have a system for interregional transmission. There are those out there, folks at Grid United, run by Mike Skelly, famous long time. Transmission developer, Invenergy and others who have planned projects that are interregional. So how are they doing it? Yeah, that's right. I mean, I think there is a little market for some transmission that you can cobble together enough, basically money from customers, like voluntary subscriptions from utilities along the route or at either end in order to pay for some lines. The long term, I don't think that's enough to build anywhere near the optimal amount. But there is some and these developers to their credit are looking at some super high value pathways and they have, I think in many cases, very cleverly figured out good routes that can be put together and worked things out with landowners. So many of them are pretty far along on that and what they do. I mean, they kind of pass the hat to utilities and say, hey, would you pay this much? And if they get enough, then they can go forward. And they do often need federal permits in one hopes that there are actual staff at the Department of Interior and places like that to actually issue permits. It does rely on that in many cases. But some of these lines are looking very, very promising. So I do think we will get some of those under the current regime, even if we don't get permitting reform. But if we get permitting reform and or significant FERC action in the interregional space, I think we would get a lot more. All right, Rob. Thanks for the update on the lines. We'll be back in another year and see if things have changed substantially from now. All right. We'll be ready for it. Good to talk to you, Cheryl. Rob Gremlich is the founder and president of Grid Strategies. This show is a production of latitude media. You can head over to latitudemedia.com for links to today's topics. Latitude is supported by Prelude Ventures. This episode was produced by Daniel Waldorf, mixing and theme song by Sean Markwand. Stephen Lacey is our executive editor. I'm Shale Khan, and this is Catalyst.",
    "release_date": "2025-11-20",
    "duration_ms": 1755000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI5128630931.mp3?updated=1763604096",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-11-21T01:42:55.125320"
  },
  {
    "title": "New Mexico proves America can still build [partner content]",
    "description": "Across the country, people are asking the same question: why is it so hard to build in America?\n\nFrom transmission lines to clean energy factories, projects are taking longer, costs are rising, and frustration is growing. But in New Mexico, two cabinet secretaries are trying to show that it doesn’t have to be this way.\n\nTogether, Economic Development Secretary Rob Black and Environment Secretary Jim Kenney are helping redefine how state agencies work with industry. Their model blends speed, access, and careful environmental oversight to help companies build more quickly without cutting corners.\n\nTogether, they’re using that model to attract billion-dollar fusion and geothermal projects, expand water and infrastructure investments, and deploy the state’s $65 billion sovereign wealth fund directly into advanced energy and deep-tech manufacturing.\n\nIn this episode, Stephen Lacey talks with Rob Black and Jim Kenney about how New Mexico is rewriting the rules of economic development, and what their partnership can teach the rest of America about how to make government work again.\n\nThis is a partner episode, produced in collaboration with the New Mexico Economic Development Department, which works to expand opportunity through innovation, infrastructure, and investment across the state.",
    "summary": "Rob Black and Jim Kenny from the New Mexico Economic Development Department and Environment Department discuss how they are streamlining government processes to attract clean energy projects. New Mexico's white glove service provides personalized assistance for permits and investments. They emphasize balancing economic development with environmental protection, showcasing their focus on clean energy innovation, including fusion, geothermal, and deep tech. By offering incentives like tax credits and low-interest loans, along with a $65 billion sovereign wealth fund investing in energy innovation, New Mexico aims to become a hub for the fusion industry and a leader in clean energy by the end of the decade.",
    "transcript": " This is Partner Content from Latitude Studios. There's a lot of talk right now about how to build again in America. Powerlines, energy projects, transit systems, housing. It's expensive. It takes forever. And even when you have the money and the permits, something still seems to get in the way. And that's led to a bigger question. Did we just forget how to build things? That question is turned into a lively policy debate about how to make it easier and faster to get things done again. And so I turn to two people who are not debating it. They're living it. Rob Black, I am the Cabinet Secretary for the New Mexico Economic Development Department. My name is Jim Kenny and I am the Cabinet Secretary for the New Mexico Environment Department. Rob and Jim have a close partnership. Rob comes from business and utilities. Jim from the EPA. One of the things that's fun with Jim is he's an environmentalist who really wants to be an economic developer. And I'm an economic developer who's really an environmentalist. So it's created this kind of really interesting dynamic between the two of us. There's this old story in American politics that you can either protect the environment or grow the economy. One side builds things, the other side blocks them. And that tension has shaped decades of debate over energy, manufacturing, and growth. But in New Mexico, they don't really see it that way. Yeah, I think it's deconstructing that notion that you have to choose something, right? You have to choose between public health or environmental issues or economic prosperity. I think you're not working hard enough, especially in government if you think one of those has to win over the other of those. At the center of their approach is something they call white glove service. It's the government as concierge, fast, personal, and hands-on. If you need a permit, someone will walk you through it. If you're visiting the state, someone might literally meet you at the airport. My business card that I use every day has my mobile number on it. And I give that to folks because that's, I want to be that accessible. An example of Jim's white glove service, we had a company coming in, the energy company from Australia. He, the cabinet secretary, picked them up at the airport and drove them around. That's the level of engagement that New Mexico brings to the table. If people are looking for government to be a verb, then that's New Mexico. We are seeing across this country a lot of people asking how can we build better? How can we build more in America? And that it's getting harder to build things across America. Whether that's permitting challenges, local fights, political gridlock at many levels. When you look at that picture, why is New Mexico different? Rob? You know, we haven't been as partisan in a lot of those sort of conversations here in the state. It's about how do we actually deliver and improve people's lives? And being whether you're a Republican, whether you're a Democrat, whether you're from an urban area or a rural area, we all tend to lean in on how to do that. I think that is something that's culturally maybe unique to New Mexico, but it's allowed us to create unique structures like our Renewable Energy Transmission Act, which has helped us deploy transmission much faster than other areas of the country. We've put that kind of culture into policy, and I think that's why we're able to move faster. Is it that it's getting harder? Are people willing to get up from the table faster when they don't get their way? And I think there's a lack of sort of meaningful engagement and willing to solve problems. And I think what Rob is saying and what we're trying to show here out of the Environment Department is we won't be the first to get up from the table. We have to double down and work harder when the stakes are that much higher. So if we can't provide cheap and inexpensive and affordable energy to communities in New Mexico, then we have to sit at the table longer and work harder to find that solution. And that's what I think has sort of been a fleeting moment in America is that people are willing to get up from the table and not find solutions, right? And demonize each other as opposed to solve the problem. And that's not what happens at all here in New Mexico. In this episode, produced in collaboration with the New Mexico Economic Development Department, a conversation with Rob Black and Jim Kenny about how they're making government work for the clean energy economy. We'll talk about an approach that's helping attract billion dollar fusion projects, expand geothermal development and invest the state's $65 billion sovereign wealth fund directly into clean energy and deep tech. We're really focused on how do we get to yes and then what else can we do? You don't think of government as innovative, but I will say we've cracked the code on that here in New Mexico. When did you start really pursuing the clean energy market? And what's at stake if you don't continue to attract these companies? The path to this policy approach around renewable energy started as a state policy really with the Energy Transition Act, I believe in 2019. The governor led that as an effort to create a renewable portfolio standard, really set the stage to create a regulatory path for decarbonization of the electricity and energy sector. That was how we then said, here's now we're going to build around this and we're going to focus on areas both from an R&D perspective, but also deployment perspective where we're not only doing the research and development which New Mexico has done really well for a hundred years. I mean, when you look back to Sandia National Labs, Los Alamos National Labs, the things that we've built here, vision, fusion and fracking, we're all invented in New Mexico. How do we integrate that into a lower carbon energy economy and doing it in a way where we're doing the R&D here, but also then deploying the technology here? And so that, I think from a state government perspective, really started in 2019. Yeah, and I would add what's at stake. We're in a climate crisis. We need to continue to reduce greenhouse gas emissions. And that effort does, again, it doesn't have to be mutually exclusive from bringing those energy technologies to bear in New Mexico. You can reduce carbon emissions as well as diversify your energy portfolio. And here in New Mexico, diversifying away from those hydrocarbons, but not eliminating hydrocarbon production. But diversifying away from hydrocarbons while we continue to think about the ways in which energy will be deployed not only for your base load power, turning the lights on, your air conditioning, your heat, those essential necessities. But what about those users of heavy industrial applications where it's an intermittent power source, right? So we have to be able to power those peaker plants. We have to be able to power those electric arc furnaces. We have to be able to power anything that needs it on demand. So we really do need to be thinking about what other fuels can we bring into our portfolio and how do we still continue it to achieve the climate reductions as well as the localized air quality impacts that often come from combustion byproducts. And again, none of those things are mutually exclusive. Yeah. And as a result, you've been pretty diversified in your approach focused on everything from fusion to geothermal to carbon capture to hydrogen. How would you characterize this overall portfolio strategy? I think we're really trying to take a practical approach at decarbonization and understanding that you have to have energy intensity as well for certain types of manufacturing, other types of activity. That also means we've passed these strictest oil and gas regulatory regime really in the country, if not the world, here in New Mexico. So we've got the lowest carbon-intense barrel of oil and unit of natural gas anywhere. That was where we started because that's what the energy mix we had already. We're number two in oil production, number three in natural gas production in the United States. We have the only uranium enrichment plant in the United States today is in New Mexico. We have the most productive geothermal well now operating in the US, happening in New Mexico. So we're looking at what are those needs around firm load in particular? We've done great on wind. We do great on solar. But also, where can we invest R&D side on deployment side that's going to create that firm load that really creates the opportunity for reshoring, for whether it's data centers or other heavy users that allow us to grow our economy while ensuring we're meeting our climate goals as well. Everything that can be on the table that meets our legal requirements in terms of state law to reduce greenhouse gas emissions is on the table. So it's all the above within the context of our very clear climate and innovative approaches. Nationally, we're having this conversation about taking a strategic deregulatory approach to make it easier to build a wide variety of clean energy resources. How have you navigated regulation in New Mexico to both ensure the cleanliness of the oil and gas sector as much as possible, but also to make it easier to build and deploy a wide variety of resources? How have you navigated that in New Mexico? Yet, on the regulatory part, you're right. There's a big deregulatory agenda going on, and that's creating regulatory uncertainty. And if there's one thing that industry likes and we know that in government is that certainty is the most powerful thing that you can provide from a government standpoint. And when we look at that pendulum swinging between federal administrations pushing in either direction, here's New Mexico. We're going to be able to build a wide variety, certain, and moving forward to say that we are unwavering that we're going to pursue our climate goals. We're unwavering that we're going to collaborate with the oil and gas industry and other stakeholders to build out the most restrictive and pragmatic oil and gas regulations. So we've put all that into our state law, into our state rules, and we've insulated ourselves in New Mexico by having certainty through state law that's been in place now since the governor started in 2019. And we've just continued to chip away and build that certainty for the regulated industry or for industry in general. I think also the fact that we have what I would call as like sort of anti-backsliding measures, the things that we've codified into our state law gives industry certainty that administration to administration here at the state level, we're going to continue to have that certainty. So you know when you invest, the rug isn't going to be pulled out from under you in the next administration in New Mexico. I think those are really big points that we've been able to weather and promote here in New Mexico. The other thing we've done around this is focused on speed to market. And you know regulatory certainty is very important for business but also so is speed. So in the last legislative session, we passed several pieces of legislation that one that create a site readiness program where we're able to pre-deploy and certify a site as an economic development site, help put infrastructure in advance prior to a customer even being identified. And then if a utility comes to me and says, I think this site would be really good for economic development, I have 60 days to review that, certify it as an economic development site. And then if I do, it goes to the state public regulation commission and they will review that within six months to make a decision. So we've really tightened that timeline ability to deploy infrastructure quickly. We also passed a microgrid bill that allows users of over 20 megawatts, so I think large advanced manufacturing or hyperscalers to build microgrids very quickly in the state. And so we're really doing our best. They still have to meet the 2045 carbon emission standards, but we're really working on how do we help people deploy quickly so that we can be part of that economic development and that deployment of that next technology. And if I understand it correctly, New Mexico has the nation's second largest sovereign wealth fund. How big is that fund? And how is it directly investing in deep tech and energy innovation? Stephen, it's very exciting to talk about what the SIC, the state investment council is doing. So it's now about $65 billion in this fund. It is the second largest in the US, only behind Alaska. And we think we'll probably surpass Alaska in the next three years or so. What they've done is they've taken about $2 billion of that and put it into a venture fund that is working with the 25 to 30 largest deep tech venture funds in the world. Think groups like Lower Carbon, Antler, Coastal, up, and they're investing in those areas that align with the state's strategy. Our strategy, where we think we have the right to win in New Mexico is around advanced energy, computer, edge computing, space and defense. These are all areas because of the Sandia National Lab, Los Alamos National Lab, Air Force Research Lab, all located here, our universities. We have a unique competitive advantage. So now the state investment council is funding these funds who have portfolio companies who are aligned with that strategy. Think Pacific Fusion. Pacific Fusion has three different funds that are funded by the state investment council funding that company. And part of the direction of the state investment council is give us a return, but also deploy capital or create jobs in New Mexico. There are very few places in the world that have created this dynamic. And you're really thinking about Saudi Arabia, Abu Dhabi, Singapore, and now New Mexico, where you've paired a sovereign wealth fund with targeted investments aligned to a state strategy. So I think we're creating something that's very unique. It's also why XGS geothermal chose to build a 150 megawatt billion dollar geothermal plant in New Mexico because they were funded by a fund funded by the state investment council. So we're seeing incredible deal flow around deep technologies that we think will be part of changing the world. There's about 400 million dollars in monies available right now, simply around the water space. And one thing we know is that most energy sources have a degree of, they're a little thirsty on occasions. And so we need to bring water to that energy market so that we can continue our economic development. So what we've done is put about 400 million in sort of set aside dollars available in different pots of money. Maybe it's to bring brackish water to more usable water supply so it could go into like electrolyzers for hydrogen or maybe it could go into cement for wind turbines, right? Because why should we use fresh water from our communities if we could use brackish water or other lesser valued waters in terms of building out our energy and infrastructure environment? So it's not about just that direct certainty and speed to market. I think it's about those flanking pieces that bring capital that increase the ability to have a robust ecosystem around economic development. So you've got this capitalization strategy. How does that pair with tax credits, R&D tax credits, jobs credits, equipment credits, like how do you put this package together? That's a great question. And if you think about what happens with the state investment council, right, they're taking state dollars, putting them into company as equity investors. So now my job is to help that company be successful in New Mexico because that's going to give us a return to our investment. But it's also going to create jobs. It's going to create economic opportunity on the ground. So we have a research and development tax credit which can pay up to 10% on qualified research expenses. We have a high wage jobs tax credit that's refundable at 8.5% of your employees wages for four years. We're going to pay between 50% and 90% of your employees' wages for the first six months through New Mexico on new hires, depending on where you do it and the type of job. And then we have industrial revenue bonds which can waive property and equipment taxes for up to 30 years. We also will help build capital infrastructure with our local economic development program which could help you build a building, rent a building, or make improvements. So when you layer all of those things on with a capital stack, that means if you leave California, you don't leave Silicon Valley capital because we're going to make sure those folks are paying attention to you. It creates a really robust incentive structure. What we can do here at the Environment Department, if Rob comes to me as he's done in the past and says, we need water for this community or we need to think about treating the water from this industrial process. And what we at the Environment Department do, we also have a financing arm. And we can bring low interest loans and grants to municipalities who want to be in support of that economic development, but we can also bring it to the private sector. So I'm typically sitting on about $100 million or more in 0.01% interest monies for municipal governments in 2.375% interest rate for the private sector, 30-year fixed, beats any bond requirements typically. And we have that money available that we can stack. And I like the idea of this short stack of pancakes kind of forming here where we can bring that out as a financial package, not only through economic development, but through the Environment Department and our tax and rev department and sort of say, here's everything that we can do. Here's a financial strategy that supports your investment. So again, it's that whole of government coming together to solve a problem. I'm really interested to hear more about what is happening in fusion. You want to make New Mexico the center of the fusion industry. What does that vision look like through the end of the decade? And what kind of activity are you seeing right now? Well, we expect, we want New Mexico to be the center of fusion, if not for the U.S. for the world. You know, we're very pleased to announce that Pacific fusion was moving their R&D facility here. We're in conversations with a variety of other fusion companies. And again, this talk's a little bit about how we're doing it. So just a month ago, the State Investment Council created a new fund of over $300 million apart with lower carbon energy to fund fusion and advanced energy projects in New Mexico. So we're bringing that equity to the table. We've got San Diego National Labs and Los Alamos National Labs. So if you think about companies like Pacific Fusion who use magnet-based fusion technologies based off of the Z machine, which again was the first place to do kind of fusion here on Earth, that alignment and that proximity to work with those scientists is a big draw for New Mexico. Los Alamos National Labs, on the other hand, is really key to the laser-based fusion approach. So I think bringing those sort of aspects together gives us a very powerful, unique value proposition. You layer that on with access to capital and New Mexico becomes very attractive. Jim, how are you approaching fusion from the environment, department perspective? We license fusion facilities here in New Mexico out of the environment department and we have shown with Pacific Fusion and we're in the process of doing this is that we can be quicker, faster and just as protective as any other state in issuing the permit. It takes us about five to six months to maybe get one of those permits out the door and other states it's taking 18 to 24 months to get those permits out the door. Part of that is we've been very proficient in how we regulate those radioactive type based energy sources here in New Mexico. The second piece is we have such a deep and vast experience here in the environment department with radioactive type source material. Whether that's in X-ray machines or CAT scan machines, but we've also, being that we're the birthplace of the nuclear industry, we're still dealing with some of the adverse impacts of nuclear issues here in New Mexico. So we recognize that the past needs to be validated like we need to continue to work in the past and cleaning up those nuclear type issues that are still plaguing New Mexico. But we've built up such an expertise in our department around these topics and we understand the future is in cleaner energy like Pacific Fusion will be developing and we again can regulate those and get those safe licenses out the door faster than most other states. So again full service, full touch, recognizing the past but understanding that our clean energy future is going to be founded in these kinds of technologies. So we've talked about some of the building blocks. I want to hear more about what companies are looking for and I know it's really highly dependent on the type of company and industry we're talking about but are there any commonalities around what when companies are looking at a place to locate their facilities, their headquarters, build their businesses, what do they need and particularly in the clean energy industry? So they need access to power and they want green power. So again having a renewable portfolio standard means if you're locating a company here you're going to get that from in New Mexico. They need to be able to build and get to market quickly. So they want sites to be ready to go. And so that's why we've created a site readiness strategy where we're investing in advance even before a company shows up and making sure we've got industrial sites that can be quick to market less than a year to market as opposed to two or three years out. We mentioned regulatory certainty. That's really important. If you're a renewable energy company we've got a demand side for you as well, right? Because we need to help meeting our renewable portfolio standards. Our utilities do, our co-ops do. So you've got a place to deploy here as well. And then I'm going to make you the best tax deal you can in the country to manufacture your equipment. And I'm going to give you rail infrastructure that will get you to 75% of the United States population within two days. So we've got the logistics hub, we've got the tax structure for you, and we've got a market for you. And then we layer that with capital. I think there's a couple other pieces that we're hearing from companies. And I'm hearing specifically at the Environment Department from companies, many of the folks we're attracting to New Mexico are spending a significant amount of money on intellectual property. Whether that those are proprietary catalysts or their proprietary processes in the manufacturing and deployment of whatever it is, it could be electrons or it could be something else. And they want to understand that wherever they're setting up, that the state government understands the value of that IP coming to that location. And in one instance, a company said to me, they were being courted by many other states. And what they found in New Mexico was a deep rooted understanding that the intellectual property that they've spent millions and millions and millions of dollars on was going to be valued here in the state, not only by law and rule, but by the people that they're dealing with. In her and in that is we have two of the nation's top leading national laboratories here, Los Alamos National Labs and Sandia National Labs. So from state government to the laboratory setting, there's a lot of understanding about what that intellectual property means and how we can safeguard and protect it. And I think we've created that, again, that ecosystem where we're valuing the investment and we're valuing what people are bringing here and wanting to stand up to employ New Mexicans. And that's a great feeling. The other thing that businesses are really looking for is a workforce. And I think that's something that's really is unique in New Mexico. While we have the highest density of R&D spend in the US here in New Mexico, we also have the most PhDs per capita in the United States live here in New Mexico. But if you're going to do geothermal and you need to be able to drill holes really well, you won't find a better workforce for doing that than the Permian Basin. And that we share that with Texas here in New Mexico. And so you've got a great workforce for geothermal. We have the nuclear history here with the labs and your RENCO waste isolation pilot plant. We have people are trained in those technologies trained in nuclear cleanup and gyms shop and in the private sector. And so we have a really deep bench for workforce as well. That's something that employers really want. That brings me to another question. When we think about the availability of a skilled workforce, I mean, one of the challenges that you hear from manufacturers in the US is that it can be hard to find skilled workers or they can't afford to live in the place where they need to set up the manufacturing facility. And so it brings us to this bigger set of policies around childcare, college tuition, affordable living. How are you thinking about making New Mexico a more livable place to continue to keep the kind of skilled workers that you have in the state? It's something that we're very proud of. It's something that because of long-term investments in the state that helped build that sovereign wealth fund. That sovereign wealth fund not only invests in companies that are helping create jobs, it also pays for us as the only state in the country that provides free two and four year college tuition. For anybody who graduates from high school in New Mexico, you can go to free college in the state. As well, starting November 1st of this year, we will provide universal free childcare and early education programs for any family in New Mexico, only place in the United States. So we've taken this cradle to career approach of investing in our people and that's going to create the workforce. And frankly, those are benefits that if you're hiring people or you're bringing your people from California or New York to live in New Mexico, that's a benefit you as a company now are giving to your employees without having to pay for it because the state's going to pay for it for you. And so those are some of the things that we think we've created a really unique value proposition in New Mexico, coupled with the fact that it's one of the cheapest places to buy a home, own a home. We have some of the lowest electricity rates in the country while still having a strong renewable portfolio. It's a place that allows people to thrive and you can also get up on a ski slope very fast. So there's a lot of great beautiful things about the quality of life as well. So I'm hearing, I mean, there's so much thought and care that goes into this economic development strategy. What do you want to prove to the rest of the country? I mean, there are plenty of states where the cost of living is too high. Maybe infrastructure is overly politicized. There's a lot of local opposition, whatever it might be. What are you proving to the rest of the country in New Mexico? We can build the things we need to build. We can do it in a way that is equitable, that achieves our climate goals and our economic goals, that you can be a yes and environment. It doesn't have to be binary. It can be a lot of people can win. Yeah, and I'll add to that. When I render it down to answer your question, Stephen, I think it's just simply this. What we're proving in New Mexico is that we're both white-collar intellectual people, but blue-collar wrench-turners here, like we in government can think of the policies, get them codified, but we know how to implement. We are an action-oriented government who knows how to think, craft, and implement policy, and that translates into the results you just heard from Rob. Rob Black, his New Mexico's Secretary of Economic Development. Jim Kenney, his Secretary of New Mexico's Environment Department. This episode was produced in collaboration with the New Mexico Economic Development Department, which works to expand opportunity through innovation, infrastructure, and investment across the state. To learn more, visit edd.newmexico.gov or just visit the link in the show notes.",
    "release_date": "2025-11-18",
    "duration_ms": 1875000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI4630646043.mp3",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-11-21T01:45:32.312803"
  },
  {
    "title": "Driving down the cost of green hydrogen",
    "description": "A few years ago, industry and political leaders embraced hydrogen as a solution to a laundry list of hard-to-abate decarbonization challenges — steel production, ammonia production, and more. But hydrogen failed to come down in costs and policymakers pulled back support. Ultimately, the bubble burst. \n\nSo what does it take to drive down the costs of low-carbon hydrogen and rebuild momentum?\n\nIn this episode, Shayle talks to Raffi Garabedian, co-founder and CEO of Electric Hydrogen. (Shayle is on the board of Electric Hydrogen and Energy Impact Partners, where Shayle is a partner, invests in the company). Shayle and Raffi cover topics like:\n\nWhy the hype bubble burst: political pullback, high renewables costs driven by AI demand, and high CapEx \n\nThe real cost problem: Why engineering, procurement, and construction (EPC) costs have remained persistently high\n\nCompeting approaches: Why Electric Hydrogen chose supersized electrolyzers over modular units\n\nThe China question: Why hydrogen’s EPC costs will limit the impact of cheap Chinese electrolyzers\n\nReal numbers: Realistic cost targets for fossil parity and Electric Hydrogen’s current pricing\n\nWhere hydrogen wins: Markets where Raffi says green hydrogen can achieve fossil parity by the early 2030s, including Brazilian fertilizer\n\nResources:\n\nLatitude Media: is 45v guidance killing green hydrogen production?\n\nThe Green Blueprint: Electric Hydrogen’s bet on supersized electrolyzers\n\nLatitude Media: Electric Hydrogen is building through the market downturn  \n\nLatitude Media: Hydrogen’s narrow pathway to positive climate impacts  \n\nLatitude Media: Why the Electric Hydrogen-Ambient merger is a sign of things to come\n\nFill out our short podcast listener survey for a chance to win a $100 Amazon gift card.\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is our executive editor. \n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.\n\nCatalyst is brought to you by Bloom Energy. AI data centers can’t wait years for grid power—and with Bloom Energy’s fuel cells, they don’t have to. Bloom Energy delivers affordable, always-on, ultra-reliable onsite power, built for chipmakers, hyperscalers, and data center leaders looking to power their operations at AI speed. Learn more by visiting BloomEnergy.com.\n\nCatalyst is supported by Third Way. Third Way’s new PACE study surveyed over 200 clean energy professionals to pinpoint the non-cost barriers delaying clean energy deployment today and offers practical solutions to help get projects over the finish line. Read Third Way's full report, and learn more about their PACE initiative, at www.thirdway.org/pace.",
    "summary": "The podcast discusses the challenges and developments in the green hydrogen market, focusing on the burst of the hype bubble surrounding green hydrogen due to high costs and unmet expectations. The CEO of Electric Hydrogen, Raffi Garibedian, shares insights on the historical context of the market, cost breakdown of traditional electrolyzer projects, and solutions to reduce capital costs. Electric Hydrogen's approach emphasizes system-level thinking, modularization, and dense technology to minimize EPC costs and overall system expenses. The transcript also mentions the importance of understanding non-cost barriers in clean energy deployment and highlights the AI industry's increasing demand for reliable, scalable power solutions like Bloom Energy and Energy Hub.",
    "transcript": " A very brief word before we start the show. We've got a survey for listeners of Catalyst and Open Circuit, and we would be so grateful if you could take a few moments to fill it out. As our audience continues to expand, it's an opportunity to understand how and why you listen to our shows, and it helps us continue bringing relevant content on the tech and markets you care about in clean energy. If you fill it out, you'll get a chance to win a $100 gift card from Amazon, and you can find it at latitudemedia.com. If you're not a guest, please click the survey link in the show notes. Thank you so much. Latitude Media, covering the new frontiers of the energy transition. I'm Shail Khan, and this is Catalyst. We do recognize at least an electric hydrogen that we've got to collapse costs towards what we call fossil parity for the molecules that we produce. Line up, how to make green hydrogen great again, or great. Clean energy is under attack, and it's more important than ever to understand why projects fail and how to get them back on track. The center left think tank third way, surveyed over 200 clean energy professionals to answer that exact question. Their newest study identifies the top non-cost barriers to getting projects over the finish line, from permitting challenges to nimbism. To read third ways full report and to learn more about their pace initiative, visit thirdway.org slash pace, or click the link in the show notes. The AI boom is here, but the grid wasn't built for it. Bloom Energy is helping the AI industry take charge. Bloom Energy delivers affordable, always on ultra reliable on-site power. That's why chip makers, hyperscalers, and data center leaders are already using Bloom to power their operations with electricity that scales from megawatts to gigawatts. This isn't yesterday's fuel cell. This is on-site power built to deliver at AI speed. To learn more about how fuel cells are powering the AI era, visit bloomenergy.com or click the link in the show notes. Surging electricity demand is testing the limits of the grid, but Energy Hub is helping utilities stay ahead. Energy Hub's platform transforms millions of connected devices, like thermostats, EVs, batteries, and more into flexible energy resources. That means more reliability, lower costs, and cleaner power without new infrastructure. Energy Hub partners with over 120 utilities nationwide to build virtual power plants that scale. Learn how the industry's leading flexibility provider is shaping the future of the grid. Visit energyhub.com. I'm Shail Khan. I lead the early stage venture strategy of energy impact partners. Welcome. So, if you were to read the headlines over the past year or maybe 18 months, your impression of the state of the green hydrogen market might be kind of dim. After a classic hype cycle played out at hyperspeed basically from around 2021 to, I would say, 2024, reality very much set in for that nascent market. I think that reality check basically came in three forms. First, and in my mind, by far the most importantly, the actual delivered costs of green hydrogen from the first wave of projects that were being developed was far too high. Second, some of the markets that had been targeted, say, like duty transportation or building heat, just didn't make much sense in the first place. And third, as has happened in a number of other sectors over the same period, the durability, and magnitude of the so-called green premium turned out to be less than advertised. So the result has been a clear removal of hype in that market. But just as a reminder, the market for hydrogen and the emissions associated with the production of that hydrogen is not going away anytime soon. We already have a $70 billion annual market using hydrogen and industry, predominantly in petrochemicals and in ammonia production. And don't look now, but there is a new wave of technologies entering the market that has the promise to actually deliver on the cost reduction that the market was seeking all along. Raffi Garibedian, who's my guest today, is the CEO of Electric Hydrogen, one of those companies. He's been on the show before years ago, but he's back now for an update and a fresh and sober look at where this market heads after its journey up and back down the hype cycle. As a reminder, for disclosure, we at EIP are investors in electric hydrogen, and I'm on the board of the company. Here's Raffi. Raffi, welcome back. Thank you, Cheryl. Great to be here with you. Let's talk green hydrogen. I want to start by having you give me your version of the history of the green hydrogen market, such as it is over, I don't know, let's say the last five years or so. You pick your time period where the... I was going to say, should I go back to Jimmy Carter? Yeah, no, we don't need to talk about electrolysis in the 70s, but I think I can start with like, I mean, maybe around when you were starting to think about it, which is what five-ish years ago. And then tell me what's happened in the market since then. Yeah, great. I think as you know, Cheryl, I was in the solar industry up until the end of 2020, but it started to think about what can be done with renewable power beyond direct electrification, getting more renewables onto the grid. And that interest immediately leads to green hydrogen as the thing, as the precursor, the foundation of most power to X kind of ideas. So in late 2020, early 2021, I and my partners here at Electric Hydrogen started to think about how to make green hydrogen cheap. We kind of approaching the problem from the context of renewable power where cost reduction, rapid scaling and reduction in cost, helped to create a robust market for commodity in that case of electricity. And we thought the same thing should be true in green hydrogen and derivative molecules. So that was a point in time early 2021 when there was the inklings of hype around green hydrogen, but hype hadn't really hit us square in the face yet. I think it was more really in 2022, late 2021, early 2022, when things got really, really active. And in those days, green hydrogen was the solution to every problem everywhere in the world. It was going to change everything. I mean, even at cocktail parties, people who know nothing about energy would say, oh, you're in green hydrogen? That's great, which is a sure sign that it's overhyped. Yeah, the second anybody asks me about something I do at a cocktail party, I know something's gone horribly wrong generally, which maybe implies something about AI today, but anyway, gone. Yeah, let's not go there. But yeah, since then, so green hydrogen went through this just incredible ballooning of the bubble. And I would say since then the bubble has burst. And I can't say whether right now we're at the nater of green hydrogen hype or whether we're starting to come out of it. It feels like we are starting to come out of it now gradually. But those of you know, the Gartner hype cycle know that the climb out of the trough of disillusionment is slow and gradual and long and arduous. I think that's where we're where we are in this market today. And to what would you ascribe the bubble bursting? Like fundamentally, why did it I mean, all bubbles burst if they're bubbles, definitely, but like what made this bubble burst? Yeah. So great question. So why would the bubble burst? Well, what's green hydrogen all about? It's all about avoiding emissions in very hard to decarbonize sectors of the economy. Green hydrogen unfortunately has been and continues to be an expensive solution to those problems. Now, there's no cheap solution to those problems. It's worth pointing out, right? All solutions to those problems are expensive. At the peak of the hype, there was a naive hope that society was willing to pay the difference for deep decarbonization because it had turned into a decarbonization, it turned into a global priority. We had kind of Europe, the US, Asia, everybody had a hydrogen, every country had a hydrogen strategy. The world's changed dramatically since then. I think that political climate is resulting in a retraction from commitment to retooling critical industries at some expense for the purpose of decarbonization. Green hydrogen, it is also true, is expensive and it's been too expensive over the last few years. And it's been too expensive for a couple of reasons. If you look at the cost of making a kilogram of green hydrogen today, let's say in southern Europe, it might be unsubsidized. It might be maybe $6 US, a kilo, I think rough numbers. It might be about right. That can be broken down roughly 5050 into CapEx and OpEx. OpEx being the cost of the power, going into the process to make the hydrogen and CapEx being the cost of carrying the capital, the cost of building the plant. Now remember, the power that goes into making green hydrogen is carried out chemically as hydrogen. So it's not lost power, it's power that's being transformed with some inefficiency. It's about 75% efficient process. So really it's a combination of those two things. And if we look at again what's happened in the last few years on both of those fronts, we've had bad news. So green power, renewable power prices have gone up in many places in the world, driven by an imbalance in supply and demand. So green power is much more expensive and let's now switch to the US and I can give you real numbers. If you look in West Texas and you were to sign a solar and wind kind of affirmed green power purchase agreement in Texas and Hercott territory, three years ago you might have paid $35 a megawatt hour for that product. Today you're paying 65 maybe more dollars a megawatt hour and that's driven by broadly speaking increase in electric demand driven most notably by AI data center, demand coming online or planned to be coming online. And we don't just see this in the US, we see this many, many places in the world. We see where there is cheap power, power prices have gone up dramatically, green power prices have gone up dramatically because of new demand from data centers. So that's certainly a headwind for green hydrogen. But then on top of that, you have the capex component of the levelized cost of hydrogen and that's the other half of its cost which has been extremely high and actually been going up rather than going down. And so you'd like to think that as an industry gets its feet under it and starts to scale, starts to get past demo projects and building real scaled projects, costs come down, but actually people were maybe unrealistic about the cost that could be achieved, the capital costs that could be achieved, particularly by large western suppliers of technology like Siemens and Teason Group. I'll just mention those two big names. I won't mention all the rest when built by an EPC into a fully constructed project. So we've seen those capital costs go from an early promise of something like $1,500 a kilowatt buck 50 a watt to now even over $3 a watt of capital cost. So that's also had an escalating effect on the cost of green hydrogen. So bottom line, green hydrogen has gotten more expensive today than it was supposed to be two years ago. Okay. So I think people understand, although maybe generally don't appreciate the degree to which this electricity supply demand imbalance has led to higher wholesale power prices in general and prices for renewables. We've talked about that though before on the show. And I think generally people understand it. The thing I think people don't really understand is like, why is the CapEx for for electrolyzer, for electrolyzer systems? Why has it been so high? Can you break it down? Like what is the what is the cost stack of a traditional electrolyzer project? And then you can briefly talk about like what electric hydrogen is doing differently there. But first I want to start with like $3 a watt. Like what happened here? Yeah, what happened to $3 a watt. So if you look at the cost stack of a conventional electrolyzer, you're a project developer, let's say in in in Spain and you're trying to build a hundred and hundred and fifty megawatt electrolyzer someplace, right? How are you going to go about doing it? You're going to contract with an EPC, it's an engineer, a procure construct company. You're going to select your technology. Maybe you're going to mention two names of forest wall pick one. You're going to maybe select Siemens. That's your technology provider. And you're going to go through what's called a feed study, which is front end engineering design. That's where the EPC takes all of the requirements from the equipment supplier, the technology supplier, and figures out how to build that thing on your site, right? The total installed cost is what drives levelized cost of hydrogen. It doesn't matter what the electrolyzer costs per se. It matters what the constructed cost of the plant is. And in a typical project like we're discussing, roughly half of the total installed cost goes to the EPC. What are they doing? They're grading the plot. They're managing stormwater. They're building the building that the electrolyzer is going to go into. They're building the substation. They're sourcing and selecting all of the support equipment, whether it's chillers or air compressors or backup power generators. They're sourcing and designing the control system for the plant. The list goes on and on. So the EPC has a substantial scope in the project. The electrolyzer supplier, their price might not have gone up. Their price might have been $1,000 a kilowatt, a dollar or a watt for their scope. What is their scope? It's the stack. Often it's what's called the balance of stack, which is some of the plumbing and support equipment around the stack. And it might or might not include the rectifier, which is the power conversion equipment that takes the AC from the grid and converts it down to the DC power that drives the stack to produce hydrogen. So the electrolyzer scope is pretty well defined. Those prices are pretty well defined. What's really ballooned out of proportion is the EPC or the construction costs. Okay. So how do you solve it? I mean, not just the EPC, but they're tied to each other. What's the solution to the CAPEX problem? We can talk about what's the solution to the overall system costs too, but on the CAPEX side, how do you get away from this EPC ballooning and drive down the cost of the stack? Because I think you need to. Yeah. And I think it is important to talk about the overall solution cost as well, because they're not necessarily decoupled. But just starting with the capital cost, the secret to it is no secret is to think at the system level holistically. Right? So what are those, all of those costs? Let me let me back up. When we think about our product and the scope of our product and how we present it into the market, the guiding light for us, the North Star is levelized cost of hydrogen. So we think about it from the perspective of our customer's project performer. When you look at the problem that way, you very quickly have to accept that the EPC cost must be in scope for your engineering team to try to address. Right? There's just a big chunk of cost that's being thrown to the wind, left to others to contend with. And you could throw your hands up and say, well, yeah, but there's nothing that can be done about that, because construction costs would construction costs. But it turns out that's not really the case. Now there's a deep technology component to the solution, which is actually quite simply put making the electrolyzer as dense as possible. That enables the balance of plant construction to also be quite dense and small. And hence amenable to what's called modularization, which is just the chemical industry's terminology for moving the construction from the field to a factory where the costs can be well controlled and well managed. That's what we do at electric hydrogen. We build a fully modularized plant, which leverages our extremely dense powerful stack technology to bring a total solution to market that minimizes the EPC's cost and hence minimizes the total installed cost. And by the way, there's some other things that are kind of obvious that need to be done, for example, not having a building, because buildings are very expensive, particularly buildings that has hazardous processes like hydrogen production. There's also the thing about the modularization piece that I want to get more specific about, because people use the term modularization constantly in everything that I spend time on. And in the context of a green hydrogen world, there's sort of an even more extreme version of modularization as well. You could imagine building factory built small electrolyzer stacks and then numbering up. And so if you want to build a 100 megawatt project, you're going to build 101 megawatt electrolyzer stacks and then put them all in series, basically. That's not what you're talking about, though. You're talking about modularizing something that is still basically at the scale of the chemical industry, right? What can be, but is dense enough that it can be built offsite and transported to site? So that is like a key distinction, I think, right? It absolutely is, Shail. And I'll admit to you that early on in our company's history, we debated and analyzed both approaches, because it is appealing to think you can build in a small package, a thing that's, you know, maybe let's call it a two megawatt electrolyzer that's completely self-contained and simply focus on cost reduction and automation. Which is the small thing. You know, you said you spent a long time in solar. That's what worked in solar, right? It's super modular. Actually, yeah, yeah, yeah. It's actually interesting to take that solar analogy further. Actually if we look at inverters in the solar industry, we've seen both approaches. We've seen large central inverters and we've seen more recently, like in the last decade, the advent of string inverters for large utility scale systems. And there was a lot of principled debate early on which one made more sense. And there are good reasons to think string inverters could make a lot of sense in large solar arrays. Turns out not so much. The industry kind of went back to large central inverters as a more effective cost-effective solution. Not only because the construction costs are lower, but also operation and maintenance complexities are more manageable. You can see the same thing going on in green hydrogen, but it turns out that at least based on our analysis, and I think we're seeing it play out in the industry, the idea of integrating onto a site hundreds and hundreds of very small containerized electrolyzers, it turns out to be quite expensive. And in no small part it's expensive because it's very hard to drive the cost out of those units, but also because the footprint of the entire plant ends up being quite large, and hence, EPC integration costs get large again. It turns out it's hard to get the power to all of those boxes and aggregate and collect the hydrogen from all of those boxes and get the water, the clean water to all of those boxes, et cetera, et cetera. Do you ever wonder why it takes so long to get clean energy projects up and running? Do you have permitting reform on the brain? Are you NEPA reform curious? The new PACE study from Third Way pinpoints the non-cost barriers that stand in the way of clean energy deployment and keep new solar and transmission projects in limbo. They surveyed more than 200 industry professionals to understand what's slowing down deployment and offer practical solutions on how to fix it. To read Third Way's full report and to learn more about the PACE initiative, visit thirdway.org slash PACE. You heard the phrase speed to power a lot lately, but here's what it really means. AI data centers are being told that it will take years to get grid power. They can't afford to wait, so they're turning to on-site power solutions like Bloom Energy. Bloom can deliver clean, ultra reliable, affordable power that's always on in as little as 90 days. Bloom's fuel cells offer data centers other important advantages. They adapt to volatile AI workloads. They have an ultra low emissions profile that usually allows for faster and simpler permitting and their cost effective too. That's why leaders from across the industry trust Bloom to power their data centers. Ready to power your AI future? Visit bloomenergy.com to learn more. The grid wasn't built for what's coming next. Electricity demand is surging from data centers to EVs and utilities they need reliable affordable solutions that don't require building expensive new infrastructure. Energy Hub helps by turning everyday devices like smart thermostats, EVs, home batteries, and more into virtual power plants. These flexible energy resources respond in near real time to grid needs, balancing supply and demand. Plus they can be deployed in under a year and at 40 to 60 percent lower cost than traditional infrastructure. That means more reliability, lower costs, cleaner energy, you can't get much better than that. And that is why over 120 utilities across North America trust Energy Hub to manage more than 1.8 million devices. And more at energyhub.com or click the link in the show notes. Okay, so taking a face value that all the things you're describing as the solution work, I mean, I think it's important for people to have some understanding of where we think costs realistically can and should go then. We've talked about where they have been for the Siemens and T-Sim crypts of the world and that $3,000 a kilowatt actual delivered CapEx range. That's actually good. What is realistic but good? And then we should talk about what the market looks like for good. Yeah, great. So I'll just give you our numbers. And then I don't know that I've spoken publicly about our prices, but I'm going to here if you're okay with that show. This is your call. Let's do it. So we're pricing in the European market today with a total installed cost just north of $1,000 a kilowatt. So inclusive of EPC. Inclusive of EPC. That's everything from the substation, the civil works, all of our equipment, the installation and commissioning. It's basically the bill to the project developer for a hydrogen plant. Now of course that varies from site to site, but that's rough numbers. That's about where we are. That's somewhere between a half and a third of the competitive benchmark. Basically whether you're comparing to a Chinese electrolyzer built in Europe by an EPC or a European OEM built in Europe by an EPC. By the way, the EPC business is pretty local. Yeah, we should spend a minute on the Chinese thing because that's the other big looming question here. Are you going to get the question everyone gets, you get all the time? I'm sure. Are we just going to get a flood of cheap electrolyzers shipped from China? And one, is that going to solve the problem from a societal perspective? Are we just going to get cheap electrolyzers like we've gotten cheap solar panels from China? And two, what does that mean if you're not a Chinese player in the market? Yeah, let's talk about that. It turns out a large industrial electrolyzer, green hydrogen facility looks more like a, if you just walk up to it, it looks more like a gas generation plant, like a combined cycle plant, then it looks like a solar array. What do I mean by that? I mean, it's a complicated thing. It's got a lot of pipes and valves and stuff going on, which makes it much less amenable to low cost manufacturing at scale, kind of putting a low cost product in a box in China and shipping it to some place and letting someone install it. So it is true that the global market is flooded with really cheap Chinese electrolyzers. These are like two megawatt electrolyzers that are the size of a school bus and way more than a school bus. And they need to sit in the building and have this like chemical plant wrapped around them to support them and operate them. So the normal approach that China has used in other industries to drive cost out really kind of only addresses the cost of the electrolyzer stack or stack and power conversion. It doesn't address the EPC component of the cost buildup. And so it's a limited, there's a limited opportunity for overall total installed cost reduction, taking that approach. It's real by the way. We see integrators building or promising to build using Chinese equipment, systems in the European market at a total installed cost, you know, right around maybe a little north of $1,500 a kilowatt. So still more expensive than our stuff, but quite a bit cheaper than the name brand European suppliers. So long story short, I don't think the same game that worked in solar works in green hydrant. Yeah. Okay. So let's talk about what the market then actually looks like here. I mean, we've talked about it's been too expensive. There's multiple components. There's maybe less willingness to pay the premium. At least there has been. But in your view, okay, if you can sell at a thousand bucks ish today and drive and that's you know, entering the market at a thousand bucks and presumably we'll be able to drive cost down from there if you're able to scale. What does demand look like? What does it rely upon in terms of policy support? What's your view? Like what's your thesis of the market here? Yeah, the current market is still policy supported primarily in Europe. So Europe has to get a little policy wonky here. Europe has the renewable energy directive three, red three, so called red three. Red three has a component in it called RFMBO, which is the part of the red three law that stipulates the gradual conversion to partial conversion to renewable molecules, e molecules. And these range from hydrogen itself to things like green methanol and green ammonia for various purposes. That policy I think has been, geez, I don't know when red two and three were enacted, but it's been years. But the way European policy works, the EU law has to be what's called transposed or translated into national level rules, which then drive project decisions. And those rules are being transposed as we speak. It's underway. The process is underway. I think Romania has transposed red three now. I think Netherlands are closed. Germany is very close. Spain is about to do so. Long list. And so we are seeing in the short term a policy driven market. What do I mean by policy driven market? I mean, markets where the green product is more expensive than the gray product, but there is a compulsion to make a conversion and hence an absorption of that cost by society. That's the nature of the market today in Europe. Again, kind of similar to the old German feed and tariff days in the solar industry. There was a different mechanism, but still it got the industry going at high speed at the expense of the German taxpayer footing the bill. And in this case, what we're seeing is the European Union stepping up and saying, yeah, we're going to put the bill for some conversion to e-molecules so that we can get this industry going and see where the costs ultimately land. That's the market today. That is not a sustainable market in my view in the long term. It's a necessary first step for the PETAX or green molecule industry to get going. I'm incredibly grateful for Europe's continued, seemingly stalwart support for decarbonization. But we do recognize at least an electric hydrogen that we've got to collapse costs towards what we call fossil parity for the molecules that we produce. And it turns out that's a different number for different products. It's also a different number for different regions of the world. So energy's complicated. ammonia has a different price in different parts of the world, depending on whether you have natural gas and can produce ammonia locally or not, for example. So we are increasingly turning our attention to markets where we believe in the next few years, we can start to approach fossil parity on critical molecules that can achieve scale. I can give you a few examples of that as we talk. Yeah, give me an example or two of where could you achieve fossil parity? What cost would it take on your side for that to be true? And similarly, in those markets, is there a premium that has to get bought down? Is there a secondary benefit to green hydrogen that isn't entirely about the emission savings? What's the theory of the case on how that plays out? Yeah, we are getting more sophisticated on that last point. And we experienced the same thing in the solar industry. If you remember it initially was all about carbon and then later it was about energy security. And today it's about both. It's about energy security. It's about carbon. It's also about volatility hedging. You buy a green PPA. That's a fixed price for 10 or 20 years. Whereas if you buy fossil power, your price for that power kind of floats with the fuel price. So there's various values that can be derived from conversion to renewables that are independent of the carbon footprint of the renewables. And we're starting to see the same kind of more sophisticated point of view on the market emerging in e-molecules. I'll talk for a little bit about a market that I'm really interested in. And it's not a market we're incredibly active in. We've just dipped a toe in the water over there. But the market is Brazil. And give you like a few facts about Brazil. So Brazil is a huge agriculture exporter. I think agricultural exports are about 20% of Brazil's GDP. Represent above 50% of Brazil's exports with most of the rest being minerals, I believe. For this industry to exist in Brazil requires a great deal of artificial nitrogen fertilizer. So as you guys know, right, all agricultural products require nitrogen fertilizer. It's not enough natural nitrogen to go around. And so we make nitrogen fertilizer primarily from almost exclusively from ammonia, which either is used as ammonia or is converted to nitrates or urea or other molecules that are easier to distribute. Brazil, it turns out, imports over 90% of its nitrogen. Its biggest import partner for fertilizer is actually Russia. So alarm bells can start to go off in your mind about the geopolitics of all this, right? The risks that Brazil's economy faces as a result of importing a critical feedstock for its primary industry to the country. But also think about it in terms of the money that Brazil is spending effectively abroad to support its agriculture industry. If you put all that together, you have an interesting proposition for conversion of the Brazilian economy to local production of nitrogen fertilizer. But there's more. Because Brazil imports all of its nitrogen, and the reason for that is simple, Brazil doesn't have natural gas. So they can't produce fertilizer the old fashioned way by cracking natural gas and running it through the Haber-Bodge process. Because Brazil imports all of its fertilizer, the price of that fertilizer is relatively high due to the logistics costs of moving ammonia. Now today, fertilizer coming into Brazil might be $450 or $475 a ton. But if you look back 10 years, the 10-year average is around $600 a ton. And that, you can go 20 years back. It's about the same number, right? It's a very volatile commodity that's not typically bought on long-term contracts. It's traded in the market. It goes up and down and up and down. So if we use that $600 a ton benchmark as the bogey for what I'll call fossil parity ammonia in Brazil, the billion dollar question is, can we achieve that using electric hydrogen's to get green hydrogen production to produce e-ammonia? And the answer turns out to be, yeah, we think we can. So we've done a lot of analysis on this particular market case. There's another really kind of positive fact pattern about Brazil. It has a great deal of hydropower and is increasingly installing more and more solar and wind. The result of this is Brazil's grid is around 90% green already. And power prices, at least away from the coastal economic centers, are quite low, $30 to $35 a megawatt hour. That in and of itself allows us to make on the order of $750 a ton ammonia today with our equipment, which is not quite fossil parity, but not a huge stretch from it. With the other benefits to Brazil's economy and resiliency on shoring the production of fertilizer, we think there's a strong business case for Brazil as a country to start to build out local ammonia production. Now if you take our technology roadmap a little further out and you think about scale and also improvements we have coming in our technology, along with what we expect to see in terms of continued cost reduction in wind and solar, we think we can get to actually cheaper than fossil hydrogen around the beginning of the next decade, the next decade. So in the early 2030s, that's a pretty compelling case. That's a market where we think we can be cheaper than the fossil alternative for a critical, critical piece of Brazil's economy. That's the kind of market I get really excited about because now we're not talking about a solution that's better because it's green. We're talking about a solution where green is the icing on the cake, not the whole cake. I think you said that, Shailen. I think that's the, yeah, I mean, that's a, it's a short description of like where I think the world is at, not the world, but at least the US is at the moment, which is like, if you're going to be green, it's often insufficient to be green. You want to green to be the icing, not the cake itself, and you got to have some other benefits. It's universally true, but it's more true today than it was two years ago. I think it's pretty close to universally true today with the possible exception being China. Yeah. I mean, in China, things, right, various things don't hold in China that hold other places, that one probably among them. I guess I want to wrap up then with like, so that's a, I think a compelling promise land of like, let's remind ourselves that the goal of getting this market, the green hydrogen market off the ground is to replicate a version of what we've already seen in solar, which is get it to scale, get it on the cost curve, get it so that it is cost competitive. And so you're painting the picture of like where it actually can be cost competitive, straight up without a premium and carry all these side benefits. What does it look like to get from here to there? This is my final question for you. So like paint, paint, you know, we started with the picture of the last five years. What is the next five or 10 years have to look like? So I think the next five years looks like very, very tactical kind of one off projects that are policy driven in places like Europe that have the policy frameworks in place or emerging to motivate consumption of these molecules. And we're seeing that and we're very engaged in that market. That process will get us to scale where we can start to deploy in markets like I described around Brazil, but there are other similar markets. India is a great example of another very similar market with similar fact patterns where we think we can actually solve not just an economic problem, but a host of other problems that are geopolitical in nature. Why do you retain optimism about this market? Bring me into your head and explain to me why you're excited about the future in this market despite that. Yeah, I mean two things. Both of them long term actually. I think the short term is a slog, but really two things. So thing one, I see a clear path to parity with fossil equivalent molecules in a number of industries in a number of places in the world that has me really excited. So really it's all about getting to subsidy free economics and when you get to that, the market is insatiable for a product like ours. So that gets me very excited. And the other thing that gets me excited is my kids. Honestly again, I have kids in their 20s and I know how they think about the problem of climate and energy and they give me optimism that the situation we're in right now, it's a cycle. But if I look out five years out and think on a tenure horizon, we are as a society going to implement innovations to fix the problem. All right, Rafi's always appreciate the conversation and the candor and the optimism. And we'll check back in once we've got a bunch of these multi hundred megawatt actually cheap green hydrogen plants up and running and see where we are on the cost curve. Well, Cheryl, we're building our first one in West Texas today and it's going extremely well. So I'm looking forward to showing that off to you when it's up and running. Rafi Garabedian is the co-founder and CEO of Electric Hydrogen. This show is a production of Latitude Media. You can head over to latitudemedia.com for links to today's topics. Latitude is supported by Prelude Ventures. This episode was produced by Daniel Waldorf, mixing and theme song by Sean Mark Pond. Stephen Lacey is our executive editor. I'm Shail Khan and this is Catalyst.",
    "release_date": "2025-11-13",
    "duration_ms": 2488000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI3500356708.mp3?updated=1763008074",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-11-21T01:49:12.325990"
  },
  {
    "title": "Inside a $300 million bet on AI for physical R&D",
    "description": "A big problem with using artificial intelligence to discover new materials? It struggles to predict beyond its training data. That means AI might be better at optimizing known materials than discovering entirely new ones — like a room temperature superconductor or carbon-capture sorbents. \n\nBut since we last covered the topic in September 2024, a few things have changed. OpenAI released its powerful O1 reasoning model. Large language models have also gotten better at math, physics, and coding. And lab automation — robots mixing liquids and powders, running characterization tests — has improved, allowing for a higher volume of experiments. \n\nSo, can these improvements overcome AI’s training data problem?\n\nIn this episode, Shayle talks to Ekin Dogus Cubuk, cofounder of Periodic Labs, which raised $300 million seed round in September. Last year, Dogus took a more cautious view on using AI for materials discovery. Now though, he’s convinced there’s a clearer path forward for physical science research and development, especially materials discovery. Shayle and Dogus cover topics like:\n\nCreating experimental and synthetic data to overcome AI’s limitations of predicting beyond its training set\n\nWhy we should focus on breakthrough discoveries over easier, incremental wins\n\nThe different roles humans and AI play in the discovery process\n\nPeriod’s focus on automated experimental labs using AI-generated hypotheses\n\nResources:\n\nCatalyst: Can AI revolutionize materials discovery?  \n\nLatitude Media: This ‘superintelligence platform’ just raised $200m in seed funding  \n\nLatitude Media: Can AI get us closer to fusion?  \n\nThe New York Times: Top A.I. Researchers Leave OpenAI, Google and Meta for New Start-Up\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is our executive editor. \n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.\n\nCatalyst is brought to you by Bloom Energy. AI data centers can’t wait years for grid power—and with Bloom Energy’s fuel cells, they don’t have to. Bloom Energy delivers affordable, always-on, ultra-reliable onsite power, built for chipmakers, hyperscalers, and data center leaders looking to power their operations at AI speed. Learn more by visiting BloomEnergy.com. \n\nCatalyst is supported by Third Way. Third Way’s new PACE study surveyed over 200 clean energy professionals to pinpoint the non-cost barriers delaying clean energy deployment today and offers practical solutions to help get projects over the finish line. Read Third Way's full report, and learn more about their PACE initiative, at ⁠www.thirdway.org/pace⁠.",
    "summary": "The podcast discusses the advancements in AI for materials discovery, particularly focusing on Periodic Labs, a company working on AI for high-temperature superconductors. The conversation delves into the challenges of AI in making breakthrough discoveries versus incremental progress, highlighting the importance of combining digital and physical domains to accelerate discoveries. The podcast also touches on the significance of superconductors, their potential impact, and the various improvements needed to achieve breakthroughs in the field. Additionally, it explores the role of AI, high-throughput experiments, and automated processes in advancing material science. The episode concludes by addressing the rewards for AI systems in achieving goals like finding room temperature superconductors and the complexities of setting such objectives.",
    "transcript": " Latitude media covering the new frontiers of the energy transition. I'm Shail Khan and this is Catalyst. I have to say there's a difference between winning gold medals in Matholimpiauts and scientific discovery. Like you can practice for Matholimpiauts by studying previous years problems. You can't really practice how to discover the next big theory but they were getting better at reasoning on complex problems. Coming up, can AI discover a room temperature superconductor? Volume 2. Clean energy is under attack and it's more important than ever to understand why projects fail and how to get them back on track. The center left think tank 3rd way surveyed over 200 clean energy professionals to answer that exact question. Their newest study identifies the top non-cost barriers to getting projects over the finish line, from permitting challenges to nimbism. To read 3rd ways full report and to learn more about their pace initiative, visit 3rdway.org slash pace or click the link in the show notes. The AI boom is here but the grid wasn't built for it. Volume energy is helping the AI industry take charge. Bloom energy delivers affordable, always on ultra reliable on-site power. That's why chip makers, hyperscalers and data center leaders are already using bloom to power their operations with electricity that scales from megawatts to gigawatts. This isn't yesterday's fuel cell. This is on-site power built to deliver at AI speed. To learn more about how fuel cells are powering the AI era, visit bloomenergy.com or click the link in the show notes. Surging electricity demand is testing the limits of the grid but Energy Hub is helping utilities stay ahead. Energy Hub's platform transforms millions of connected devices like thermostats, EVs, batteries and more into flexible energy resources. That means more reliability, lower costs and cleaner power without new infrastructure. Energy Hub partners with over 120 utilities nationwide to build virtual power plants that scale. And how the industry's leading flexibility provider is shaping the future of the grid, visit energy hub.com. I'm Shale Khan. I lead the early stage venture strategy and energy impact partners. Welcome. So, a year ago, a little over a year ago, I had Doge Tubuk on this podcast to talk about using AI for materials discovery, which has all sorts of interesting applications in the spaces that we talk about here. At that time, Doge had been leading efforts in that area for Google DeepMind for some time. And I thought of him as being both very knowledgeable in this space, obviously, also pretty sober about it. Fast forward a year. Doge left Google DeepMind earlier this year and along with Liam Fettis, who was one of the co-creators of Chachie BT, started a company called Periodic Labs, which raised, wait for it, a $300 million seed round, led by Andreessen Horowitz. Epic is doing AI for materials discovery. Not just that, also physics and chemistry. They're also very much hardware in the loop. The way I like to frame it is that they are building two kinds of Frontier lab at once. There's a Frontier AI lab and a Frontier Scientific lab, the type of lab that we used to talk about. And then they're trying to make those two things work together to make breakthrough discoveries. Notably, one thing we talked about last time was how the AI materials discovery companies at the time tended to start by going after often discovery of something like metal organic frameworks or moths for carbon capture, which I think of as less of a breakthrough opportunity, really, from a global scale. Whereas the big, perhaps biggest breakthrough to prove would be the discovery of a room temperature superconductor. Well, Periodic makes no promises, but they're very publicly working on high temperature and maybe room temperature superconductors. Based on that last conversation, to be honest, I wouldn't have predicted this. So it was time to have Doge back on and hear what changed and how. Here's Doge. Doge, welcome back. It's great to be back. It's great to see you. A lot has changed since the last time we talked. So I looked back. So the last conversation that we had was just over a year ago, September 2024. And I was having you explain to me the wild world of AI for materials discovery in particular and the work that you'd been doing at Google DeepMind, but also just like the broader landscape. And I'll tell you my takeaway from that conversation, which you can tell me if I had the wrong takeaway at the time, but my takeaway was promising field, pretty unclear if and when this new wave of LLMs and the reinforcement learning, all the things that have shown up in the past years, pretty unclear if and when that would generate a real meaningful breakthrough discovery in materials. And we talked through a bunch of the reasons why it's challenging training data, maybe chief amongst them. But I came away with a pretty, I think like a sober view of the path there. Okay, so fast forward a year and you left Google DeepMind started a company to do that amongst other things. So I guess the first question that I have for you is what changed in the last 12 months to make you to give you conviction that like now is the time. Great question. So when we talked, I was doing research in the field, though, computational material science and machine learning. You know, specifically we were using graph neural networks. We were using density functional theory and we were trying to discover materials. One thing that changed since our discussion was the LLMs have improved even further. So at the time I wasn't using LLMs much at all. But I think right around when we were talking, the O1 came out, right? The reasoning models started showing up. And that was a huge update for me because you might remember that one of my big concerns is machine learning works best on the training set distribution. But in science and technology, we almost only care about outdoor domain generalization. So what O1 showed is if you spend test time compute, you can get better results. So that was very exciting to me because there was one way of investing resources that was beyond the training set. So okay, if I can try to translate that into layperson terms, the reasoning model like OpenAI is a one model, introduced, unlocked a door kind of, that maybe allows you to break this challenge of the limited training data set that you have in materials discovery. That was what we spent a lot of time talking about a year ago, was like, you know, you can compare the corpus of data that an LLM trains on to do language, which is enormous. It trains on the internet, basically, versus the corpus of data that you were dealing with in trying to discover novel materials. And it was thousands of data points, not tens of billions or whatever. And so that presumably hasn't changed at least yet. But you're saying that the reasoning models have gotten good enough that they are able to sort of get around that challenge via reasoning or possibly generating their own synthetic data. Like what is it that allows them to break that? So I'm not saying that they're good enough already, but that was one step in the positive direction. And another thing, you know, we've seen is they've gotten really good at math. So, you know, since last time we talked, they started winning gold medals in metal impiades. And they're doing similarly well on coding, really well on physics for impiades. And I have to say, there's a difference between those things and scientific discovery. Like you can practice for metal impiades by studying previous years problems. You can't really practice how to discover the next big theory. But it did show you that they were getting better at reasoning on complex problems. So then what else do we need? So I think the biggest thing we need is to have our own lab. Because once you have a very intelligent reasoning LLM, you still can't discover things unless you make trials, right? Like just like humans, the LLMs will be wrong often when they try to predict things outside of their training set. But you try many things. And then at some point, you get a really cool discovery. And this is, you know, as we talked about history last time, this is quite common in solid state chemistry, solid state physics, where a lot of discoveries happen somewhat by accident, but of course with the Lado background, understanding of the physical system and a lot of trial and error. So okay, so this is what you're doing at periodic, right? You're combining the digital domain with the physical domain. You have a lab in both sense. It's a frontier lab and an LLM sense and a frontier lab in a laboratory sense and the traditional sense of the word. And you're sort of merging the two. I'm curious in practice, like how you imagine that feedback loop working. So is it a traditional, you develop a theory, you run an experiment, you generate data from that experiment, but in this case, you feed the experiment back into your customized LLM as an additional set of training data. And then that's the way that the loop works, or is it more complicated than that? Yeah, exactly. I mean, it's pretty simple, I think as you said. So the LLM can propose, for example, synthesis recipes, or it can propose simulations to run. And because the LLMs are pretty good at tool use, it can actually do it itself. And then you get some results back. So the results from experiment could be some characterization data, results from the simulation can be some trace or some simulation you did. And now the LLM can go through it with the context of its previous training, maybe the context of relevant papers, textbooks, but also now the results that it just got that no one else has ever seen. And then now it can kind of tweak the experiment, tweak the simulation for the next step. Right, you said one thing in there that I guess is worth pointing out, like you're trying to automate this as much as possible. The LLM might run the experiment. Yeah, absolutely. I mean, one of the other advances that's been happening recently that I think made periodic possible is the high throughput experiments have been getting better. There are many examples of this now across academia industry where these robots that became quite commoditized actually, just mixing powders or mixing liquids and then sending into characterization. I think one thing that isn't as advanced right now, but we feel like we can do pretty soon is automated characterization itself. So you mix powders, you put it in some characterization tool, you get the result out. What is the actual output? I think this is pretty difficult right now for AI tools, but we feel like we can improve it pretty quickly. I want to talk about one specific application that I know you're going after that we actually did talk about a year ago, but also I want to talk about it as a way to see whether one of the other things you described as the fundamental challenges has changed, which was, as I understood it, AI being pretty good at the next incremental discovery, but not necessarily good at the breakthrough discoveries you said through history. Usually that's done accidentally or often it's done accidentally because it's not, you can't like reason your way to this massive breakthrough discovery. So let's talk about superconductive materials. We talked about this last time where all these companies that existed at the time that we're doing AI for materials discovery were starting on things like discovering a novel mop for carbon capture or whatever. But we said the thing that would be the real breakthrough, the big thing would be a room temperature superconductor. You guys have since been launching been very public about superconductive materials, maybe not room temperature. I'm curious for you to tell me how likely you think that is, but high temperature superconductors is on the roadmap. So why, first of all, and then second of all, like this question of do you think you have a path to the truly breakthrough, what would the path be to a truly breakthrough discovery as opposed to finding something that is a material that is superconductive at a ever so slightly higher temperature than the best that we've got today? Yeah. So to answer your first question, I think it's still true that it would be difficult to just reason your way into a much better superconductors. I actually would guess that there's a law out there that we haven't discovered yet that says that you can't just look at your training set this different time we're trying to discover and just predict it. There's been rules that we discovered from 1800 zone where you connect energy to work. So thermodynamics is the first example. There's more recently Landauer's limit which shows that you have to spend a certain amount of energy to delete information which can be used to describe Maxwell's demon contradiction. I bet there's something similar for how hard it is to discover things. It's outside of your training domain. Okay. So I don't think that's been fixed since last time we talked. But because we have a lab internally, we can just try things and try them at large scale and often and hopefully as intelligently as possible. So even though we won't reason our way into a much better superconductor, we'll be able to push our trials in the direction that's most promising or most promising for us given our training set at the time. So yeah, I think that hasn't changed. And I think there's reason to be hopeful because in the big scheme more things is a pretty new field. I mean, if you look at Cooperates, they were from 1985. There's been a lot of advances more recently. So yeah, we're very excited. One reason we chose superconductivity is if you find a good superconductor, that's impactful immediately. Right? Like last time we talked about how long it can take to translate materials and prunes into products. One nice thing about superconductors is if somebody discovers a room temperature superconductor today, even before it makes it into a product, it has huge impact. Like first of all, it changes how we think about the universe. Second, it helps us do physics experiments that wasn't possible before. And whenever you think about a sci-fi-ish technology like quantum computing, fusion, superconductors come up because that's kind of what we need. It's kind of like one of the most exciting macro-scale quantum phenomena. So this one isn't a big picture because it kind of is exciting as soon as we succeed. The other reason is it requires all sorts of improvements to get there. You know, when we think about open AI and deep mind, I remember back in 2016, people used to make fun of these institutions for prioritizing AGI so much because they were saying we're going to do AGI. But what happened is they developed so many other tools on the way to AGI, they were useful in themselves. But today they have these alarms that you might consider AGI or like something really impressive. Superconductivity is a bit like that. To discover an exciting superconductor, we probably have to develop so many capabilities on the way there. That's by themselves very useful. For example, automated synthesis, automated characterization, being able to model or predict high temperatures for conductivity because we don't have a theory for it yet. So it's kind of like a nice goal that unites people and requires a lot of other useful things to happen on the way. And it's one of those things that physicists find really exciting. So the physicists in our company are really excited by this mission, but also computer scientists find it very exciting. It's just one of those things that I think both sides can really appreciate. So those are some of the reasons that we picked it. Do you ever wonder why it takes so long to get clean energy projects up and running? Do you have permitting reform on the brain? Are you NEPA reform curious? The new pace study from Third Way pinpoints the non-cost barriers that stand in the way of clean energy deployment and keep new solar and transmission projects in limbo. They surveyed more than 200 industry professionals to understand what's slowing down deployment and offer practical solutions on how to fix it. To read Third Way's full report and to learn more about the pace initiative, visit thirdway.org slash pace. You heard the phrase speed to power a lot lately, but here's what it really means. AI data centers are being told that it will take years to get grid power. They can't afford to wait, so they're turning to on-site power solutions like Bloom Energy. Bloom can deliver clean, ultra reliable, affordable power that's always on in as little as 90 days. Bloom's fuel cells offer data centers other important advantages. They adapt to volatile AI workloads. They have an ultra low emissions profile that usually allows for faster and simpler permitting and they're cost effective too. That's why leaders from across the industry trust Bloom to power their data centers. Ready to power your AI future? Visit bloomenergy.com to learn more. The grid wasn't built for what's coming next. Electricity demand is surging from data centers to EVs and utilities they need reliable affordable solutions that don't require building expensive new infrastructure. Energy Hub helps by turning everyday devices like smart thermostats, EVs, home batteries and more into virtual power plants. These flexible energy resources respond in near real time to grid needs, balancing supply and demand. Plus, they can be deployed in under a year and at 40 to 60 percent lower cost than traditional infrastructure. That means more reliability, lower costs, cleaner energy, you can't get much better than that. That is why over 120 utilities across North America trust Energy Hub to manage more than 1.8 million devices. Learn more at energyhub.com or click the link in the show notes. I guess back to this question of how do you distinguish between the incremental innovation, which to be clear, if you develop or discover a superconductor at a higher temperature than anything that we've got today, that's meaningful. It's probably orders of magnitude less meaningful than if you discover a room temperature superconductor. I presume that the scientific challenge is commensurately distinct between those two. The way that LLM's work, as I understand it, at least in part is on these reward functions. Are you setting your AI system a goal of finding a room temperature superconductor and then everything flows back from there, here are the steps and all the things we have to fix to get to room temperature? Or do you say, improve this characteristic such that we can incrementally build our way there? In other words, are you going to find 10 supercondors? I think of it as a different thing from, but the alternative version of this is what happens in nuclear fusion, where everybody is chasing this same goal of Q is greater than one, like energy break even. Everybody is getting incrementally closer and closer and closer and eventually, NIF breaks it or somebody breaks it. Is it going to look like that or is it going to look like we've discovered nothing until we discover the room temperature superconductor? As you said, I think there are many different ways of improving superconductors without getting a room temperature superconductor. One of them could be having a significant increase in TC, but another one could be a really high critical magnetic field, which turns out might even be more important for fusion applications than TC itself. Another one can be more mundane, like some mechanical properties, like a superconductor that also is ductile and we can make it into devices. So we wouldn't rule out all of these very exciting developments just for your room temperature TC. But how do you set the reward function for your model? What are you optimizing it for then? I think that's an empirical question. I think one thing I should say is it's quite nice because it's hard to reward hack. One of these issues with RL and training all the M's is you might worry about reward hacking. And in simulations, again, reward hacking can be a problem, even in DFT. But for real life experimental measurement of TC, it's much harder to reward hack, which we love. If our reward was increasing TC, that just seems like a nicer unhackable reward. But in terms of what specific will get us there, we're not sure yet. I mean, it's an empirical question. We can probably try all of them. I'll list the things you propose and we'll try all of them. I guess that gets to the other question, which is what does the human in the loop look like here? And again, as you said, if we haven't solved the AI is good at incremental innovation and not orthogonal breakthrough innovation thing, the humans are, historically, at least better at it. Is it like, folks on your team developing a theory of something and that gets fed through the model and you get the results and you feed it back in, you see whether it's a promising category, like is the germ of the original idea of what to look for coming from a human or is it coming predominantly from the model and then the humans have to interpret and send it off in various directions? Yeah, I mean, that's a great question. We're not really prioritizing full automation anyway. So if we get better results with humans doing part of it, that's great. This is also actually a question for a lab, right? Like, do we want to automate every single aspect of the lab? At some point, you end up needing human noise for that. And I think that's not like Liam, my co-founder and I, we are trying to be very pragmatic about it. Like our goal is to get the best result possible on the things we care about. And how much of the automation comes from the ML, how much it comes from more traditional tools and how much it gets done by humans, I think that's kind of, again, an empirical question. I think, as you said, it does seem like today there are things that ML AI is better than humans, but one of those things is not hypothesis generation. So I mean, there are two options that we either have to improve the Zalandron hypothesis generation, which is possible. Or the other option is we have humans providing some other hypotheses and then AI doing the execution. I guess the other question here is cost. I mean, you guys raised a $300 million seed round. So that implies on the outside that your cost structure will look similar to other companies that basically have to are going to use just an enormous amount of compute. And so like a lot of that cost comes from compute. In your context, I can imagine maybe that being true, but also maybe that not being true because you, again, you just don't have the same corpus of data. You can't build a 10 billion parameter model right now because the data isn't there to do it. And so instead that cost is going to go more toward the robotic lab and all that kind of stuff. Like, how should I be thinking about how much compute you'll use and where that costs come from? Yeah. So honestly, compute is very expensive. And we are going to train LLMs. We are going to use GPUs to run simulations. So that does end up being a large part of the cost. Yeah, it's funny that before, you know, if you ask me this question 10 years ago, I would have thought that the biggest part of the cost must come from the lab because like physical, it's real, you're building this lab, you're buying instruments. But turns out the GPUs are so expensive and training LLMs is so expensive. So when we were thinking about how much to raise, we kind of laid it out in terms of the GPU cost, the lab cost. And this was kind of a minimum number we felt like was viable. And yeah, we'll see the GPUs have been getting more expensive recently. I guess we'll see how the market dynamics continue. To what extent do you end up building generalized model or models versus models designed to a specific domain, even a specific scientific domain, right? Like you guys are doing your material discovery obviously, but physics and chemistry and these things all intertwined. But like, is this same model going to be equally capable across all domains? Is that the intent? Or is that just not how they supposed to be architected? That's right. And this is actually something we're very excited about. You know, one thing I've been kind of noticing is like in the past, say, three, four years, I had a chance to collaborate with very, you know, world class best in their field scientists. And even when you work with them, you realize that while their expertise on a few domains is, you know, incredible, maybe best in history, there's just so much more to know in chemistry and physics that they may not know all the other aspects of it. So this is why I brought up superconductivity because you might actually need to be really good at, you know, self state chemistry and synthesis of difficult novel materials just because, you know, you don't know which chemistry the superconduct is going to come from. Some of these ideas you might have may not be as stable thermodynamically, so you need to be intelligent about how to kinetically force it into the phase you want. But at the same time, in addition to self state chemistry, you need to be incredible at condensed metaphysics, right? Because like, there's so many different kinds of superconductivity, we don't understand most of them very well. And there's nobody in the world who knows both of those equally well or sufficiently well. And it turns out this is true for many different aspects, like if you need to use robots or high-through synthesis, again, like there are only so many people who understand robots and how to use them for synthesis. So I think this was different in 1800s probably. Like there was probably a time when a physicist could contribute and be one of the best in the world on many fields of physics. But it's definitely not true today. And this is one of the reasons I think we are very excited about LLMs because when you talk to them, they seem like they have a pretty good understanding of self state chemistry and self state physics at the same time already. And we're, you know, trying to improve them further in the physical sciences specifically because that's where we are really interested in. And then we're hoping that there'll be a good of multiples of these. And then a really exciting prospect with that is a lot of the exciting discoveries happen to lie in between fields, right? Like, that's why it's sometimes easier to be interdisciplinary. And there's so many of these surface areas between these different fields. It's like, I guess science is kind of like a fractal in the way it's hierarchically organized. And there's so much surface area that humans have exploited, of course. But then there's probably so much left to exploit. And we're excited about an LLM that can basically do that. It is scale that humans couldn't get. How could the LLMs today or the best in class of what you guys have at generating synthetic data in this domain? And another way to ask this question is, you know, if you've asked forward three years, you're fully up and running and you're operating how much of the valuable insight you will generate, do you think will come from the physical data coming out of your lab versus the synthetic data that the LLMs create on top of that? Yeah, that's a great question. I obviously don't know the answer, but it's great to brainstorm about that. On the one hand, the lab data will be kind of our additional data that other LLMs may not have. And you might think that the lab data will only be as valuable as the results in it. But on the other hand, what's interesting about scientific data is it's not just a few bits or numbers, right? Like, for example, there are certain experiments you can run where the result you get from it is just, say, three floating point numbers. But the implications of those could be tremendous, right? It's not just going to be like a few bytes. It will actually be potentially an incredible amount of understanding just from a few experiments. And this has been how it is in human history, right? Like, there are certain experiments that told us so much about how we understand about the universe. And the way to do this with synthetic data can, of course, be, you know, you run simulations, they relate to that experiment. And then when you get the experimental result, that actually validates or refute so much of the simulations you ran. And then that is a lot of information in itself. So, you know, it's a very interesting question. And I think there are some actually differences about how you think about synthetic data when it comes to LLM, this good as science. And exactly, I mean, this is one of the reasons I really want to work on this because this opens up questions for LLMs and LM training. This may be different than what the frontier labs are thinking about right now. You know, if they're only thinking about math and logic and kind of what's on the internet, like accounting tasks, that's a bit different than if you're trying to do experimental physics, experimental chemistry. It just seems like a very exciting question to explore. I want to talk a little bit about how you build a business out of this. I mean, you mentioned the superconductor example, and you said, like, there's a lot of value in this long before this novel superconductor goes into a product. But ultimately, kind of has to go to a product of some sort for you guys. And I think we talked about this a little bit last time too. There's this question of, okay, so if your job, your core job, the periodic is to discover new things that are going to be valuable in the world, say you do it. To my mind, there's sort of a binary decision you have to make at that point. Do you try to sell the discovery, license the technology, license the IP to somebody else who's going to go produce it and turn it into a product, or do you produce it? Do you sell the product? Do you sell the discovery or do you sell the product? Do you have a prior on which direction you want to go here? Great question. And you know, I think the two options can be correct depending on the context, depending on the timelines. But honestly, it also depends on where we are in the company. So at the very beginning, you can imagine our LMS will be very impactful for other companies doing physical R&D. Like, you know, already they're in people. Like contract with people. Yeah, exactly. I mean, there's a lot of interest in being able to use these LMS. Sometimes the data restrictions don't allow it because you don't necessarily want to put your data on an LLM, you know, on the web. Sometimes the other issue is you haven't trained the LLM on your data, so it's actually not as good as it could have been. That kind of improvement could be really impactful because we've seen how impactful LMS can be in other fields where they have access to the data. So there's a lot of, I think, headroom for impact there. But in the longer run, you can also imagine a case where we as a field get really good at designing materials intentionally. That hasn't been the case. But if you look at drug design, there was a time when designing drugs wasn't very profitable. And I think people were located and say, this is not a good business. But what happened with Genentech is the field got so good at designing drugs that at some point it became very valuable itself. The machine learning field has been making huge improvements in material science that, you know, was kind of hard to predict. So it'll be interesting to see how far that goes and whether materials discovery by itself becomes a very exciting business similar to drug discovery. But for us, you know, we already see this big need and like big potential for impact by providing these LLMs to do physical R&B. Yeah, almost like this is going to be the wrong analogy, but it's partially right. Like almost like an AWS, like you're going to have the infrastructure. In this case, the infrastructure is your custom designed LLM that is smart about physics and chemistry and all these domains and also your physical lab and them being interconnected with each other. And so you have all this infrastructure and scale in that infrastructure that you can use to go convince whatever large company that's doing R&D that they should just be outsourcing it to you rather than rebuilding the whole same thing in house, which is not exactly what the cloud providers are. But you know, there's enough of a relationship there. So that that feels right. But it is I suspect. Yeah, I guess this is what you're saying. This is I suspect a smaller ultimate opportunity than the you proactively discover a bunch of novel materials that change the world. And then however you monetize them, you prove you're able to do so repeatedly. And then your Genentech and you know, it's a whole different category. Yeah. You know, one other thing you see is people are so excited about this. You know, they want to see LLM's not just conquered a digital world, but also, you know, really impact the physical world and you know, impact the atoms basically. So I feel like this has to be done. And the team has been very excited. We're like, it's really amazing. We're hosting weekly seminars where the physicists will teach the computer scientists about the physics and the computer scientists will teach the physics about LLM's. And of course, there are all the people in between, right? That is actually again, like a fractal. So yeah, I think there's been a lot of excitement about seeing if these technologies can be used not just for the digital world, but also for constructing the atoms around us. I guess maybe the last question you said at the beginning, the thing that changed between a year ago and now in part was advancements in the in the big LMS, right? The O one model and so on. Is there a next like, what could change in what could open AI release in a year or two years from now that would be a big leapfrog for you? Are you branching off now from what the big LMS are going to do? And you know, everything that all advancements are going to come from periodic? Or is there something else that they could offer that is a step function change in your capability to discover new materials or whatever? Yeah, great question. I think we actually basically rise with the tide, right? Like as LLM's get better, there's so many advantages of that to other applications. For example, the LLM's are getting very good at coding and that's not surprising because programming is a kind of closed environment. You can just simulate in your computer and get valuable feedback and then quickly improve. But as computers get better at coding, that's huge for science because then you can run simulations more efficiently. The simulations themselves can improve similarly with tool use experiments. So I think as LLM's improve in general, there's going to help a lot with science applications. There are maybe longer term things that can happen. One of them could be things like hypothesis generation or more auto domain generalization. But then a question there is, will that come from status quo, like how LLM's are being trained now? Or will it come from actually labs that try to improve scientific reasoning for these airlines because then maybe hypothesis generation emerges naturally or auto domain generalization emerges naturally because that's what you're trying to get at with your reward. So I think there'll be a very exciting question to see maybe next time we chat. Love it. All right. Thank you so much for taking some time again. I'm very excited to see what you guys discover and for when your room temperature superconductor is shooting electricity all around the world around me. Okay, well, thanks. It was great. Cheers. Doge Chewbook is the co-founder of periodic labs and a former researcher at Google DeepMind. This show is a production of latitude media. You can head over to latitudemedia.com for links to today's topics. Latitude is supported by Prelude Ventures. This episode was produced by Daniel Waldorf, mixing and theme song by Sean Marquand. Stephen Lacey is our executive editor. I'm Shane O'Con and this is Catalyst.",
    "release_date": "2025-11-06",
    "duration_ms": 2186000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI9091142033.mp3?updated=1762407998",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-11-21T01:52:33.743868"
  }
]