[
  {
    "title": "The rise of permissionless DERs",
    "description": "Distributed batteries are having a big moment. On one hand, companies like Base Power and Tesla have leaned into large residential batteries that export power back to the grid, but need permits and inspections to operate. At the same time, however, a new category has emerged: small, \"plug-in\" batteries that don’t require an electrician or complex installation, let alone a permit. \n\nIn this episode, Shayle talks to James McGinniss, co-founder and CEO of David Energy (yes, the biblical reference is intentional). David Energy is deploying these nimble, permissionless systems today for both residential customers and small businesses, and James argues that this approach could usher in a new era of massive scale and affordability for distributed energy resources.\n\nShayle and James cover topics like:\n\n\n  \nWhy James prefers the term \"plug-in\" over \"permissionless,\" and what falls into this bucket, from balcony solar to battery-enabled appliances\n\n\n\n  \nThe murky regulatory landscape around micro-DERs\n\n\n\n  \nHow plug-in systems can effectively drive soft costs (permitting, labor, customer acquisition) down to nearly zero\n\n\n\n  \nHow high energy prices in Germany drove the adoption of 4 million plug-in systems in just a few years\n\n\n\n  \nThe appeal for small businesses: how shaving just a few kilowatts of peak demand can generate significant savings for commercial customers in markets like New York\n\n\n\n  \nFuture form factors, including batteries integrated directly into cooktops, heat pumps, and other household appliances \n\n\n\n\nResources\n\n\n  \nCatalyst: How Base Power plans to use its fresh $1B\n\n\n\n  \nCatalyst: The new wave of DERs\n\n\n\n  \nCatalyst: Is now the time for DERs to scale?\n\n\n\n  \nLatitude Media: Can VPPs unlock grid capacity for data centers? \n\n\n\n  \nLatitude Media: How do we turn small-scale, distributed energy into a multi-trillion dollar sector?\n\n\n\n\nCredits: Hosted by Shayle Kann. Produced and edited by Max Savage Levenson. Original music and engineering by Sean Marquand. Stephen Lacey is our executive editor.\n\nCatalyst is brought to you by Uplight. Uplight activates energy customers and their connected devices to generate, shift, and save energy—improving grid resilience and energy affordability while accelerating decarbonization. Learn how Uplight is helping utilities unlock flexible load at scale at uplight.com. \n\nCatalyst is brought to you by Antenna Group, the public relations and strategic marketing agency of choice for climate, energy, and infrastructure leaders. If you're a startup, investor, or global corporation that's looking to tell your climate story, demonstrate your impact, or accelerate your growth, Antenna Group's team of industry insiders is ready to help. Learn more at antennagroup.com.",
    "summary": "I think there's companies like Critical Loop out there like now doing stuff like this. Right. But yeah, so I think whether it's a it's a battery, it's solar plus storage, it's it's solar alone. I think we could see like 10% or more, which is wild to think about in these small systems. Like it's just a small battery.",
    "transcript": " Latitude media covering the new frontiers of the energy transition. I'm Shell Kahn and this is Catalyst. For the first time, maybe our industry can really focus on affordability being the be all and end all in DERs and not resilience because I think over the last decade it's been a lot of resilience because it's a premium product but permissionless speaks to, no, these are super cheap, they're easy and it's all about cost savings. Coming up, it's plug and play or plug in store, I guess. What if utilities could meet surging electricity demand with energy assets already in homes and businesses? Uplight is making this possible by turning customers and their smart energy devices into predictable grid capacity through an integrated demand stack. Uplight's AI driven platform activates smart thermostats, batteries, EVs and customers to generate, shift and save energy when the grid needs it most. Learn how Uplight is helping utilities unlock flexible load at scale, reduce costs and accelerate decarbonization at Uplight.com. Catalyst is brought to you by Antenna Group, the communications and marketing partner for mission driven organizations developing and adopting climate energy and infrastructure solutions. Their team of experts helps businesses like yours identify, refine and amplify your authentic climate story. With over three decades of experience as a growth partner to the most consequential brands in the industry, their team is ready to make an impact on day one. Get started today at AntennaGroup.com. I'm Shane O'Con. I lead the early stage venture strategy with energy impact partners. Welcome. Distributed batteries are starting to have a moment. There are lots of examples of this. The biggest recently, probably being base power, you may remember, I had Zach Dell, the founder of base on the pot a few months ago, just right in the wake of their billion dollar fund raise to go deploy residential batteries throughout the country. If you're talking residential batteries, base is at one end of a spectrum. Their whole play is over sizing the battery to use it for market participation. But there's another end to the spectrum, which falls into the category of so-called permissionless CERs or plug-in. It's a broader category that includes things like balcony solar, which is really popular in Germany. But I would say the main thrust of the category, at least in the US, are very small batteries that you can usually plug into a standard 120-volt outlet. You can use them to provide backup for a large appliance, but also maybe to reduce peak charges on the bill, maybe to participate in the management response programs, maybe even to aggregate enough to become a virtual power plant. By the way, they're not just for residential consumers, as you'll soon hear small businesses also can take advantage of them. It's an interesting area with a somewhat unsettled policy and regulatory landscape. But there are some things about it that are extraordinarily attractive, largely the potential for speed and low-cost installation. I've been spending some time trying to make sense of this category. The person who really understands it best, I think, is the one who's actually deploying these systems. That is James McGinnis, who's our guest today. James is the founder and CEO of David Energy. They are deploying these plug-in systems today. You'll hear a little bit about doing it at small businesses in New York. They believe there's a real business there. Let's hear why. Here's James. James, welcome. Thanks, Shell. Thanks for having me. I'm super, super pumped to be here. I'm excited to finally have you on. To talk about permissionless DERs, start by telling me what are permissionless DERs. It's funny because I think we coined, I think Duncan coined the term permissionless on our podcast a couple years ago. I've actually started using a different term. I would say he's probably smart to change the name. I think permissionless is for the wonks and what I've been using is plug-in as for customers and for consumers. It's more intuitive. I do think there's also an important distinction between what those two terms mean. Permissionless, to me, is a very broad category of technologies across segments and verticals and customer sizes that really refers to not needing interconnection agreements. Although I admit that when we came up with it, it was sort of just even something that required less of an interconnection was part of the concept. Really anything that helps you get interconnected to the grid faster and puts less burden on the interconnection process falls into this bucket of permissionless of things that I'm personally excited about. I think some particular examples of that was is everything from impulse labs having a battery in a cooktop that's plug-in to at the time we're thinking a lot about electric era doing battery-enabled DC fast charging where you wouldn't need an interconnection upgrade. You may still even need a permit or permits in that case to see an eye off-grid where you may still need permits of some sort, but you don't need an interconnection. I think there's companies like Critical Loop out there like now doing stuff like this. Then that's not to mention there's plenty of permits that aren't even interconnection related that you do actually need to be thinking about rules and regs. I think permissionless though, at the end of the day, speaks to the concept of being able to do things without heavy red tape or regulation and particularly when it comes to interconnection. You're not submitting an interconnection request, but there is an interconnect there still. I think that's one of the most powerful concepts in this whole thing actually is that the reason it can be cheaper and easier to do and it's so exciting is that the 120 volt or the 240 volt outlet is a pre-existing bidirectional interconnection point on the grid that you can actually push power into and it's safe to do so at the circuit level. When you look at traditional installs, we're basically doing an open heart surgery on the panel. You have to do all this work with an electrician to actually tap into the system, but there's already a point sitting there for you that interconnects into the home and the broader grid through that outlet. I was trying to think what the extension of that analogy would be if normal interconnection is open heart surgery on the panel, are you sticking a lollipop in your mouth or something like that? I haven't even thought of that actually. I don't know. You're putting on a t-shirt more like it. You're using it to function that you have available to you. There's some stuff that's not so relevant in the US currently, but like balcony solar, this thing that is pretty big in Germany, not so much here could be considered into this category as well. But I think mostly, correct me if I'm wrong, mostly what I want to talk about is batteries and you mentioned a few different, I guess, form factors, right? There's the electric era battery integrated into an EV charger or there's the battery that's displacing interconnection for a load or something like that. The category that I know you're spending a lot of time in that I find interesting and want to understand better is the just take a battery and plug it in behind the meter, maybe connected to an appliance inside a load, inside a home or a business or whatever it might be, like a very small home battery. So in that category, there are products available today, right? Anybody can go buy a bunch of different batteries. It seems to have emerged as a category. I don't know. It's been around because stuff like EcoFlow I think has been around for a while, but there's a little bit of a mini explosion here, right? 100%. Yeah, I think us wonks love our ever-multiplying acronyms and definitions and stuff. I think of what you just described as plug-in because specifically, it's very intuitive. You think about plugging a DER or something with a battery or solar. I actually think balcony solar is part of this and is very relevant in the US today that is plug-in solar or plug-in batteries. I just think that makes a lot more in sense intuitively and that it's a subcategory of a broader permissionless space that when we think of permissionless, we think of really big stuff too. That's how I think about it. But yeah, so for today, I actually think plug-in is the right idea to think about. Right. Okay, so let's talk about plug-in. But before we get off of the idea of permissionless, the question of permission and of interconnection is actually like a core question as to the value proposition of plug-in. So what is the state of affairs? If I want to plug one of these little batteries in my house, maybe I'm using it as backup for my fridge or whatever it might be, what is the lay of the land in terms of what requirements it needs to meet? What permissions I do need? Is it murky? Is it defined? Where are we there? It is murky. I think what really matters is the thing we focus on a lot is safety. So there are plenty of UL certified products that adhere to the NEC saying you can plug this in in the following manner and it's safe to do so. And so there may be jurisdictional like AHA's or DOB's or fire departments that have an opinion on what should go in a given location, how big of a battery or something like that. But at the sort of electrical code level, this is already allowed under the current guidance and there are many products that support that. So from that lens, you could say in most places you can go out and buy these things and plug them in in whatever state you're in. A lot of the attention that's happened recently around regulations is specifically there's bills now introduced in I think it's up to 24 states with maybe 30 soon introducing bills where you can actually export to the grid through these devices. And so we think of that as an extremely important distinction where a lot of that regulation that's being passed is focused on really what is an interconnection agreement? What permission do I need from there for the utility? Whereas I understand the utilities concern is hey, if you just start exporting and the grid goes down and our line workers out there, they don't actually know a line is energized and we don't like people just exporting without us knowing what's going on or how much power that may be. And so a lot of these rules that are being introduced and passed are focusing on anything up to typically 1.2 kilowatts is you can export that amount from a meter, from a home. And it's really even narrowly focused on consumer applications. That actually does tie back to the NEC in some ways because it gets into okay, if we're going to make these commercially available and you're allowed to export them, how big of a system do we want to be creating and allowed under or being you all certified because it gets into what actually at the circuit level like a 20-amp circuit, what can that handle? And so there's actually somewhat of an alignment between those two concepts happening, but we view them as actually very clearly distinct. You could have 20 kilowatts of behind the meter capacity and your peak load is 50 kilowatts and you're never exporting. And then that's an interesting question. Do you need an interconnection agreement for that? It's all happening via the plug with you all certified products that the NEC stands on how you're deploying it based on like panel and circuit sizing and stuff. So I just think about it that like when people say back feeding, they typically mean into the grid, but I think under current NEC and UL, you could actually go buy some of these systems today and use them at home. And that's an interesting sort of debate going on right now because some utility people even say even if it's not exporting, there should be a permit or permission. And that is still, you are still interconnecting into the system by doing that. Right. It is murky, as you said, but seems like in some cases, there's stuff you can do now. In other cases, there's stuff that might be coming that you can do like exporting to the grid under certain conditions if some of these bills pass. Let's talk about why. What's interesting about this? How much of the value proposition for putting a battery in a home or a business that's very small, if it's say it's sub 1.2 kilowatts, does the value proposition resiliency, like are you plugging it into a load and saying this is back up for this particular appliance? Or you thinking of it as like this is savings on your electric bill or is it some combination of the two? I think what's really excited about permissionless and plug-in is that it is about affordability. That's what we saw sort of why it got adopted so quickly in Germany. It's not about resilience. That said, I do think in these early applications, and this actually gets back to what's allowed, certainly does seem to be allowed no matter what is if you just plug a battery into a wall and then a device into that battery, you're not pushing power back into the circuit at all. You're just removing loads from the grid. That doesn't seem to need an interconnection agreement or as allowed as long as that product is certified. I do think a big focus right now is on the appliance level. Given that, there's a resilience angle to it. Some of the companies out there are talking about resilience and self-reliance and that's important. You can put a battery connected to your fridge at home and it'll back that up. However, I think the big story and the really exciting one is what this really does to what we think about install and the cost and accessibility of these systems. It's going to drive them much, much lower than we've seen in the past. That means that for the first time, maybe our industry can really focus on affordability being the be all and end all in DERs and not resilience. I think over the last decade, it's been a lot of resilience because it's a premium product, but permissionless speaks to, no, these are super cheap, they're easy and it's all about cost savings. They're super cheap and easy because in part, you don't need... There's no design, there's no engineer, there's no electrician, and so it's... Presumably you get... But it is smaller, so you get less economies of scale. How much cheaper do you think it can be relative to a power wall or something like that, like a larger home battery? Yeah, so an easy rule of thumb is that soft costs are typically 50% or more of a residential install. Permissionless can effectively put that to zero because two of the big components, there are three of the big components are permitting labor and CAC. Think about a buy online motion where a consumer is just going Amazon and buying one of these and plugging them in themselves, that totally removes CAC and soft costs. Then also, based on all the regulation that's being worked on now, is the permitting side of things can go away as well. Half of the cost in a residential install you could think of as basically being gone. Obviously, there's smaller systems. You could say maybe there's marginally more expensive, just the size of the unit. Maybe there's some efficiencies, say, in a power wall or how you set up the inverter there versus an all-in-one system. But I think what matters there is that's a marginal difference and the real plummeting costs are still in the hardware side of things. So solar and storage continue to get cheaper. If that were to continue to be the case, these soft costs aren't going anywhere on traditional installs. So if you're going to remove that, it basically means that in permissionless, your floor is like all the way down to just the hardware costs. I find that incredibly exciting. The grid is changing fast. Data centers, electrification, and extreme weather are driving a surge in energy demand. Technologies can meet the moment with existing resources by activating energy customers and their distributed energy resources to create predictable and flexible capacity with Uplights integrated demand stack. Uplight coordinates energy efficiency, rates, demand response, and virtual power plant programs into one cohesive strategy to strengthen grid resilience, improve energy affordability, and make progress toward clean energy goals. Learn how Uplight is helping leading utilities harness over 8 gigawatts of flexible load at Uplight.com. Catalyst is brought to you by Antenna Group, the OGs of PR and Marketing for Climate Tech. Is your brand a leader or challenger? Are you looking to win the hearts and minds of customers, partners, or investors? Are you ramping up your new Biz pipeline? Are you looking to influence policy conversations? Antenna works with leading brands across the energy, climate, and infrastructure space to do all of this and more. If you're a startup, investor, enterprise, or innovation ecosystem that's helping drive climate's age of adoption, Antenna Group is ready to power your impact. Visit AntennaGroup.com to learn more. Yeah, that is super interesting. The limitation is scale. Unless the regulations turn out to be you can do as much of it as you want to do. Let's just say you're capped at 1.2 kilowatts per house. There's only so much saving. The point that you're making, maybe just stepping back for a second, is that, and I think people don't always appreciate this. Folks who are buying home batteries now, they're generally doing it for one of two reasons. One reason is if they're in California and you have a net meter, if you have solar and you have net metering rules that make it super uneconomic to have solar unless you can discharge it into the house or discharge it into the grid at different times a day when solar is not generating. It's economically beneficial to you to have storage in addition to solar. But the other reason outside of that specific context that you don't have solar or you're not California type net metering thing is basically entirely a resiliency value proposition because the economics, if you're just trying to save money on your bill of having a battery aren't at a residential scale or not that great yet, you don't save that much out of demand charge. But is that true with the permissionless ones? Because, yes, you get a cheaper battery, but you can only shave a tiny bit of the peak because the battery is small, right? Well, what's interesting though is that this gets into the market opportunities that it's opening up and small is relative to the load you're placing on when you say like that. 1.2 kilowatts and a kilowatt battery may be a decent amount of the load if you're a single single bedroom apartment renter. This is the balcony solar stuff, right? For them, it's extremely economical and really is that that's just opening up a TAM that no one's really, I know people do multifamily installs, but the idea of just a tenant buying one of these and having access now is totally, I think just radically new and people are still under appreciating this point. This is where looking to Germany is very interesting because this was COVID, Ukraine war stuff going on, energy prices were going through the roof in Germany, which led to a lot of the acceleration in these systems because people were putting their hands up and saying, I'm paying 40, 50 cents a kilowatt hour, I'm just going to go buy my own solar, plug it in. All that's doing is offsetting the 40 cents they would have had to pay, right? And so you don't even need complicated, you know, a veeder or even that metering, like a lot of this, again, people are thinking about this from an exporting to the grid, but there's a lot of damage these things can do to your bill in a good way behind the meter that you don't even need to be compensated that much for the exports. And that's the action that we saw in Germany. And really remarkable there is in the last four years or so, they've seen 4 million of these systems adopted. So 4 million in homes or apartments or whatever you think about it, whereas that's about the same size as the traditional single family installs, which did see a lot of growth in the last year, but those have been around for decades, right? And so I think that comparison is really remarkable, but just the idea that in a handful of years, people just started buying these systems and it's over a gigawatt now and basically installed capacity and deploying that in four years through these systems is remarkable. So I want to make sure that we're clear on that. That's basically all about that's the balcony solar stuff, right? That solar not storage. That's balcony solar. Some of those are starting to come with storage, right? Whereas what we're talking about here, you made the point, maybe it does include the balcony solar concept as well, but I think just as often it's just the battery here. Right. And so yeah, that does get into to your point on demand charges or demand response programs. But to that end, some of the work we've seen in New York City, it's about $50 per month per kilowatt shaves, which to a small business actually can mean a lot, especially if they own 10 locations or so. And if you're doing a couple kilowatts, then that can be pretty meaningful or you look at some other work like standard potential has done this with HVAC units in apartments, just sort of disintermediating the window unit that you can enroll those in demand response programs even without demand charge management. And so we in a commercial application are stacking the full value that everyone usually thinks of of like delivery charges, demand response, energy values, etc. But in commercial, you're exposed to demand charges, for example, whereas you're not in an apartment, basically. Are these typically multi hour duration systems? Are they like one hour, like does it matter? If it's 1.2 kilowatts, how many kilowatts hours is it? They're often sized like basically one to one, but that doesn't mean you're using the full 1.2 kilowatt, especially if you're plugging into an appliance, like the appliance may be 400 watts or something. So that's basically a three hour battery. But the other thing I'd say is like in Texas, for example, demand charges are volumetric. And a lot of people add batteries to their solar systems in the traditional way to avoid consumption because they're getting billed for delivery. And so if you do have solar and storage together, you can avoid delivery charges. Storage alone isn't going to do that, but there are things you can get out of storage alone, even in residential and even more so in commercial. I'm just doing rough unit economic math in my head on the New York example that you gave. And it actually sounds really good, right? Because you're saying 50 bucks a month in savings. So that's 600 bucks a year in savings to the customer. And these are, let's say it's a one kilowatt hour system, you know, install cost of a residential battery. Normal typical residential battery might be what's 800 bucks a kilowatt hour or something like that today. People think they can get it down below that, but say it was half that that'd be 400 bucks a kilowatt hour. So you're paying $400 for the thing pays itself back in less than a year, basically on just that like that rough math. That's that's actually pretty compelling. And what we've seen is in the commercial application installed costs of like less than 10% of system costs. And it's closer to zero because all those those soft costs are gone. But yeah, so I think whether it's a it's a battery, it's solar plus storage, it's it's solar alone. And these plug-in applications that it is about affordability. And if we can learn from Germany, the more that we see bills go up in the US, regardless of what the rules out there are, people are going to go on Amazon, they're going to start buying the stuff. They're going to start plugging it in. And so I think this is coming one way or another. And it's really exciting because it is like a bottoms up economically driven motion that I think we'll see. How do you solve for CAC? Because it strikes me that, I mean, one of as you said, one of the big components of the cost of a traditional system is customer acquisition costs, you don't get to spread that customer acquisition cost across as large a system. So you so the only way it feels to me to make this work is if customer acquisition costs is effectively zero. So like if there's a, yes, the customer proactively goes online and buys the thing sales motion, then that does mean customer acquisition costs is effectively zero. But you are offering a somewhat complicated value proposition with energy bill savings and all that kind of stuff. So like, how do you sell this without blowing out the cost because of the, because of that soft cost? Right. Well, this definitely right. Obviously there is, there's online digital channel CAC and stuff like that. I do think it's very different for say a third party wanting to offer this to customers and use it for as a VPP or stuff like that versus say an OEM that's just like listing it on a website that is maybe much more actively bought by the consumer. So I think more about the, the latter case where, yeah, if someone's just going and buying, you know, it's, it's just think about that compared to door knocking, right, which is still like a big, a big, it's exponentially cheaper. And so if not zero, I still think it's going to be, you know, a very small part of the overall costs for the, for the customer. You mentioned demand response participation. That was interesting because I think generally for demand response programs, correct me if I'm wrong, you need like minimum scale to participate. And so like a one, can a one kill a lot load reduction participate on its own in a demand response program? Is that an economic thing to do? Or do you need to amass a sufficient density and capacity to be able to then bid into the program? It can be both where like an aggregator needs this minimum threshold, say of like 100 kilowatts, but then at the device level, like per meter enrolled, it's a minimum of 100 watts or 10 watts or something like that. It's different based on every jurisdiction. Like what I just mentioned is more, I think Alcon Ed thinks about it in NYSO, there may be like a 10 kilowatt per meter per device rule. Other places like Massachusetts, they'll have it by actually just the device itself, you enroll directly. It's not even done through the meter. And so they all differ. But from a technical lens, you can go as small as you want, right? It's not hard to validate that these things are actually doing what we think they're doing. So really, any blocker there would just be sort of how the rules and rags are set up for a given program and all of those vary. But what we've seen is like there's plenty where, yes, things this small can participate in this stuff. I know you're doing this at businesses too, right? So it's not just a consumer thing, which and you made the point of like $50 a month savings in a business is relevant. So this is sort of small commercial also is relevant here as well. At the micro level, at the macro level, the question is, can you get because these things are small, can you get enough of them deployed that it starts to matter? Can we get to hundreds of megawatts, gigawatts of this stuff? And like what does that have to look like? Yes, 100%. And yeah, I heard you at the is the time now for DER's episode with Andy. I think recently I listened to. And you made this great point where you're like, it's all about removing friction, basically, right? And if you think about affordability and scale, it ties back to friction. How much friction is there in the buying motion, the deployment, the installs, et cetera? And again, if you look to Germany, like doing a gigawatt and a handful of years in what is a much smaller country than ours, it wouldn't shock me to see tens of gigawatts deployed in the next five to 10 years in the US, where that's actually making a meaningful dent, not just in the whole DER space, but in the sort of gap, the capacity shortfall that we're seeing with load growth in the US. And so when I think of how these things act in the aggregate, I think in the in tens of gigawatts would not shock me in the near future. Well, I mean, just as the thought exercise, it's like an interesting question, right? So everybody in DER world right now is like chasing this data center needs to come online, utility needs more capacity in order to bring the data center online. Can you construct this kind of third three party deal wherein somebody deploys a bunch of DERs in one construct or another? There are various versions of this, and it counts as sufficient aggregated capacity to accelerate the interconnect, right? Like that's the everybody's chasing some version of that thing. To do that here, right? Like the scale minimum scale from a data center perspective is probably 100 megawatts or something like that. So you would have to deploy that at 100,000 premises, right? To get enough capacity or probably more because you're not going to get full ELCC credit or whatever. So hundreds of thousands, which sounds crazy. But at the same time, I don't know, if you're in New York and you can do it in every unit and apartment building or something like that, it starts that up. So it's interesting to think about. Yeah. And I mean, I think that example is interesting. My hope would be also the data centers building a lot of onsite capacity as well. And it's not fully burdened by say residential systems. But yeah, you just think about a lot of the big grids out there. We're talking 30 to 70, 80, 90 gigawatt peaks, maybe more if you're in PJM. And either way, you're getting into like double digit percentages of capacity, potential from these resources off of what the current peaks that we're seeing is not like it's just to say, it's not some afterthought where it's like 0.001% of the total peak load on that grid. I think we could see like 10% or more, which is wild to think about in these small systems. The other thing I would say is like in the commercial application, we see paths to do power wall size or multiple power walls, right? And so when you just narrow this to apartments and these smaller residential applications, it's a little narrowing compared to what plug-in can do in general. Like you could see 51020 kW systems just deployed through outlets to some degree. And again, like a lot of that is based on regulations, etc. But I don't think the story of them is only like these hyper-hyper-small in apartment applications. From a product perspective, are these just like pretty commoditized? Like it's just a small battery. Is there much to it? Is there any magic? Are there improvements that could or should be made apart from just like driving down cell costs? 100%. I think we're just seeing the early beginnings of form factors. I think there's going to be a lot of innovation in form factors around batteries. You can think of that as a battery in a cooktop, or you can think of that as the battery, how it actually is designed for a plug-in application, which is actually extremely nascent as well. Actually, a lot of the early plug-in stuff was using what is normally for like camping setups for consumer application, because that was what was available as like a fully mobile plug-based battery. You look at some of the work happening now, it gets into like 120-volt outlets versus 240-volt. What is the right actual like shape of these? Are you trying to place them on a fridge? Are you hanging them on a wall? Are you talking them in a corner? How big should that battery be for a home or a business? Also, just the idea of it being an infrastructure grade asset. I think one of the interesting things, for example, Pila, which I'm sure you know about is focused on, is like, we're not going to build some camping battery that doesn't have the greatest API reliability. We're going to build these things to be networked at scale, where you may be running hundreds of megawatts or gigawatt size VPP with just all these little plug-in batteries everywhere. Pretty much aside from the camping battery stuff, a lot of the companies I've mentioned have all been started in the last five years. I think it's incredibly nascent from a product standpoint, and there's already some early interesting form factors being developed, but I think the list of things that could happen is endless. I think there's even a company doing like a battery and a heat pump or something. I think it's the biggest. That's right. That's right. Yeah, it is. So yeah, I just think there's going to be a lot of innovation in form factors over time, and what we're seeing is already pretty interesting. Yeah. All right. Well, those all the time we had now, it's super interesting to watch how this is going to play out. I think it's an underappreciated category, at least in the US. You've made repeatedly the point that it is well appreciated in Germany, but appreciate your time. Thanks for helping me walk through it. Thank you, Shell. James McGinnis is the founder and CEO of David Energy. This shows a production of latitude media. You can head over to latitudemedia.com for links to today's topics. Latitude is supported by Prelude Ventures. This episode was produced by Max Savage Levinson, mixing and theme song by Sean Marklond. Stephen Lacey is our executive editor. I'm Shale Khan, and this is Catalyst.",
    "release_date": "2026-01-29",
    "duration_ms": 2151000,
    "url": "https://traffic.megaphone.fm/PSMI3430027549.mp3?updated=1769636493",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2026-01-30T02:11:21.426654"
  },
  {
    "title": "More 2026 trends: Solar costs, oil oversupply, and the startup slump",
    "description": "We are back for Part 2 of Shayle’s double header conversation with the veteran energy analyst Nat Bullard, dissecting his annual presentation on the state of decarbonization.\n\nIf you missed it, we recommend you go back and listen to Part 1, which was released last week.\n\nIn this episode, Shayle and Nat shift their focus from data centers to exploring other intriguing trends found in the data that Nat assembled—from the surprising resilience of clean energy stocks to the rising costs of solar installations in the US.\n\nShayle and Nat dig into more topics including:\n\n\n  \nWhy the S&amp;P Global Clean Energy Transition Index outperformed the S&amp;P 500 and Nasdaq last year\n\n\n\n  \nThe steep drop in U.S. energy startup investment—from $8 billion in 2022 to just over $2 billion in 2025—and why Shayle thinks 2026 will see a massive rebound\n\n\n\n  \nThe impacts of an enormous oversupply of oil\n\n\n\n  \nChina’s skyrocketing share of global vehicle production\n\n\n\n  \nThe remarkable pace of residential battery storage adoption in Australia\n\n\n\nResources\n\n\n\n\n\n  \nNat Bullard’s full 2026 presentation\n\n\n\n  \nCatalyst: 2026 trends: Gas turbines, Texas’ load queue, and China electrifies\n\n\n\n  \nCatalyst: 2025 trends: aerosols, oil demand, and carbon removal\n\n\n\n  \nCatalyst: More 2025 trends: DeepSeek, plug-in hybrids, and curtailment\n\n\n\n  \nLatitude: The year resiliency investment began to go mainstream  Credits: Hosted by Shayle Kann. Produced and edited by Max Savage Levenson. Original music and engineering by Sean Marquand. Stephen Lacey is our executive editor.\n\n\n\n\nCatalyst is brought to you by Uplight. Uplight activates energy customers and their connected devices to generate, shift, and save energy—improving grid resilience and energy affordability while accelerating decarbonization. Learn how Uplight is helping utilities unlock flexible load at scale at uplight.com. \n\nCatalyst is brought to you by Antenna Group, the public relations and strategic marketing agency of choice for climate, energy, and infrastructure leaders. If you're a startup, investor, or global corporation that's looking to tell your climate story, demonstrate your impact, or accelerate your growth, Antenna Group's team of industry insiders is ready to help. Learn more at antennagroup.com.",
    "summary": "US energy startups were about 7% of all US startup investment, and probably about 2.5% last year. Everything is energy, man. Turbine is energy. Everything is energy. Yeah, right. Right. Right?",
    "transcript": " Latitude media covering the new frontiers of the energy transition. I'm Chio Kahn and this is Catalyst. Oil is extremely oversupplied. The IEA estimate for the beginning of the year is about 5 million barrels per day of supply and excess of demand. That is a lot. Coming up, part two with Nat Böhler. What if utilities can meet surging electricity demand with energy assets already in homes and businesses? Uplight is making this possible by turning customers and their smart energy devices into predictable grid capacity through an integrated demand stack. Uplight's AI driven platform activates smart thermostats, batteries, EVs and customers to generate, shift and save energy when the grid needs it most. Learn how Uplight is helping utilities unlock flexible load at scale, reduce costs and accelerate decarbonization at Uplight.com. Catalyst is brought to you by Antenna Group, the communications and marketing partner for mission driven organizations developing and adopting climate energy and infrastructure solutions. Their team of experts helps businesses like yours identify, refine and amplify your authentic climate story. With over three decades of experience as a growth partner to the most consequential brands in the industry, their team is ready to make an impact on day one. Get started today at AntennaGroup.com. I'm Shale Khan. I lead the early stage venture strategy and energy impact partners. Welcome. All right, it's part two. If you don't know what I'm talking about, go back and listen to last week's episode. This is part two of my conversation with Nat Böhler running through all sorts of interesting data on the state of energy and decarbonization in the world. Here we go. All right, let's get off the data center thing for a minute or actually maybe it's impossible to get off the data center thing entirely. Let's move a step away so that it's a second order effect. I want to go to slide 54, which is a good narrative violation, I think, and a reminder that sentiment in different markets behaves differently and is not always what you'd expect. This is looking at public market performance of clean energy stocks, which have done well. I mean, as we know, as long-term listeners know, and many of them have the battle scars to prove clean energy equities can be volatile and they can have great years. They can go on a tilt for three or four years. They can then correct massively, but then they can start coming back up again. All of these things, of course, depend on your interval. They depend on what time period you're looking at it, but this specifically is fenced off to the calendar year 2025. Then calendar year 2025, the S&P Global Clean Energy Transition Index was up 40 percent, rebased value of 100 at the start of the year, tips out at 140 at the end. More than the S&P and the NASDAQ 100, which are both up about 20 percent over that same period of time, nothing to sneeze at, of course. Both of those indices being up 20 percent is pretty good. But it's just a show that there's activities still ongoing in these markets, regardless of what specifically you might hear in political rhetoric and be that, again, there's a global nature to this. There are companies all over the world that built stuff and they're public and their performance gets tracked in the form of an index that went up more than the other things went up last year. Yeah. Also, all this other stuff we've been talking about is generally positive for a lot. It is an index. There are companies that do well, companies do poorly. But broadly speaking, the broad trends of the market are very supportive of clean energy at the moment. That's right. For those who don't just listen to the dulcet tones of me and Shale here talking, but go back and see the deck, it's essentially full of the same sort of stuff. Regardless of rhetoric, here's the actual play out in data. You can see it in all different kinds of ways. It's not as grim as people would have you believe. It's also not as rah-ra, as some other people would have you believe either. Other side of the coin, though, of course, the public market performance has been good. Let's admit it has gotten a little rougher in startup land. Let's go to slide 62, where you have data on the share of a US startup investment that went into energy startups over the years. It's a very distinct curve that I think people would generally predict. Do you remember one of my sub-themes last year? Because I watch out like three sub-themes of the deck. One of them was it's a 2021 thing. He complained to me that it was unfair or a snide use of my look into the data. Well, the reason I said that is that there's a whole bunch of things that hit their peaks in 2021 or 2022, and have yet to return to that. First among them, though, newly seen in the data here for this year, was investment in US energy startups, which this is carded data, went just over $8 billion in 2022. Barely tipped past $2 billion in 2025 last year. It's a share of total startup investment at 2022. US energy startups were about 7% of all US startup investment, and probably about 2.5% last year. Again, these things go in waves. What I'm interested to see is where we start going from here. This was what I was going to bring up. Let's make a bet on this one. I think this is going to be a fun bet. You give me a number. You give me a number. I'll do an over-under. Okay. My number, so it was two last year. I'm going to call it above three this year. A billion dollars invested in US energy startups. I go hard over. Okay. This is what I want to hear. Tell me Mr. Investor. Everything is energy, man. Everybody woke up to it, right? Like data centers are measured. Everything is turbine. Everything is turbine. Everything is turbine. Turbine is energy. It's a transitive property. Everything is energy. No. But just the elevation of energy, the importance of energy in all these conversations around sovereignty, around AI, around all this kind of stuff is more than ever. I see this. The interests in energy startups that have anything to do to solve this confusing and difficult set of problems, the interest is higher than ever and from a more diverse group of folks. I think we're going to see this is going to be a return to a boom. This is my prediction right now where we were at 2 billion last year down from 8 billion in 2022. I don't know that we get back to 8, but will it triple this year? Maybe. I think so. One thing that's going to be really interesting is to see, and I say this in the most sincere way, what counts as an energy company in this context over time? This is going to be really fascinating to watch play out and you will see it firsthand. I'm certainly not an energy company. There will be plenty of companies that will be coming forth having discovered their energy application or pivoting towards it. This is not a bad thing. It's probably a good thing. But yeah, you're going to see a lot of reinvention. Is Boom, Supersonic, an energy company? Precisely my question. Is anybody capable of providing motive now stationary power in energy company? Yes, I think. Yes, I think too. We'll find a lot what part of software accounts is an energy company. All kinds of stuff will come back in and that's a good thing. That's a very good thing. All right, let's get into it. By the way, Bet made, we'll come back to it in a year. Let's get into a bunch of other stuff. Let's talk about oil for a second. Slide 167, I'm jumping way further in the deck. I guess I had not fully appreciated this. Oil is super oversupplied. Yeah, right. Oil is extremely oversupplied. The IEA estimate for the beginning of the year is about 5 million barrels per day of supply in excess of demand. That is a lot. That's also about 5% oversupply based on the current demand of around 100 million barrels per day. In markets that balance on the margin, shall we say, right? So that has a significant damper on prices. And it's one of the reasons that oil prices are where they are right now. It's one of the reasons that there's, shall we say, less than robust enthusiasm for reengaging with ultra-heavy sour crude supplies that need $100 billion worth of infrastructure investment before they can literally start flowing again. It's the reason that we don't have a massive impact on fuel prices right now around the world from cost of oil. And yeah, this is the reality in which we live. We have moral demand than ever, and the market is comfortably oversupplied right now. It also drives home up a point that I don't want to make directly about the Trump administration's strategy in Venezuela with regard to getting, for some reason, even more oil out of the ground. Right. Difficult to access oil that is in theoretically low cost, right? But it requires a whole bunch of upfront investment to get it back to par where it used to be a couple of decades ago. But yeah, the market is not screaming for new barrels. Let's put it that way. The grid is changing fast. Data centers, electrification, and extreme weather are driving a surge in energy demand. Utilities can meet the moment with existing resources by activating energy customers and their distributed energy resources to create predictable and flexible capacity with Uplights Integrated Demand Stack. Uplight coordinates energy efficiency, rates, demand response, and virtual power plant programs into one cohesive strategy to strengthen grid resilience, improve energy affordability, and make progress toward clean energy goals. Learn how Uplight is helping leading utilities harness over eight gigawatts of flexible load at Uplight.com. Catalyst is brought to you by Antenna Group, the OGs of PR and Marketing for Climate Tech. Is your brand a leader or challenger? Are you looking to win the hearts and minds of customers, partners, or investors? Are you ramping up your new BizPipe line? Are you looking to influence policy conversations? Antenna works with leading brands across the energy, climate, and infrastructure space to do all of this and more. If you're a startup, investor, enterprise, or innovation ecosystem that's helping drive climate's age of adoption, Antenna Group is ready to power your impact. Visit AntennaGroup.com to learn more. All right, on from oil, let's talk solar. This one's just a soapbox that I get on about solar periodically, just because I look to remind everybody of this point that the world forgets over and over and over again, which is that solar module prices are not solar system prices. And in fact, as happened in recent history, as you point out in the slide, they can go in opposite directions. So this is slide 83. And basically, solar modules are getting cheaper and cheaper and cheaper, they're cheaper than ever. And yet the cost to install solar is higher than not higher than ever, certainly, but has gone up during that same period. And shale as former solar analysts, I'm just aggrieved by the data here to see that modules cost so little relative to the numbers that you and I used to agonize over 15 years ago, yet the price of a system is going up. Okay, residential system prices in the US went down by 3%. Gee, congrats here at the $3.35 a watt, which is an amazingly high. Yeah, congratulations. It's costing thrice, what it costs in Australia or Germany, neither of which are particularly low cost markets for anything. But commercial prices up 9%, utility fixed and tracking prices up 9% to 10%. This is not great. And it's the things that are not the module. In this case, if everything is turbine, nothing is module. Okay, so basically the things that are driving the costs up, engineering, planning and permission, labor, cost of equipment, thanks to tariffs, like all of these things that are outside the remit, completely of your friendly, local module manufacturer. It's just unfortunate. It's not the way that you would want to provide a lot of low cost, a quick moving, new electricity supply in the US to have prices be going up. But as you can see from this, most of the forces that are driving it up are outside the control of a developer. You can be the best developer in the world, but you do not control the landed price of your equipment if tariffs are put on it. Okay, I'm from solar to batteries and specifically batteries down under slide 107, residential storage in Australia. As I mentioned, solar in Australia is really cheap. It is increasingly valuable to add storage as well. Here's an insane number that I had not fully appreciated. The pace of adoption of residential batteries in Australia. Over the course of the past, what is it, five months or July through November 2025, Australia was installing 40,000 residential storage systems per month. But just to contextualize, if they maintain that pace for a year, which seems entirely possible that they will or even increase it, maybe 5% of households in Australia would add residential batteries in a single year. Well, already the double digit percentages of households have solar. These systems and this thanks to a new government plan that opened up only in July are basically integrating with people who already have solar. And so they're like an add on to the solar that you already have to take advantage of the fact that they have insane duck curve action in pretty much every one of the major grid areas, at least certainly in the country's southeast. And yeah, they're priced to move and people are like, well, yeah, I would like to just may off a bit more of my demand curve that I'm already satisfying a lot of with solar. So why not? Australia is not like not a particularly big market. It's like a few and 25 million people. And this movement so quick is pretty extraordinary. Australia, man, some about distributed energy in Australia really figured it out. Okay. Slide 97 is a check in just a check in on a thing we've talked about before. I'm going to title this one. We haven't fixed transformers yet. This is data on the price of transformers, which is still high. Yes. I gave it the title transformers same as meets the eye, which I hope people of my vintage will get as a really kind of lame joke. But yes, haven't moved, right? If anything, they're still ticking slightly upward. And as much as there's energy and attention and noise being paid to, we need to build stuff here. We're not tariffs do not help this uncertainty in future trajectories for demand do not help this either. And so yeah, we had yet to solve this problem. I am hopeful that there are companies that will come in and begin to solve this. But it's very much part and parcel with the gas turbine manufacturing motion, which is I don't want to build a bunch of inflexible manufacturing capability if demand is fungible in the future. Like, if I don't have a great idea of what actual demand is going to be, then I'm less inclined to go build the supply. Yeah, though I think there's less of an excuse gas turbine manufacturing is even more capital intensive. It's currently more of an oligopoly than transformers are like there are companies that are going to come solve this transformer problem. Mark my words, but the point the data makes in the slide is that nobody's done it yet. Nobody's done it yet. And for all the night, there's not a lot of heat, right? And so let's hope that that turns around. Okay, on to something entirely different. China makes cars. It turns out slide one 18. The actual stat here is just a crazy thing that now 40% of the world's vehicles are made by Chinese companies in China. For the first three quarters of last year, about 42% of all passenger vehicle manufacturing is in China last year. That's higher than the ratio for Japan ever was back in its heyday. Needless to say, it's a pretty extraordinary footprint in a multi trillion dollar global industry that is also a capstone or keystone industry for a lot of different countries. And Chinese auto mobility is sort of eating the entire industry. It's a really extraordinary degree. I have really front row seats on this living in Southeast Asia. But watching in my hometown in Singapore where BYD had 0.1% market share in December 2021 and is now by far the biggest auto seller in the country in four years. Watching EVs work their way through Southeast Asia, through South America, Chinese made EVs, I should be very clear, is really a thing. And also remember that China exports millions of internal combustion engine vehicles as well. Like EVs are the ones that we think about in the US and Europe because that's what you're likely to see. But there's plenty of low cost and fairly high quality internal combustion engine vehicles that are getting exported as well. So it's like, I can talk about this stuff forever because I find this to be a very fascinating market with a lot of nth order effects that I think people are struggling to deal with. And I'll leave you with only one in the interest of time, which is what's going to be the market as today's new car ASPs go up and up and up. What's going to be the market for those used cars in developing markets versus a brand new Chinese made car? So very roughly speaking, what's the market for my $15,000 Corolla that might be acquired in Mexico or Brazil versus a $10,000 brand new Chinese made car? And we haven't played this out very well yet at all. That's a good question. Okay, so then the next two slides that I want to talk about, slide 121 and 122 are an addendum to this, which is China does just make passenger vehicles. They make and they deploy or they buy mid and heavy duty electric vehicles. No surprise to anybody here that that is happening. I think the pace at which it is happening is not well appreciated, especially because we're sitting here in the US and like the electric vehicle electrification thing is sort of it's happening still, but it's a little out of oak for various reasons. And particularly in mid and heavy duty, it feels like that timeline has been pushed out, not so in China. So China had 3,000 electric medium and heavy duty truck sales in 2020 and had 81,500 in the first half of last year. That's a lot. Remember that these markets are like electric meteors or medium duty trucks, the pretty big market. Heavy duty is a smaller market relative to cars, but that's an awful lot. That's a really quick ramp rate of like 75,000 cars in the half year versus the previous low in 2020. There's a lot of room to go here. And to your point, this narrative is a little off the boil for many different reasons here in the US and possibly in parts of Europe, but not so in China. A lot of it is thanks to the infrastructure to support the deployment of those kinds of trucks. That's definitely different than in the US or maybe in Europe where you have all sorts of kind of cold start problems around infrastructure that he built to then go out and do the trucks. The infrastructure is less of an issue. And so it's going very, very rapidly. And we'll see. This is also part of your getting your final energy from electricity case that we started the conversation with is going after those things that are kind of within our hard to abate areas from years past. Yeah, I mean, fully a third of all new medium duty vehicles in China are electric now. Right. That's a lot. And if you think about this, only 10% of the heavy trucking is electric by sales now. But where's that going to land? If these things are anything like cars, electric car sales as a share in China is well north of 50% at this point, are these going to go? There's our question to ourselves. Is this going to go faster? Right? Is it going to top out lower or top out higher than those shares? There's a lot to play for and a lot to fight for. Okay. Very last slide. We're going to land the plane on a thing we've already talked about a bunch. But I just you put in two quotes. I like these quotes. I think they're reflective of the moment. Read me the quotes. Sure. So the first of them is from December of 2024, I'll go in chronological order. That's some of Virginia focused energy economists intervening in a discussion about integrating very large data center modes. Not quite in the historic data center alley, but just outside of it. And this energy economist is sitting here right now. I think our forecast of data center mode for say 2032 is probably off by a factor of two. I just don't know which way. Two times too high or two times too low. And the corollary to that is from the head of Instagram in February of last year who said we may need drastically more or drastically less capacity than we thought to build frontier models. And I like them both because I think these are both people who know quite a bit about what they're talking about and are neither being snarky nor immodest or having false modesty for that matter in terms of their view of the future. They just happen to seeing a great deal of potential uncertainty. Not quite order of magnitude, but definitely scaler here. One X two X whatever uncertainty in terms of what might actually happen. And for good reason. Yep. So we'll close it out with the slide title used repeatedly, which applies to this equally well. Nobody knows anything. Nobody knows anything. But there's a lot we should be trying to learn every day. There's a lot we can do to get smart. There's a lot of good information out there. And as ever, I have a lot of fun playing around a bit and trying to do my best to capture a small slice of it that might be useful. So. Well, it makes for great pods. So thank you as always, Matt. Hey, it's my pleasure. You know, I can't, to be honest, I can't think of doing a launch for this any other way, right? It is the only way I like to do this launch. So thanks again for having me. Not Bullard is a longtime climate tech analyst and writer. He's also the co-founder of Halcyon, which is an AI assisted research and information platform. This whole conversation was based on a 200 slide deck that is chock full of other interesting information. You should go read the whole thing. It's at Nathaniel Bullard dot com. This shows a production of latitude media. You can head over to latitudemedia.com for links to today's topics. Latitude is supported by Prelude Ventures. This episode was produced by Max Savage Levinson, mixing a theme song by Sean Marquand, Steven Lacey is our executive editor. I'm Shale Khan, and this is Catalyst.",
    "release_date": "2026-01-22",
    "duration_ms": 1539000,
    "url": "https://traffic.megaphone.fm/PSMI8330396132.mp3?updated=1769043334",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2026-01-30T02:14:03.256120"
  },
  {
    "title": "A ‘rain delay’ for the energy transition [partner content]",
    "description": "In 2024, Tom Burton described the clean energy transition as entering its “third inning” — a phase defined by execution and scale. A year later, the game looks very different.\n\nIn this episode, produced in partnership with Mintz, Stephen Lacey sits down with Burton to revisit that framework and assess the state of play for U.S. energy infrastructure heading into 2026. \n\nBurton, who chairs Mintz’s sustainable energy and infrastructure practice, brings nearly 3 decades of experience advising developers, investors, and operators across clean energy and digital infrastructure.\n\nThey begin with the immediate market picture: a surge of renewable projects racing to put steel in the ground under existing tax rules, followed by a thinning pipeline. Burton explains why 2027 and 2028 could mark a slowdown in new deployments, even as demand continues to rise.\n\nFrom there, the conversation turns to politics. Federal hostility toward clean energy, shifting tax credit structures, foreign sourcing rules, and the weaponization of permitting have introduced new layers of risk. Deals are harder to close, financing is more complex, and even strong projects are feeling the strain.\n\nBurton unpacks what this environment means for developers, including who’s most exposed to the current shakeout, what separates resilient companies from struggling ones, and why permitting uncertainty may now be a bigger threat than tax policy itself.\n\nThe episode also explores one of the defining forces reshaping the energy sector: the rapid expansion of digital infrastructure. Burton explains how power availability, interconnection, and long-term grid planning are now central to dealmaking.\n\nThe energy transition hasn’t stopped, says Burton. But it has entered a rain delay — and the companies that adapt during the pause will be the ones still standing when play resumes.\n\nThese conversations were recorded at the Mintz Energy Transition Summit. Mintz has been at the frontlines of the energy and sustainability revolution since the start. For finance, policy, and market insights from the Mintz team, sign up for their newsletter.",
    "summary": "2025 tossed the energy world a series of unexpected curveballs. And what we're seeing now is, again, digital infrastructure and energy infrastructure are becoming really connected. Overall, though, when it comes to clean energy, certainly this year, the last three years really have been declining. Not just renewables or clean energy side. Tom Burton is the chair of the Sustainable Energy and Infrastructure Practice at the Law Firm Mintz.",
    "transcript": " This is partner content from Latitude Studios. 2025 tossed the energy world a series of unexpected curveballs. Low growth surged, policy shifted, deals got harder, and in moments like this, it's worth turning to someone who spent decades studying the rulebook. That someone is Tom Burton. He leads the sustainable energy and infrastructure practice at the law firm Mintz. It's been quite a chaotic year to say the least, although there's no guarantee that 26 will be any more challenging than 25. So you and I talked about a year ago, last fall, we talked about where we are in the energy transition, and you said we're entering the third inning of this transition, and you divine that stage as this period of scale and execution. What inning does it feel like right now? Well, to be honest with you, Steve, I think I'd say that we're at a rain delay. For now, the U.S. market is still delivering. Renewables are racing to the finish line under the current tax rules, and we'll see a wave of projects come online over the next year. But beyond 2026, the pipeline thins out. And so it really will be in the out years, 27 and 28, where we're going to see substantially less renewables coming online. So there's definitely going to be a slowdown. Not that long ago, the industry was enjoying a streak of clean innings. Strong economics, broad support, and momentum that seemed hard to disrupt. But in 2025, everything got messier. The clean energy sector or the energy transition sector was pitching a no-hitter for a little bit. They've gotten knocked around by the batters on the political spectrum, and now the game is getting tighter. Politics have created tension everywhere. Deals are harder and more expensive. Funding is tightened, and every project carries more risk than it used to. Tom sees it in every corner of the market. So much more creative, finniest, and much more. How do you deal with a challenging environment from the client's customers? How do you deal with reductions in valuation, disappointments in terms of losing grants, for example? Things like that. And that pressure shows up in Mintz's practice as clean energy companies navigate more roadblocks, more questions, more complications. There's been more disputes that have come up, and there's been a lot more challenge. You know, in that regard. So the smooth sailing that we experienced in the prior years, and the onward and upward seemingly to the moon, has been called into question. I'm Stephen Lacey, and in this episode, produced in partnership with Mintz, we're trying to read the field as we head into the new year. Tom Burton and I explore the forces reshaping the market, where energy meets digital infrastructure, how development strategies are shifting, and the question hanging over every company right now. How do you stay prepared when the game shifts around you? We're in a bit of a rain delay, and we maybe need to change pictures to implement new policy, et cetera, in order to keep that momentum going. I love that metaphor. I'm going to continue that metaphor. So if we've got two storylines here, let's call them two teams clashing. That is team load growth, and then team federal government that is increasingly hostile toward clean energy. So you have these two clashing teams. How do you make sense of those competing dynamics, where clearly load growth and the expansion of digital infrastructure is a tailwind for the energy sector and for clean energy potentially. And then you have this headwind of weaponization of regulations from the federal government. How are those two interplaying? I think it's really hard to reconcile, to be 100% honest with you. It doesn't make sense that you would knock back $32 billion of incentives that were intended to create domestic manufacturing, unshoring, as well as monetization, the grid, et cetera, the things that would help meet the demand growth. It's to me a very political environment. What I think ultimately will happen is that there will be a recognition at the government level that we are in and all of the above world in order to meet demand. We will need to bring out all of our own stars. And the political environment will probably not reflect that publicly, but ultimately we will see continued growth and development of renewables in order to meet some of these needs. We saw a bit of a pullback during the first Trump administration. So I'm not surprised by some of the pullback, and maybe it is ultimately a healthy thing to separate the wheat from the chaff. Maybe the highest quality companies come out of this in the same way that the Google's of the world came out of the Internet darkness, if that makes some sense. So I'm hopeful that what we'll see is a recognition that renewables and storage play a very important role to meeting grid demand and grid needs. We may not see that in the news, but we'll actually see it happen in reality. Over the course of the next few years, albeit at a solar pace than what we were experiencing in the last three or four years, which were frankly really an anomaly in the last 20. Yeah, well, let's talk about what will potentially separate the strong from the weaker companies. We, of course, have seen already a shake up in the developer world in renewables and batteries in the wake of the one big beautiful bill. We saw alterations to the tax credit schedules, new foreign sourcing rules. What kind of developers have been most negatively impacted? Do you see more of a shake out coming and what characterizes the stronger companies that will come out of the other side of this? Yeah, so I do think that there will be a shake out. There'll be consolidation for sure. What we've seen is that the companies that are the most well capitalized, the ones that have been added longer, who can pivot more rapidly, are able to absorb these changes in rules. Those who are latest to the game, who may be not be as capitalized or whose projects are the earliest along, or the ones that are going to suffer the most, unfortunately. But there'll be then, I think, a new crop of developers, so to speak, or companies that will be deploying renewables. And that new crop is going to figure out how to model projects that will work without tax credits, or will work with less tax credits. At least that's my hope. The fiat rules, which are not final yet, throw a curveball and all that to some degree because if the lowest cost components are coming from places like China, it's tough to work around the tax credit loss while not having access to the lower cost components. Because that's where I think there's a fair amount of uncertainty that's going to have to be sorted out. Well, one of the big stories, hopefully, that will materialize this year. And we were hoping for last year before the election was permitting reform. And so, these companies across the energy spectrum, they just need to see a streamlined permitting to make it easier to build things. Of course, we've just seen a lot of local pushback. We saw stalled permitting reform. We've seen some weaponization of the permitting process under the current administration. And in general, I think that there's just a desire across the political spectrum to make permitting easier. How is all this impacting the permitting story right now? Yeah, that's another great question because you can think about permitting for the perspective of environmental permitting. You've got energy transmission, for example, in their rulemaking. There's a variety of regulatory elements, but federal, right? And then you've got state and local. So the permitting morass is a real challenge. There is a bipartisan support to do something to streamline these processes. And at least in Massachusetts, for example, we passed a permitting reform law in the last year that really cut down the time in which renal energy projects could be permitted. Pretty substantially, deadlines within a year, 15 months, automatic approvals if deadlines are missed, things like that. Appeals going straight to the Supreme Court or state Supreme Court as opposed to working the way through the court systems. So the intention is to really compress that timeframe while also honoring what are often fair protests or fair objections. But it's only near one. So I can't say yes, it worked. We're hopeful that it is working and maybe it can be a template for how to think about it from the federal perspective. But no doubt, we need to see it happen. And we need to see it applied uniformly across the board. So allowing for fossil fuels or baseload to jump the line, for example, it's disingenuous. But to have these, if you've had a shovel ready project and it's ready to go, and that's your obstruction, let's find a way to get through it quickly. What I do see is these rollbacks. I'm looking out at the window in my office, right? And I see blue sky. My parents, when they were young, did not see blue sky. They saw gray skies. If you were in Los Angeles, it was all smog. The reason why we have this guys in clean water today is because of the actions taken 50 some odd years ago, 60 years ago, to ensure that we would have that today. And it took a long time to ultimately get to that place. And so rapid rollbacks without consideration for their impacts on people's health, really, will have serious oppositional impacts on future generations. And so we can't take for granted what we have. And we have to recognize that we have it because we were intentional about having it. And we need to make sure that we keep that intention for the future. Absolutely. We're just permitting stack up with the puzzle pieces of project development in terms of importance. When you think about tax credits or foreign sourcing rules or some of these other big ticket items, how much anxiety does it produce in developers? I think it produces a lot of anxiety, particularly if you have uncertainty, right? In the sense of what we've seen in the wind targeting of the weaponization of permitting in the wind industry, right? Where you've seen in the had approvals and now you don't. So I do think that permitting probably is as important if that more important than tax credits and in other incentives. The incentives you can model without you in width, right? So you can at least figure out what the answer is when you don't have certainty around permitting, you don't have a project, right? So it really doesn't even let you get out of the gate. So let's talk about the other big story of the year. And that is the rise of data center infrastructure. You have an expanding digital infrastructure practice. And what we're seeing now is, again, digital infrastructure and energy infrastructure are becoming really connected. And the traditional data center model has been very much a real estate business and is now more of an energy infrastructure business. How are you seeing that play out and how is it shifting the way deals are getting structured? Well, that is exactly. I mean, you nailed it on the head. We have had a team in our real estate group that's been doing data center real estate work for over 20 years, maybe 25 years at this point. And just recently in the last two or three years, they've been calling upon our project finance and development team to assist on the power side. So the power side has become very, very important. And in fact, so important, it's almost the tail that wags the dog. If you can't have access to power, you don't have interconnect or you don't have your own backup power or your own DG site, then you can't do the data center. There's plenty of space that appear to be plenty of chips, but there isn't enough power. So our team is increasingly called upon to be helpful in instructuring those arrangements for our data center clients. And so do you think that this digital infrastructure sector is complementary to the energy business or is the energy business competing for resources? I think it's complementary, to be honest. There is an enormous amount of capital sitting in private equity funds and pensions and otherwise that can be deployed for these kinds of infrastructure projects. The competition comes down to really where the rate payer sits, the individual homeowner. We've seen this in places like Ireland where there's a moratorium on data centers. Energy prices have gone up so much. Rate payers have been forced to bear those extra costs and people are revolting. And so we hopefully, if we can get enough generation online and we can do it at the right pricing, and this is really unclear, we wouldn't have that same thing happen in the United States. But I suspect that there will come a day when the average homeowner is going to look at their bill and say, wait a minute, I can't afford this. Many will argue that it's not so much a generation problem as much as it's an infrastructure problem. So it's a transmission problem, a distribution problem. And if you look at, certainly in this region, how electricity costs have increased for us and actually our gas costs as well, it has been largely on the transmission and distribution side. So not so much on the generation side. So it feels like there's enough power out there being generated. We've got to find a way to deliver it much more effectively and with better technology. So there's a lot of capital pouring into both of these sectors right now. How is it changing the way projects are being financed? We talked last year about this missing middle, the capital stack that can get companies from first of a kind projects to end of a kind projects. Are you seeing the capital stack itself changing and fitting into that crucial missing middle? Yeah, I've certainly seen in the last couple of years, in the Slizer's no exception, more of those growth equity or gap filling investors come into the marketplace and make bets and investments. Overall, though, when it comes to clean energy, certainly this year, the last three years really have been declining. Overall, dollars have declined each year and this year is no exception. And it will probably be a similar thing next year as well. However, if those businesses that build the first project, you build a second, they're going to then flip to a need on the infrastructure side. So the infrastructure funds at that point will be comfortable that risk has been rung out and that scale is really all that's left for some of these businesses, particularly when you talk about storage, for example, which I think there's a real need for. There's plenty of capital available there. So my perspective on it is that those who were able to find capital in that gap in the last year or two stand a really good chance of making it through on a future basis. There's a lot of concern that U.S. companies, because of the current policy uncertainty, are going to start moving overseas. They might have partnerships in China, they might move to Europe, Australia, the U.K., there's a lot of courting of American companies. Do you see that happening among your clients or other companies that you're talking to? And are you concerned that once again, America will innovate technologies but not fully commercialize them? Yeah, no. I think this whole risk of innovating, not commercialize, is very real and it cuts across a variety of industries. Not just renewables or clean energy side. I think it's going to be a real issue potential for life sciences and the medical field, healthcare. It's something we've got to figure out how to produce at scale inexpensively without a doubt. What we're seeing on our side is foreign businesses that were investing in the U.S. buying projects, buying companies, operating companies, and establishing a U.S. presence are putting those on hold and they're pulling out. So similar to the Canadian tourism in Boston dropped substantially this last summer, folks are staying home, so to speak. So I think that's having a real impact here. Will U.S. companies move overseas or leave the U.S.? I don't know if they would leave at any greater rate than they have been, if that makes sense. Certainly, if we don't have reasonably priced inputs on the supply side, whether it be energy or components or what have you, there is incentive for businesses to leave. This is something we have seen in places like Europe that is a risk for us if our costs continue to rise dramatically. So we do have to come up with answers to meet this demand because there is risk that will happen, may not happen this year or next year, but it will happen in the out years. You have been focused on this industry for a few decades now. Have you ever seen a moment like this where we have so many competing pressures and opportunities in the system? Great question. Absolutely not. I've not seen anything like this before. And it could go in a variety of different directions. The pessimist in me says that we have a government which is trying to change the culture of America around energy. This whole idea of internalizing costs, understanding that emissions do have impacts and pricing for those is not a thing anymore. It's really all about just making the dollar externalize as many costs as possible and future health impacts can be whatever they are. The optimist in me says there couldn't be more opportunity available now than in the last 40 years. With this increasing demand, it's going to create a ton of opportunity for businesses that solve the grid optimization problem that create software and again AI. So this data center and AI growth can actually contribute to improving delivery on the grid. So we could see some really interesting businesses come out of that to solve those problems. We'll finally see hopefully deployment of geothermal in the US. We really haven't had a macro level deployment of geothermal. So certain areas and types of power may ultimately now see the light of day. So it's a time of never been greater opportunity and a time of never been greater challenge. This is a transition that's going to take generations and we are very lucky to have a ringside seat for it. Do your clients, the companies you work with, do they retain that same sense of optimism? Depends on the client. I think some do for sure. I can think of a few that are, their technology still qualify for credits. They can transfer those credits. They can fund their operations using those credits and monetizing them. So there's real opportunity for them there. We've got others that the economics just aren't penciling out right now. So if that's the case, then it's hard to be optimistic. But like I said, if you can pivot, you can think hard about what the needs are and anticipate that. Then like I said, I think there's really a lot of opportunity. Tom Burton, always a pleasure chatting. I know when the rain delays stops, you'll be right there in the middle of the game. Absolutely. Thank you. I really appreciate it. Steve, talk to you soon. Tom Burton is the chair of the Sustainable Energy and Infrastructure Practice at the Law Firm Mintz. If you want to follow the insights Tom and his team are tracking in policy, markets, finance and development, visit the Mintz website and get in touch. The link is right there in the show notes. Thanks so much for listening.",
    "release_date": "2026-01-20",
    "duration_ms": 1188000,
    "url": "https://traffic.megaphone.fm/PSMI8891067252.mp3",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2026-01-30T02:16:10.064542"
  },
  {
    "title": "2026 trends: Gas turbines, Texas’ load queue and China electrifies",
    "description": "It’s a new year, which means the veteran energy analyst Nat Bullard has dropped another annual, data-rich presentation on the state of energy and decarbonization.\n\nAnd per what has become tradition, Nat is back on Catalyst – for the fourth time – to discuss some of Shayle’s favorite slides, cherry-picked from the 200-page deck. \n\nIn part one of their two-part conversation, they cover topics like:\n\n\n  \nThe significance of China’s rapid electrification\n\n\n\n  \nWhy the proportion of GDP spent on electricity has remained flat while oil has proven volatile\n\n\n\n  \nThe massive backlog and rising capital costs for gas turbines\n\n\n\n  \nHow current tech CapEx compares to past large-scale endeavors like the Manhattan Project and broadband build-out\n\n\n\n  \nThe extraordinary explosion of large load interconnection requests in Texas\n\n\n\n  \nThe divergence in load forecasting between grid operators and transmission providers\n\n\n\n  \nGlobal drivers of electricity demand growth beyond data centers\n\n\n\nResources\n\n\n\n\n\n  \nNat Bullard's 2026 presentation deck\n\n\n\n  \nCatalyst: 2025 trends: aerosols, oil demand, and carbon removal\n\n\n\n  \nCatalyst: 2024 trends: batteries, transferable tax credits, and the cost of capital\n\n\n\n\nCredits: Hosted by Shayle Kann. Produced and edited by Max Savage Levenson. Original music and engineering by Sean Marquand. Stephen Lacey is our executive editor.\n\nCatalyst is brought to you by Uplight. Uplight activates energy customers and their connected devices to generate, shift, and save energy—improving grid resilience and energy affordability while accelerating decarbonization. Learn how Uplight is helping utilities unlock flexible load at scale at uplight.com. Catalyst is brought to you by Antenna Group, the public relations and strategic marketing agency of choice for climate, energy, and infrastructure leaders. If you're a startup, investor, or global corporation that's looking to tell your climate story, demonstrate your impact, or accelerate your growth, Antenna Group's team of industry insiders is ready to help. Learn more at antennagroup.com.",
    "summary": "And then I think the second one was like 313, 131,313 dollars or something like that. So you'd have to have like $10 barrel and people using three times as much electricity or something roughly like that. Right. I really like this next one slide 32. Yeah, right. Right? Electrification of industry is going to be like 30% of the demand growth from electricity between 2024 and 2030.",
    "transcript": " Latitude media covering the new frontiers of the energy transition. I'm Chio Kahn and this is Catalyst. So for all the talk that we have, at least in looking ahead the next couple of years at like spiking prices for electricity and things like that and the share of GDP that might come from electricity expenditures, it's really fascinating how range-bound it is. We basically spend between 3% and 4% of GDP on electricity and that is that essentially. Coming up, handcrafted artisanal slides on the state of decarbonization. What if utilities could meet surging electricity demand with energy assets already in homes and businesses? Uplight is making this possible by turning customers and their smart energy devices into predictable grid capacity through an integrated demand stack. Uplight's AI-driven platform activates smart thermostats, batteries, EVs and customers to generate, shift and save energy when the grid needs it most. Learn how Uplight is helping utilities unlock flexible load at scale, reduce costs and accelerate decarbonization at Uplight.com. Catalyst is brought to you by Antenna Group, the communications and marketing partner for mission-driven organizations developing and adopting climate, energy and infrastructure solutions. Their team of experts helps businesses like yours identify, refine and amplify your authentic climate story. With over 3 decades of experience as a growth partner to the most consequential brands in the industry, their team is ready to make an impact on day one. It started today at AntennaGroup.com. I'm Shale Khan. I lead the early stage venture strategy of energy impact partners. Welcome. All right, we're back. Long-time listeners will be familiar with my favorite time of the year, at the beginning of the year, when my friend, Nat Bullard, who is a longtime analyst and researcher in the energy and climate space, but also now the co-founder of Halcyon, puts together his annual opus of hundreds of slides on the state of energy and decarbonization. It's a chock full of fun data that you don't get to see elsewhere. As always, I picked my favorites and Nat and I talked through them. It's all sorts of interesting stuff. We talked data centers, obviously, but not just data centers, oil markets, solar batteries, all sorts of things. As usual, this was too long a conversation to fit into one podcast. So, this is part one. We're going to cover a whole bunch of interesting things now and then come back next week when we will cover part two. With no further ado, here's Nat. Nat, welcome back. Shale, great to be back as always. Happy 2026. This is year four that we've been doing this, something like that. It is indeed year four. We've been doing this recording as long as I've been doing a big presentation. So, yeah, fourth year it is. I do love a big deck. 200 slides this year. 200 slides, exactly. So, the way I have an important question for you, there's no way it just happened to be 200 slides. You made it an even number. What was the one that got cut out? Oh, the one that got cut out is nothing I can tell you. I had about 365 slides as of the start of November. So, the better way of thinking about it is that I essentially cut one slide for every slide that's in there. And in fact, I usually cut more than that. So, I start off with like 300 plus and cut it down to about 150, 160 and then build back up. So, it's first an exercise in addition, then it's an exercise in subtraction to get to the kind of the magic number. As you remember, way back when I had 141, which is like a sort of arbitrary prime number count or maybe it's not even a prime number of slides. And then I always felt like there was stuff that I had left. I made it bigger and then kept it there. I think it's quite possible that if you do more than that, you're going to lose the edit capability that gives it some of the strength over the course of 12 months. Yeah. I know. I think you need to start making the number like a meaningful number. Our mutual friend Andrew Bibi, I always appreciated at his for obvious ventures, their first couple of funds, the fund sizes were always very fun. The first one was 123,456,789. And then I think the second one was like 313, 131,313 dollars or something like that. It was palindromic. Anyway, you got to come up with something better than 200. I was thinking about that natural log pi. It's a rich tapestry of options of numbers, multiplied by something that I should be able to get in there. But I do like 200 for now. It's easier for people to wrap their heads around and to benchmark a little bit when they're paging through it too. All right. Enough navel gazing about numbers of slides. Let's get into some slides. Okay. As usual, I've picked a subset of my favorite slides that I found interesting and we're just going to run through them. So we're going to start on slide 15, which is something that given that this trend has been ongoing for quite some time and in fact the lines crossed like a decade ago, I'm surprised I didn't already know, which is that China is significantly more electrified, at least as measured by the share of final energy that comes from electricity than the United States, like substantially more so. And I had somehow missed that trend. Really, this is a great one. It's some work from Ember that it's been now doing for quite some time. What it tracks is, as you say, that the share of final energy that comes from electricity. But another way to think about it is how electrified is an economy. There are lots of different ways that you can get to a high number. One of them would be that you have very little primary industry. Another would be that you have plenty of plant primary industry, but you apply a great deal of electrification to processes that otherwise would be driven with some kind of thermal input. Or you have a tiny bit of primary industry and it's all luminous melting or something. Exactly. Like an example of a country like that, for instance, would be Norway, which is both an advanced economy, has some industry, is highly primary energy from or highly electricity rather than primary energy. But China is none of those things. It's a huge industrial economy. It's a huge user of primary energy. But it's also a consistent user of electricity for its final energy source. And it's also moving at a much more rapid pace than either North America or Europe, which is slowly ticked up over the course of five decades from 10% to a little bit north of 20%. China, meanwhile, has gone since 1970 from like 3% to 30%. Well, I want to benchmark to 1990, actually, because that's where I find the chart looks really interesting. In 1990, North America is already at roughly 20% electricity, which is, by the way, still the truth. It's true today, 22%, 23%. And that's the number that I always use. I knew that number. I always tell people, if they over index on electricity or over, they're like solar is going to be the whatever, it's worth remembering in the US that electricity is 20% of final energy consumption, or I guess it's actually 22%. But that's been true since 1990, whereas China in 1990 is down at what, 7% electricity and then jumped to 30% today. It's a very different trajectory. It's a totally different trajectory at a totally different scale, too. Everything in China is bigger when it comes to energy and in particular when it comes to the primary inputs. So I just think it's a really important measure as you talk about electrified future or the electric tech stack or whatever it might be, that China is sort of grasping this as opportunity that's also being done at scale. It's one thing to say Norway can do this. It's another thing to say that China is doing this. Not that you necessarily can speak for the Chinese central government, but you're certainly closer to it than I am. I've heard that one of the reasons, one of the rationales of China focusing so much on electrification is that they wish to control their own destiny. They don't have massive domestic reserves of hydrocarbons, but they can produce their own electricity. That is why they're investing in solar or the batteries to play chain and nuclear for that matter. So do you think that that explains this? China is just saying we can't rely on energy imports long term, so we're going to electrify. There's a bit of a nuance to that, which is that the primary imports that you'd have of primary energy in China are going to be oil, which is still a major importer, and natural gas for which it's still a major importer. It does import coal for energy balance reasons, but it has an absolutely enormous indigenous coal supply that will last for centuries. One thing to remember about this primary energy from electricity is that it doesn't mean that it's entirely coming from say, hydropower or solar wind. It can be coming from thermally generated, of the thoroughly generated sources, but it is definitely within the realm of one zone destiny. Where in the electricity is generated within boundaries, within a nation state, it is effectively sovereign. So in that sense, yes, it does provide a lot more control over destiny, less exposure to market forces to geopolitics to everything else if you're firmly in control of that element of energy. Where in electricity is almost entirely within the national purview, then you would want to spend more and more energy, so to speak, getting that electricity share of energy up as high as you can. Okay. So let's move on to slide 17, which I think is an interesting coda to slide 15. Five 15 is about how electrified an economy is. Slide 17 is super interesting, and I had never seen this data put together. It's about what share of GDP is spent on electricity versus spent on oil specifically. And the shapes of those two curves are very different from each other in a way that I guess if you had asked me, I might have predicted, but is stark when you look at it. So describe the difference between the two. Absolutely. So we're like five and a half decades into an era of thinking about energy shocks. And when we talk about those, we make it seem sort of system-wide, but it's really about a shock in liquid hydrocarbon prices and specifically oil. And if you look back at the data, you can see just how indexed the global economy was to oil in terms of how many units it took of oil input to get a unit of GDP and then the spend within different economies on not just energy, red and large, but oil specifically. In 1980, so year after the second oil shock coming from the Iranian revolution, just under 9% of per capita GDP expenditures globally were going to oil. That's pretty amazing. Imagine $1 out of every 11 being spent on oil of per capita GDP expenditure. That's pretty extraordinary. At the same time, the share for electricity was a little over 3%. If you carry this trend across the entirety of the last 45 years, what you see is that the oil share, A, goes down significantly. By the late 1990s, it's less than 5%. But it also bounces around quite a bit. So right now, the share is in the range of still about 5%, but it's been as high as 6.5 or 7. And in 2020, it was below 4%. Electricity, meanwhile, is essentially completely range-bound. The highest it's ever gotten is close to 4%, and the lowest it's ever gotten is 3%. So for all the talk that we have, at least in looking ahead the next couple of years at spiking prices for electricity and things like that, and the share of GDP that might come from electricity expenditures, it's really fascinating how range-bound it is. We basically spend between 3% and 4% of GDP on electricity, and that is that, essentially. Yeah, that's the question. The reason this is interesting is because of the future, not necessarily because of the past. So just to reiterate the past, electricity looks like a flat line for 50 years. Basically rising prices of electricity, or at least rising spend on electricity overall, let's say matches GDP growth, essentially. It has to, because it's a flat line. Whereas oil is super spiky. It's gone down since the 80s, sure, the early 80s, but it moves around a lot because oil prices move around a lot. Okay, so that's how it's gone historically. What happens now is a super interesting question, right? Because we're in this moment where oil prices are pretty low, President Trump is trying to do everything he can do to get oil prices even lower. He's got this stated goal of $50 a barrel if we start exporting a ton of Venezuelan oil, et cetera, et cetera. So he's trying to get oil prices low. Meanwhile, electricity prices are under upward pressure. I don't think anybody would debate that. And so do we see electricity escape its collar and spike? Could we see the lines cross, which, by the way, tier in this chart, they never have. We've never spent more of GDP on electricity than oil historically. It's just interesting to see whether this dynamic of one super volatile thing, which is oil and one super stable thing, which is electricity, whether that's going to hold. So let's do this as a thought experiment. What would it take to make those lines cross? First of all, it would take much lower costs for oil, much more oil price for one, to a much lower reliance upon oil as an input to GDP or it's an input to economic growth. We already get more units of economic activity out of a barrel of oil effectively every year, but you'd need to rapidly increase or enhance that. Secondly, you'd need to both spend a lot more on electricity and get less from it. You would need to have it be less of a contribution to GDP growth. So if you had both of those things happen, you'd be spending a lot more, but you'd be getting that GDP out of it. And therefore, GDP is not going up as much. The expenditure is going up. That's how you would do it. So you'd have to have like $10 barrel and people using three times as much electricity or something roughly like that. Well, this is what's going to be interesting, right? So let's just take electricity on its own, forget the comparison for a second. I think most people would bet that we're going to spend more on electricity overall over the next few years, five years, 10 years, whatever it is. The question is will GDP keep up and they're tied to each other because the primary reason we're going to spend so much more on electricity is AI and there's a bunch of people betting AI is going to help GDP go to the moon. Other people saying it's going to hurt GDP. That question sort of underlies whether we break this 50 year trend of basically spending the same portion of our GDP on electricity. Right. Remember that it is also global. So there are global, not just the US, not just Western European questions within there. What happens when places that have a limited but nonzero reliance on oil rapidly electrify and electricity becomes more of GDP, but you're in turn electrifying more of everything and more people have access to electricity. We've somewhat plateaued on global access to electricity. There's like a million different ways that we can think about cutting this up to make it look possible, but it's the right kind of question to ask without a clear answer. Let's put it down. My not very satisfying response. Okay, good. Not a clear answer. So let's move on. Slide 28. I want to talk about gas turbines. This one, we've talked about this a bunch of the spot and many of our listeners are going to be well familiar with this. I hadn't actually seen the data laid out though. I think it's interesting measuring the order book for gas turbines that we have already seen relative to current production capacity. So basically how under supplied are we? I'm gas turbines. So what do you see there? So I think it's actually important to start this at the front of the series, which is 2001. They were more than 80. In fact, closer to 90 gigawatts of gas plant orders in 2001, which is an awful lot if you think about it. We have to remember that the dash for gas that you and I started hearing about from industry veterans when we began is now quite some time ago, like two and a half decades ago. But there was a time when the world was ordering quite a lot of gas turbines and manufacturing obviously was of the mood to meet that demand with new supply only to find order books that collapsed from 80 something to well under 40 the next year. And then staying steadily below production capability for pretty much the entire time with the exception of a few years all the way up until right now. The current production limit and as you know, there's not that many companies that make gas turbines is somewhere in the range of about 60 gigawatts a year. And we're likely last year to be passed that by about 20 gigawatts and to be passed that by about 30 gigawatts this year. And who knows based on current orders, you know, 40 gigawatts above a 60 gigawatt production limit. And there's a lot of reasons for this. But the first and foremost is if you are in the process and the process and have the priority to manufacture gas turbines, what you really don't want to do is be over supplied. It's not really a great, a great tentable market position. Being under supplied has an Easton the first instance, probably a net positive on your ability to book contracts and to to secure durable orders and customers you want. And it has pricing benefits. People are going to have you to do as many as you can, build as much as you can. But if you're in charge of building S or mine now, you probably have the institutional memory of the early 2000s. Yeah. And we've talked about this before with regard to like electric transformers also. It's a similar situation where like folks who've been in the industry a long time do remember a historic period wherein there was this huge order book boom and then the market fell out from under them and they ended up over supplied. And so there's been reticence to expand capacity too much for that reason. They are expanding capacity, but maybe not fast enough. Anyway, what's interesting about it is that, but also, you know, even with that history, we are the most under supplied we have ever been, at least since the data starts at the beginning of this century where right now, even today for 2028, the order book for 2028 today is over 100 gigawatts relative to about 60 gigawatts of production capacity, which helps to explain why my new, you know, the expression everything is computer. I like everything is turbine because now we're seeing right, like if you're a jet engine company, you are pivoting to provide turbines for the grid, right? This is boom supersonic and all the air derivatives and like everybody who's got a turbine is trying to turn it into a AI data center power supply. And not just that, there's companies are turning things that are usable if, frankly, somewhat imperfect solution for large scale, always on grid connected power into power, right? Air derivatives are traditionally used for very specific applications and they're not being used necessarily to power things all the time, constantly for a decade, great. They can, but that's not typically within the design spec. The design spec would be for combined cycle turbines that are great integrated and that are part of a big, liquid, well supplied power market in which they play the role that they historically played. Yes, so it's an interesting times for all of these things, right, in terms of what this shortage for now with this order book mismatch brings to the market, who it brings to the market, the kind of approaches that people then take in terms of how they buy and sell power and everything. Yeah, it's different times. It's nothing like we've experienced an hour career, but for those who've got a little bit more tenure than us, it is a keenly familiar. The grid is changing fast. Data centers, electrification and extreme weather are driving a surge in energy demand. Utilities can meet the moment with existing resources by activating energy customers and their distributed energy resources to create predictable and flexible capacity with Uplights integrated demand stack. Uplight coordinates energy efficiency, rates, demand response, and virtual power plant programs into one cohesive strategy to strengthen grid resilience, improve energy affordability, and make progress toward clean energy goals. Learn how Uplight is helping leading utilities harness over eight gigawatts of flexible load at Uplight.com. Catalyst is brought to you by Antenna Group, the OGs of PR and Marketing for Climate Tech. Is your brand a leader or challenger? Are you looking to win the hearts and minds of customers, partners, or investors? Are you ramping up your new Biz pipeline? Are you looking to influence policy conversations? Antenna works with leading brands across the energy, climate, and infrastructure space to do all of this and more. If you're a startup, investor, enterprise, or innovation ecosystem that's helping drive climate's age of adoption, Antenna Group is ready to power your impact. Visit AntennaGroup.com to learn more. Okay, so relatedly then, of course, we're under supplied. So what do you expect? Prices are going to go up. So you've got some good data on that from you folks at Halcyon. Which you and I actually talked about the last time you're on the pod a little bit, but I want to run through it again because it is interesting. You've got good data on the average capital cost of various types of natural gas turbine power plants as they are planned. I'd say these are ones that are not operating yet, but the expected capital cost and how that trends into the future, which I find interesting. So kind of walk me through that, particularly the breakdown of the different types. One of the exercises that we do that manifests itself as a data series that people can buy from us in the subscription is just going through the regulatory corpore in the US and pulling all of the data from the CPC and the certificate of public convenience and necessity or an equivalent that is basically the utility going to the state and saying we need to build this X. And in this case, we're looking at gas plants and all of the data that gives you an idea of what these things are supposed to cost is within there. It's not broken out in a neat and tidy fashion where there's this like, here's this tabular spreadsheet with all the numbers in it. It tends to be hidden away in proceedings and responses and bottles and everything else. But the upshot of this is that we can map out on the order of more than 160 active plants, like close to about 80 gigawatts worth of actual capacity in which the cost of a combined cycle has doubled. And 2026 deliveries, things that are going to come online this year are in the range of, let's say, $1,200 per kilowatt. The projects that are looking to come online in 2030, 2031 are a little bit shy of 2,500. So close to doubling in that time period. And the reason I'm going to say to useful is this isn't based on the announced capital cost for right now. It's based on the price as it moves into the future. So it's an updated live number that reflects the actual market conditions underneath these things once they've been announced, not just whatever deposit you put down with your turbine supplier, but the actual ongoing costs to make this thing into a real asset. By the way, I also wonder, I don't know, you could probably tell me because you've looked at this data, but does this include like EPC cost, for example? Yeah, this is the delivered cost, like the allowance for work during construction, all the sorts of things that flow into it, minus the things that we know are discrete and separate. If you needed to build 80 miles of feeder for it, we script that out because that's not like part of the actual stuff, the kit. So we should come back and look at this data set again in 2030, because I do wonder whether they're actually underestimating the total costs. Because EPC and stuff like that in particular, that's also super inflationary. And it's really hard to find EPCs right now because they're all booked out. So I wonder actually whether it's again, end up being even more expensive than they think it is. Well, that's why we revisit this every month, because it moves. It's interesting to add new assets. It's almost maybe even more interesting to watch movement within existing assets based exactly on that. Like the EPC target went up because we did, right? Any number of reasons, tariffs, cost of labor. Well, it's the same, any number of reasons. But part of it is the same reason why gas turbines themselves are. It's an under-supply problem. Exactly. So you can see that coming through and continuing to go. And yes, we should be revisiting this, essentially constantly. And we're already seeing, we see people getting verbal quotes that are higher. I've had actual developers come up and say, your numbers aren't going. I was like, well, show me yours and I'll show you mine. And then they don't. So we haven't actually gotten anything more concrete than this. But this is what's written. This is what is essentially disclosed by law. And it's a pretty fertile ground to get an idea, briefly any other types of turbines. So simple cycle, not quite up so much, but up by about 50% from like $1,500 to about $1,500 to kilowatt. And then we start to see reciprocating internal combustion engines as well, or rice turbines. And those are really expensive. Those are like 2,500 to $3,000 to kilowatt already. But interestingly, we don't see a long delivery pipeline for those. The delivery pipeline for those only runs out a couple of years. We don't see anybody planning rice turbines or rice installations in the 2030s yet. Because I think they're mostly used for either bridge power or backup replacement for the diesel cents. In theory, but they're increasingly being deployed at a scale that suggests that they're being used for something closer to bulk power. Right. Yeah, maybe that is like I said, everything is turbine. Everything is turbine. Okay. Well, let's stay on the theme of like all this power build out stuff. I really like this next one slide 32. So so much capex. That's my version of the slide title. You're comparing the total amount of capex spending on this is going to be predominantly data centers, which just says tech capex in 2025 to other historic booms in capex spending in the economy, which is a good way to compare. What do you find? So I'm going to give credit first of all to Michael Semblegast and his teammate, Jake Morgan, an asset and wealth management. They built this slide first, not me. I did in the past, I'd done some examples of interstate highway and broadband capex as a comp, but I'd not done this full suite that they've got here, which goes from all the public works in the 1930s, like the Hoover Dam through the Manhattan Project. And we could call our wave of electrification in the US in the late 40s Apollo project, the highways broadband build out and the tech capex. And you know, things like the Manhattan Project, electricity, the Apollo project, these are like nests then or barely above one half a percent of US GDP at their peak, even the Apollo project, even the interstate highway project is like six tenths of a percent. Building out broadband capex in the year 2000 of its peak was like 1.2% of US GDP. And tech capex right now is just under 2%. So basically higher than anything else. And to your point, this is the capital expenditure to build compute, essentially. This is capex for building just the actual computational elements as well as the buildings that contain them and the power stuff that's within the fence of the company's capital expenditures. It is not power and transmission and water capex to go with it. So it's a pretty fast, it's a pretty fascinating big number relative to everything else. And I will add all these other data points, as you've said, where you can go into history and you can figure out what year was the peak, right? And so the peak of broadband capex was the year 2000 when it was just over 1% of GDP. That's comparison against 2025 actual capex of tech, which may or may not probably isn't the peak. And in fact, the 2000 example for broadband is instructive because the NASDAQ bubble burst in March of 2000 and capex kept going. So this is not a new observation. Michael Burry made this observation recently on Michael Lewis's podcast that the capital expenditure actually wags what might be happening in the purely financial market. So yeah, this could keep going for a while. The capex is committed. Sometimes it's already underway and a lot of it, a lot of it will keep going. This is probably not the peak. Like most of the estimates based on what companies themselves are saying for their estimated capex have a higher number for next year. And then again, you attach the relevant quantum of investment in the electricity sector to it and it's a lot more money too. I mean, that's like, it's hard to say in many cases specifically, is this new capex specific for energizing this data center? But certainly the prime mover of demand growth and of building new infrastructure in the US is for energizing data centers. And so the utility capex that goes with this is also in the tens of not hundreds of billions of dollars. Okay, good segue. Let's get back into energy then. The energy results of this, right? So let's go to Texas. We're going to ercot slide 91 is on the queue. The Texas interconnection queue. This is the large load interconnection queue, not the generation cube, although the generation queue looks I think kind of similar to be honest. Everybody knows this, right? Like Texas, lots of people are trying to build data centers in Texas. No big surprise there. The queue has gone up a lot. No big surprise there. It is pretty astounding how quickly it has gone up how recently. So the data suggests that the pipeline of large load interconnection requests in ercot in Texas was what 40, 40 ish 42 gigawatts as of January of 2024. So two years ago, it went from 40 ish 42 gigawatts to 226 gigawatts as of November of 25. Now it's even a little bit higher. Those are stupid high numbers. This is a reminder. I just want to like frame this up a little bit. As of what, maybe two years ago, there were about 30 gigawatts of data centers in the US in total. So this is going from 41 to 226 in Texas alone in two years in the queue. Now that's not all going to happen, obviously, but nonetheless. This is a great one. Ercot kindly publishes this every month in a somewhat unstructured format, but high enough frequency that it's worth extracting and putting into this fashion that I got here. This is an awful lot. So 226 gigawatts. This current state peak load is in the range of about 85 gigawatts. So that's like two and a half Xing, the existing state peak load, if all of this were to happen at once. It's gone, as you say, really, really rapidly. It's increasingly co-located. Like a couple of tens of gigawatts of that are actually co-located in larger connection load, which is interesting. And that keeps ticking up. But you know, sort of sounding like financial disclosures here, not all of these assets will eventually. I don't think that Texas is actually going to be building 226 gigawatts of just large load in the coming, let's say, seven to eight years. It's the nature of interconnection queues. A lot of it is speculative. And it's especially the nature of bubbly interconnection queues. Like clearly most of this won't get built out. I think it is indicative, though, of one thing that is definitely happening, which is just like people have the perception, Texas, you can build stuff, especially big stuff. A lot of data centers want to be big. And so there is a mad rush of developers, hyperscalers, REITs, Rick Perry, basically everybody trying to lock up sites in Texas where they think they can go interconnect gigawatts. And that adds up to hundreds of gigawatts in total. So there's something else here that I think you and I and many of your listeners will be very familiar with, which is a highly speculative supply side queue. We're very comfortable with the fact that, of course, wind and solar developers plan for 10 and they're going to build two, right? Or that ratio might even be too high. You've got 10 assets that you're planning and you're going to build one of them. That you're highly speculative in terms of where you're going to go, what you're planning to do. The size of any asset itself is also fairly prospective. It depends on what you're going to be able to get, right? And you'd be silly not to max out the possible interconnect on the site and you'd be silly to not try to do as much as you can for optionality sake. What I think we're not used to is a demand side interconnection queue that has some of those same speculative elements. Like back in the day, if you're building a hospital in suburban Atlanta, you're not going out and picking seven or 10 possible sites for that hospital. And you're definitely not picking seven to 10 sites scattered across four or five different states. Like if you are building a hospital, it's because you have a human need for medical services in a particular place. You're not viewing it as completely fungible between maybe we'll go to Tennessee and build the same hospital or maybe we'll go to Texas or maybe we'll go stay in Georgia. I think it's a different thing though, actually. I don't think what's happening is the developers are saying, I need a data center and I'm going to pick seven to 10 sites in which everyone wins, wins and I'll build it. It's actually, I think what's happening that a lot of developers, speculators, et cetera are saying, if I can develop this site, I can monetize it. I could sell this thing or maybe I can lease it if I'm a colo. So I'll do as many of those as I can do that I think are good because right now there's a really valuable market on the other side. And so everybody's doing that in Texas. Yeah, right. With the, my one other wrinkle being that like if you're the pure, if you're the pure respecting the 10 element of this and that's in the good way, right, you're in the land business side of this, right? You're in the site control part of this business. That's true. If you are then building the data center on one of those sites though, if you're building the compute, you're fit, you could be more fungible between that, between where you're exactly you're going to go depending on other factors. To some extent, to some extent there's, there's, there's more like spread across different places based on what you're planning to do. I need to build this compute and I've got that in this period of time and I'll talk to whoever has slight control that will help you do that. All right. So then the direct result of this is the next slide, slide 92, which is the no one knows anything slide. So we're staying in Texas. We just talked about this crazy big load interconnection queue. So of course the question is then how much new electricity demand is there going to be in Texas as a result of that? That is the operative question, whether you are a grid operator or the market itself or whatever. And you have these great contrasting data sets of the load forecast from two parties who you would think would be pretty aligned because they're both trying to answer exactly the same question and they work hand in glove with each other and yet. So walk me through the data. Sure. So this is the, this is one of the no one knows anything slides. I've got a couple. You know, my, my perennial favorite before this was markets respond to incentives. This is the new one for our current age is no one knows anything. So yes, the transmission service providers who are responsible for building the grid and integrating the energy required to energize an electrify what happens in Texas are fundamentally serving the same market that ERCOT, the grid operator is operating. However, ERCOT says, you know what, we could go from like little under 500 terawatt hours in 2024 to like a thousand by 2030. Right. So let's call it, you know, up 110% in that time period. The transmission service providers and the other hand are like, sorry, we expect to go all the way up to about 1600 terawatt hours. We're going to go 240% up from where electricity demand was in the state in 2024. And part of the reason is that they're looking at different information. The TSPs are looking at everything that people are asking them to build and ERCOT is looking at everything that it thinks can get, that it thinks will actually happen. But also the incentives are there. ERCOT's incentive is to keep things operational as high to the highest degree possible and at the lowest cost distributed across all of the people who receive service in Texas. The transmission service providers are paid for building assets and will happily, if possible, build whatever asset base they're being asked to build. So the true number is either somewhere in between or much closer to ERCOT's figure. ERCOT has the reason for demand, supply, balancing and upkeep and everything else to get it really, really accurate in energy terms. But the transmission service providers have every incentive to go as big as possible because that's how they get paid. They get paid to build assets. So your view here is that it's less like they just have different views of the future and their views very so substantially from each other and more just like the transmission service providers have an incentive to maximize the number and it's not a real forecast. Well it's nobody, it is driven, it is a forecast. It's driven by what people are asking them to do. The question is how much discounting are they doing and that I think is where there's a significant difference between ERCOT and the TSPs. The forecast out to 2030, four years away, it's not far in the electricity supply terms, it's like the blink of an eye, it's like no time at all. And there's a difference between these two forecasts of about 500 terawatt hours. Contextually the US total electricity demand is in the range of 4,000 terawatt hours annually. Right? Coming up like closer to 4,500. But, but. So call that more than 10% of all US electricity demand as just the delta between these two forecasts in Texas alone. Yeah, yeah, we're put it this way. Do we think that in 2030, Texas is going to consume as much electricity as a third of the United States consumes right now? Like it's a potentially. As compared to roughly 10% or like 11 or 12% last year. That's right. So like it's, you know, like it's sometimes these things are more helpful when we ask them in this fashion, in this comparative fashion, what would need to be true for all of that to happen? Right? And, you know, it's a huge number, but again, it doesn't exist in a vacuum. And this is back to my sort of earlier point about how developers work is there are other grids that are similarly aggressive in their expectation of what demand might look like based on requests that they're getting without any ability to kind of zero that out against similar or identical potential demand that might be built somewhere else and not happen in wherever it is. So if you're, you know, like this, there's kind of no way to cross reference all of this stuff yet because of the nature of the way they're regulated state by state. Okay. So the next one, I want to jump back actually to slide 35 because, because this one, I think it's a reflection of like, I guess it's a reflection of a US centric mindset that I have that I'm very surprised by this that or I don't believe this data. But the data is from the IEA and it's a projection of how much of the electricity demand growth through 2030 is going to come from various different sectors. And we just talked about in the case of Texas, but it's also true the case the US like this like insane boom and electricity demand coming from data centers. So what's surprising about this other data set is that data centers are ranked fifth in terms of the source of new electricity demand. I presume that's because we're, this is a global perspective. Not a US perspective. Right. That's right. So this is a global perspective globally. Electrification of industry is going to be like 30% of the demand growth from electricity between 2024 and 2030. Even electrified transport, which we in the US are sort of being trained away from thinking about as a big driver demand is a bigger driver of demand around the world than data centers is or would be. Even appliances, there's a lot of the world that needs to add its first dishwasher, right? Even its first refrigeration. Space cooling. So just air con and buildings is going to be like 10% of the total growth and data centers are right around 8%. What I would say is consider this very much a moving target. Like, I will be very interested to see what this print looks like a year from now, two years from now, three years from now, right? But the other thing will be to be considered is, is there a trade off? If there's a sort of finite quantum of new electrons that are going to be consumed between now and 2030, is it going to come to the point where? Well, yeah, more of it went more as being consumed by data centers and less in absolute terms by space cooling. That would be complex. That would be something for the rest of the world that would be akin to a trade off that we really haven't had to do in the US in quite some time, at least not at a national level. Yeah. Yeah. It's a moving target. Data centers are going to, I mean, even on a global basis, I think they're going to move up this ranking before too long. I would agree with that, certainly. They're going to move up, but where they land is a really big question, and how they interact with the rest of these different places that electricity will be consumed. It's going to be really interesting to watch. Yeah. And the fact that in some markets, it's to some extent, it's a near zero-sum game in the sense that there's only so much supply, and we're building out as much supply as we possibly can. So, like every new data center is a new electrified industry facility that isn't going to happen, probably. Nat Bullard is a longtime climate tech analyst and writer. He's a co-founder of Halcyon, which is an AI-assisted research and information platform. This shows a production of Latitude Media. You can head over to latitudemedia.com for links to today's topics. Latitude is supported by Prelude Ventures. This episode was produced by Max Savage-Levinson, mixing and theme song by Sean Marquand. Stephen Lacey is our executive editor. I'm Shale Khan, and this is Catalyst.",
    "release_date": "2026-01-15",
    "duration_ms": 2785000,
    "url": "https://traffic.megaphone.fm/PSMI1883555056.mp3?updated=1768410615",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2026-01-30T02:21:12.634469"
  },
  {
    "title": "The VC case for 'full stack deeptech'",
    "description": "For “deep tech” or industrial tech investors, a captivating idea on paper doesn’t always translate into a sustainable or viable business. Even a remarkable technological breakthrough isn’t guaranteed to survive the long sales cycles of the industrial world.\n\nSo which companies are worth the investment?\n\nIan Rountree, founder and partner at the venture firm Cantos, wrote a bare-bones thesis on X that offers guidance on this question. In it, Rountree lays out a stark list of the companies he invests in—and the ones he passes on.\n\nIn this episode, Shayle and Ian unpack his post and explore how it applies to the current landscape of hardware and industrial startups. They cover topics like:\n\n\n  \nWhy selling technology to large incumbents like automakers or utilities can be a death sentence for startups\n\n\n\n  \nThe pitfalls of \"commercializing science\" \n\n\n\n  \nWhy capital risk to sell an end-product can be better business than licensing technology\n\n\n\n  \nWhy \"weird\" companies—\"N of 1\" startups—can generate huge amounts of talent and capital\n\n\n\n  \nWhy selling commodities (like electrons or minerals) can actually be a safer bet than entering a new market\n\n\n\n  \nReal-world examples of full-stack success in the mining industry, including Earth AI and KoBold Metals\n\n\n\n\nLatitude: Earth AI’s play in the hunt for critical minerals\n\nCatalyst: Calibrating hype with Akshat Rathi\n\nCatalyst: Climate tech startups need strong techno-economic analysis\n\nOpen Circuit: Pain, resilience, and bargain hunting for climate tech investors\n\n\n\nCredits: Hosted by Shayle Kann. Produced and edited by Max Savage Levenson. Original music and engineering by Sean Marquand. Stephen Lacey is our executive editor. \n\nCatalyst is brought to you by Uplight. Uplight activates energy customers and their connected devices to generate, shift, and save energy—improving grid resilience and energy affordability while accelerating decarbonization. Learn how Uplight is helping utilities unlock flexible load at scale at uplight.com. \n\nCatalyst is brought to you by Antenna Group, the public relations and strategic marketing agency of choice for climate, energy, and infrastructure leaders. If you're a startup, investor, or global corporation that's looking to tell your climate story, demonstrate your impact, or accelerate your growth, Antenna Group's team of industry insiders is ready to help. Learn more at antennagroup.com.",
    "summary": "Like big companies love to pilot something. And I like that concept. Right. Like because I think it's like definitionally more capital-intensive to do that. Like, just do this better. And that's like a trope. Like that's interesting.",
    "transcript": " Latitude media covering the new frontiers of the energy transition. I'm Shail Khan, and this is Catalyst. If you make progress quickly, great. Makes it easier to raise your next round and therefore do all the other things you need to do. But if you don't, the lack of momentum will kill you. I would rather need more money, but make time my friend, then treat them as pure trade-offs. Coming up, an ode to the full stack deep tech startup. What if utilities could meet surging electricity demand with energy assets already in homes and businesses? Uplight is making this possible by turning customers and their smart energy devices into predictable grid capacity through an integrated demand stack. Uplight's AI-driven platform activates smart thermostats, batteries, EVs, and customers to generate, shift, and save energy when the grid needs it most. Learn how Uplight is helping utilities unlock flexible load at scale, reduce costs, and accelerate decarbonization at Uplight.com. Catalyst is brought to you by Antenna Group, the communications and marketing partner for mission-driven organizations developing and adopting climate, energy, and infrastructure solutions. Their team of experts helps businesses like yours identify, refine, and amplify your authentic climate story. With over three decades of experience as a growth partner to the most consequential brands in the industry, their team is ready to make an impact on day one. Get started today at AntennaGroup.com. I'm Shale Khan. I lead the early stage venture strategy at Energy Impact Partners. Welcome. All right, so this one is a little out of the ordinary for me for two reasons. First, despite the fact that I am a venture capital investor, I actually generally don't have other VCs as guests on this podcast, at least not very often. I prefer usually to talk to operators and researchers who have a much deeper knowledge than anybody in my shoes. Second, I'm not generally in the habit of having a whole conversation based on a tweet or an ex post or whatever you want to call it, but I'm in the business of exceptions. So here's one. My friend Ian Roundtree is also an early stage investor. He leads Canto's, which is a pre-seeding seed fund that's been doing deep tech since long before it was cool. I think he may have been part of coining the term deep tech and is now part of coining whatever the next term is going to be. Anyway, Ian posted something about his investment thesis just a few months ago that has been basically stuck in my brain ever since then. So he said, and I quote, we invest in two archetypes at Canto's. One, full stack deep tech selling an end product or even commodity, not selling technology. Or two, weird, end of one, never seen anything like it before. Selling technology to incumbents, pass commercializing science, pass, and company doing the current thing, pass. I've been hung up on it because it resonates so strongly with my experience. And for the past now, 19 years working with startups in the energy and industrial world, first as an analyst. And now for the past eight years or so as an investor. I think it's correct, but it also describes a world that honestly excludes the vast majority of startups in this space. So it's worth unpacking. Ian, welcome. Thanks, Shale. I'm excited to finally have you on after many times of having podcasts worthy conversations with you, not in front of a microphone. And I rarely do this, but I want to talk about a tweet, an ex post, whatever, that you posted a few months ago and have pinned since then. So presumably you like it as well. But it just has stuck in my head ever since then. And I could not agree more strongly with it. And I think it actually, I want to unpack it because I think it contains some insights into the types of companies that really seem to succeed startups anyway within this world of deep tech, hard tech, whatever the hell we want to call it. You list out the two types of companies that you do look for to invest in. And we're going to talk about those two types of companies in a minute. But after doing that, you list out three types of companies that you pass on, that you don't invest in. I want to talk about that first, actually. The first one is companies selling technology to incumbents, which I want to harp on because in these deep and hard tech categories, in industrial categories, let's say, I feel like it's the majority of companies actually, the more majority of startups have a technology that they wish to deploy and the markets that they are entering are comprised of big incumbents who control a lot of the infrastructure and the distribution and so on. And so the obvious thing to do is try to sell them the technology. And so you do see a ton of that. Tell me if you disagree. Why is that a blanket pass for you? Well, I've learned this many things the hard way. I started Cantos. It'll be 10 years this spring. And it seems like the easy thing to do because it scopes down your startup to, oh, we just were going to use this amazing technology and we're going to productize it in the simplest way and that'll make it easy to sell to said big customer. And then it turns out that there's just so much institutional inertia, sometimes cultural, sometimes it's actual switching costs of having to rip out whatever they're using now to move to your product such that it ends up taking a lot longer than you think. And this has implications for capital intensity too, but we can address that later. It's more that it slows you down when speed is so critical to a startup. I think speed is actually the key point about this because there's another piece that's not described in here which people talk about a lot which is like, okay, your thing, whatever your thing is, especially if it's going to display some current thing has to be 10x better, whatever that means, faster, cheaper, et cetera. But let's say you do have a thing that is 10x better in whatever way. You would think, great, it's 10x better than the current thing. I'm going to go sell it to whoever buys the current thing and uses the current thing and I should win because it is that much better. And I think in the long arc of history, if you had infinite time and infinite cash to burn to get there, you could win that way by selling to incumbents. You can't if you are time limited on startup speed. Yeah. And I mean, to add color to that, the main reason that startups are time limited is because you raise serially in whatever. You raise 18, 24 months of runway. And so let's say you raise 24 months of runway, you need to start fundraising, let's say, six months before you run out of money. So you have 18 months to do whatever you need to do to unlock the next series of fundraising. And if your customer's sales cycle is longer than 18 months, you are de facto debt. And so you just you have to make progress faster. And you know, we could get you this is maybe a problem with venture capital as a whole. But the game on the field is you need to make discernible progress within 18 months or you don't raise your next round. A lot of times sales cycles do take longer and there are understandable reasons for this. You know, the stakes are very high in some industries. Lives could be on the line. The customer wants to do their diligence and they're using something good enough today. Question mark. And you know, maybe they go golfing with the sales rep from that company and you have to overcome all this to get your product in there and start to scale enough such that you can raise the next round and you get to live to fight another day. And one of my very first investments at Kansas in 2016 was a startup that had incredible machine learning and interoperability software that was selling into the automotive industry and to industrial robots absolutely best in class. And we would hear this time and time again from the reps at big automakers. And the company died despite having some flashy investors and incredible talent behind it because Ford and Toyota sales cycles were too long to raise the next round. Yeah, I mean, the auto OEMs are notorious for having the longest sales cycles of anybody, even for stuff that is not right. That's software you think could be faster sales cycles there. I mean, the other dynamic too, before without spending too much time on this piece is pilot purgatory, right? Like big companies love to pilot something. The timeline between pilot and full commercial rollout is never certain. It's not well defined in general. And so again, just from a time perspective, you get sometimes they're literally different teams. Like I always, I always encourage entrepreneurs to understand the counterparties incentives. And if they're like, whenever someone's behavior in a business context doesn't make sense to me, I try to learn how they're paid. And usually the answer comes to the fore that way. And so if you can just understand people's incentives, you can navigate around that and sometimes quicken the sales cycle or assess whether you are pursuing a sales cycle that is compatible with your startup in the first place. I will say I've learned this lesson the hard way as well in big industrial categories, like the chemical industry, the mining industry and so on. It's easier said than done to not do this. So we're going to get to the flip side of this, which is like if you're not selling your technology incumbents, then you have to be full stack and that has its own challenges. But I think you and I are aligned that like despite those challenges, it may be the only way to succeed at a venture pace and a venture scale. Yeah, well, I mean, speed is, I would argue the most important thing, but there's also like ultimate value capture and there've been a bunch of cases, whether it's selling some amazing chemistry into the battery supply chain or selling really advanced software built for an industry or a subsystem that goes into a larger plant or something where you have objectively superior technology and let's say it's 10x better than whatever there is today. And they acknowledge that this is great and they want it and they give you an offer to pay something that is way lower than you think it's worth. And when you push back, they say, sorry. Yeah. Like if you're just not in the pole position, then you're not often going to get remunerated for the value you're creating. Yeah. I mean, speaking less to the value capture and words of the timeline thing, I think I'm thinking about a company like Seal and Anno, which is run by a friend of mine, Gene Burschowski. I'm not an investor there, but close to Gene, who's amazing and like a total rock star CEO, you know, they're doing Silicon Anno battery materials and it is clearly better. Everybody I think agrees it is clearly better and they've had to go, they're selling to auto-amps predominantly and it's been and they're getting there now, but it's been, I don't know, 13 years or something like that. And like it's a very rare founder who can keep a company alive and funded that long for something like that. Yes, definitely. Okay. Let's move on. So selling technology to incumbents is hard for all the reasons we described. Second category that you said is a pass, commercializing science. I guess I want to hear what you mean specifically by that. Yeah. I mean, without getting into the semantics of like do we go at hard tech or deep tech or whatever, there is a category of company that I alluded to before, which is you have incredible technology and you think therefore it is incredibly valuable. But that's not actually how business works. Like the only point of a startup or business in general is to create profit margins above and beyond its cost of capital. And technology can be a very interesting means to that end, but it is only a means to that end. And just because your technology is mind blowing and you know, is cited in a bunch of papers or whatever does not necessarily mean it is valuable in an economic sense. And so if you were like, you know, commercializing your PhD, for instance, you can often look like you have a hammer and you're just looking for nails. Whereas in a business context, you have to reverse it and you kind of have to be obsessed with the problem and completely agnostic as to the solution. And I find that there are a lot of deep tech founders, especially PhD entrepreneurs and particularly when they are commercializing their own thesis, then they kind of have it backwards and they're waiting for people to tell them how awesome their technology is. When really you have to do a little more work to go show them. And so that's part of it. The other part is the timelines where I would much rather have a novel application of a existing or relatively new technology rather than wait for something to become market ready in the first place. And you know, I've lost a lot of money just like waiting for a startup to advance through technology readiness levels. So I feel like there's two pieces there to what you're describing. One piece is this a hammer in search of a nail kind of a problem. It's like somebody who's attached their personally attached to a particular technology that it turns out actually might not be like product market fit is elusive. And then the other is more like a TRL scale for lack of a better term problem of like if you're investing in like breakthrough science that hasn't been sufficiently proven, then it just takes too long to get there. Let's spend a minute on each of those. On that second one on the like it takes too long to get there. How do you think about things like fusion, for example, nuclear fusion, right? Which is like anybody who's investing early in nuclear fusion, even if they were doing that 10 years ago or today, like it's sort of inherently breakthrough science that hasn't been commercialized. I'm to the short answer is I don't. That's just not. I would do. I used to spend a lot of time thinking about fusion and I would like, I'm not technical at all, but like interested enough that I would like to bait people on. Is it DT or is it PB 11 or whatever? I loved like getting wonky like that, but it turns out in my business context, I don't have the time to wait for that to become commercializable. And there are some very interesting initiatives to bring fusion energy about. It is expressly the type of science that we at Kanto's do not invest in. Yeah. Although I really hope for humanity's sake, we pull it off. And then on that first one, the hammer and search of a nail thing, I also have seen that a lot. Like one, I sort of somewhat recent example for me is we ended up incubating a company called Voia Energy, which is still kind of in stealth, but is known to the public. And they're using metals as fuel basically in a particular way. And we kept running across. As we were incubating and we were working with the founders on it, we were taking, we're doing an electrochemical approach and we kept looking around and finding a few other companies were all using combustion. And I was trying to figure out, and it seems clearly worse to me for a variety of reasons to do that. And so we were asking ourselves the question, like are we missing something? Why is that the way that everybody is doing it? And a lot of it comes back to there's a particular professor who is a professor of combustion who has been the one to create the diaspora that exists such as it is today around this particular area. So it's exactly that thing of like, this is a combustion person. That is what they do. And so of course, that is what they are going to spin out of their lab. And that's where the starters are going to come from and the researchers and so on. Do you see this a lot? The problem in like, you do a lot of stuff in bio world, is the technology and solution in search of a problem statement, a bio thing often? Oh man. I started by saying we're doing a lot less of it now. Time has changed. Yeah. Do we do very much believe that like in our lifetimes, the intersection of computation and biology will probably be one of the more prolific areas of innovation. It has been tough to invest there for a while for a variety of reasons. But yes, there's a lot of this like commercializing science. Now that is an area interestingly where the capital markets have really figured out how to underwrite to let's say technology readiness levels. Yes, I find this to be frustrating not being in the pharma world, right? Because I look at the pharma world and I'm like, oh, like drug, the process of taking a drug from very, very early stage through to the market is like really well understood. The financing seems really straightforward. Why can't we just like replicate that across a variety of different markets? It just doesn't seem to work the same way. It's not standard enough. I mean, I think, I've thought a lot about this. It's just not standard enough. You need enough in that industry, you can kind of look at, okay, well, we're in, we have this kind of read out in our phase one trial and we're in this indication. We know this indication has this many patients and usually you pay this much for it and we can work out like big pharma when they acquire something. They've like run the discounted cash flow houses on it, not based on technical milestones. And it's just, we don't have a process that is as scientifically and regulatory defined and widespread enough that an entire capital market can develop around it. Now, that said, even though there are dedicated investors for biotechnologies, it has been a really tough area for public and private companies for a while, like a third of publicly traded biotechs were trading below cash because they just couldn't, if you didn't have a team that understood this, then like a broader universe of investors couldn't access that asset. And so even when you have very developed capital markets and dedicated funds that have been performed over decades, it's sometimes still not enough to weather certain storms. I still think in principle, at least like leaning in this direction on some other deep tech stuff would be interesting. You see this occasionally in other places, not to bring up fusion too much, but one that comes to mind to me is Pacific Fusion, which raised a quote unquote billion dollars out of the gate, but it's actually like a staged series of capital infusions contingent on milestones. It's like a billion dollars lined up if they can achieve X, Y, and Z over time. And I like that concept. I want to see that. I mean, you're an investor in like Salugen, right? If you had looked early days to what Salugen was doing, so this is in the chemicals industry, could you have lined up a series of technical milestones ahead of time? Could you have done this a priori and then said, okay, we're going to sort of predefined the capital roadmap here? Or was it just too much uncertainty? Were unit economics too much of an open question? Like, what stops us from doing that? Yeah. I mean, well, in Salugen's case, it was special because we met at Y Combinator Demo Day and they had maxed out their credit cards to buy $15,000 worth of Home Depot components and had a small bio reactor using their technology and were making hydrogen peroxide at that time and selling to float spas in the area. They had thousands of dollars of revenue and it was small, but you could at least, like they were already- Right. There wasn't a long road back to first dollars of revenue. Yeah. And so it's just been scale up. Like that, I would define, you know, they had this cool science out of their PhD work at MIT and then it was just like scale up from there. It was more engineering after the seed round and we could do the TEA and we knew that if they got to a certain scale, it would be this profitable. And then there were some question marks around which chemicals can we expand to and like how much of this is going to be specialty versus commodity. But that was a little easier than like, trust me, trust me, I just need $200 million and then we'll make money. Which we see a lot of. And occasionally works, right? It has. I mean, to be clear, like my opinions come from my own experience and are in the context of like my firm and my background and my capital base, it doesn't mean it's the only big money. Okay. So that's two sort of tough categories, selling technology and incumbents, commercializing science. The third one, I don't think we need to talk about a whole lot because it's kind of self evident, but you said like, Enth company doing the current thing. I share that view as well. It's just, it's much, much more difficult for a variety of reasons to get a venture grade outcome if you are in a really crowded market. It doesn't mean like some somebody breaks out of those crowded markets sometimes, but the bar is so, so much higher for you. It's harder to raise capital. Yeah, exactly. It's hard to attract talent. It's harder to separate yourself from the pack, basically. Well, this gets back into the commercializing science thing a little, which is there's a type of startup that I have invested in in the past that's like, well, here's all the technical reasons why our tech. We're the best because X, Y and Z, like we could create a chart and it's going to show all of our competitors and we have the full X and they have the personal. But sometimes you do legitimately have something that is better than the incumbents. Like, you know, in, I'll pick on one of our, one of our own portfolio companies, we invested in a company that's doing amazing processing of radar technology. Like mind blowing can take off the shelf data from your run of the mill radar and resolve more or less a three dimensional image. They call an RF camera, like mind blowing cheaper than a camera can see through fog. In some cases, see through walls, put this thing on cars, on drones has so many implications. And there's a much better funded company incubated by BC called Chaos Industries, which I personally think has worse technology. But they're doing a lot better because they've productized this. They're very good at selling it. They're very good at marketing it. They have a lot more capital and they're landing contracts with the government left and right. And you know, my hope is because we've invested in a much better technology, we can catch up. And like, I've seen this movie before and sometimes having the best technology doesn't win your race. It gets back to the old trope and venture of right, like a combination of team, tech and timing. But like, you can have the best tech and you don't have the other things going for you. It isn't sufficient. It may be necessary. It's not actually, I don't think it's all necessary either. It depends on the situation. It's certainly not sufficient. When it gets into like the intersubjective nature of capital markets, you can be objectively right. But if everybody else is wrong for long enough, you are de facto wrong and they are de facto right. And so you have to account for it's tempting for self-styled intellectuals to sit and think that like, oh, I've just outsmarsed everybody. But like the market can afford to be wrong longer than you can afford to be right. Yeah, that's the other point, right? Like what does it take to prove your rightness, how long, how much money, et cetera? I think back on the heady days of all the solar technologies and this thin film technology is predominantly in the late 2000s, early 2010s. And you know, I think the common story that everybody tells about what happened there is that VCs invested billions of dollars into a bunch of different thin film technologies. And then meanwhile, China scaled up crystalline silicon, which is the dominant technology and cost got so cheap that there was no way to compete. And that's true. It is also true that in principle, some of those thin film technologies could be cheaper, right? Like they could still be cheaper that crystalline silicon is even at a silver cost today. But to get to the point where they would be cheaper requires a lot of scale and a lot of capital. And as crystalline silicon prices were crashing, nobody was willing to fund that effort. And so you know, you may have been right, at least some of those folks may have been right. But yeah, it means nothing essentially in the grand scheme of things because they were never able to prove it. Yeah, I used to kind of think that you could like, if you had an amazing enough technology, you could sustain years of no commercial progress assuming you could fund it such that because you were taking no market risk, I was, you know, patently obvious that your technology was better. Once you came to market, you could jump up the commercialization curve faster. And rather than needing to start small, you could just start with a giant contract because your stuff is so awesome. One of the things I didn't see there is that the learning curve matters. And once you start doing a thing, you tend to get better at it. And if you're commercializing something at small scale, you're kind of working out all the kinks that if you're sitting in your lab, making your technology better, then you bring it to market, you only get to learn then. And it's kind of like too late. And so I'd like, I actually like startups that start small and they just get that little compounding and learning every little like sales motion, getting to know your customer better and internal operations and how does technology hand off with manufacturing and closing that design for manufacturing loop and all those little things. Like, if you're just developing the technology, you have to like punt them and then do them all later and it's maybe too late and you've got all this technical debt or something. This compounding is a wonderful thing. The grid is changing fast. Data centers, electrification and extreme weather are driving a surge in energy demand. Utilities can meet the moment with existing resources by activating energy customers and their distributed energy resources to create predictable and flexible capacity with Uplights Integrated Demand Stack. Uplight coordinates energy efficiency, rates, demand response and virtual power plant programs into one cohesive strategy to strengthen grid resilience, improve energy affordability and make progress toward clean energy goals. Learn how Uplight is helping leading utilities harness over eight gigawatts of flexible load at Uplight.com. Catalyst is brought to you by Antenna Group, the OGs of PR and Marketing for Climate Tech. Is your brand a leader or challenger? Are you looking to win the hearts and minds of customers, partners or investors? Are you ramping up your new Biz pipeline? Are you looking to influence policy conversations? Antenna works with leading brands across the energy, climate and infrastructure space to do all of this and more. If you're a startup, investor, enterprise or innovation ecosystem that's helping drive climate's age of adoption, Antenna Group is ready to power your impact. Visit AntennaGroup.com to learn more. All right. Let's talk about what to do. We've mostly been talking about what not to do. You have two archetypes here. I want to spend most of our time on the first one. Would you describe as full stack deep tech selling an end product or even commodity, not technology? So, say more. What is full stack? When I say full stack, I'm some tweeting a 2015 post from Chris Dixon at entries in Horowitz. It's largely been a crypto investor. But back in 2015, he described a full stack startup and was largely alluding to companies like Uber and Lyft and Airbnb, who rather than trying to sell software to the taxi and leave the magazine industry or to the hotel industry, were leveraging software to influence the real world while not necessarily building hard-rhythmselves. I thought that was really interesting and largely apply that same thinking to more industries and the types of technologies that we invest in where you are building some software but also some physical component. There's nuance to this. I mean, it's sort of a full stack is similar to vertical immigration. But it's not exactly the same thing. There's heavy overlap, but it connotes the combination of technology and non-tech product or services specifically. Yeah. I think the key thing for me actually more than like defining full stack is the selling an end product or even a commodity, not selling technology. Whatever the thing is that your thing unlocks, like go, if I'm vertically integrating in a direction, it's downstream to start at least. Right. Sell to the end customer of the thing. Whatever your technology makes better, figure out who the end customer is for the thing that that made better and then sell that product. But that is expensive. Like let's be clear about the trade-off there. Right. Like because I think it's like definitionally more capital-intensive to do that. Do you disagree with that? No, it is. There's clearly the downside of going full stack is that you typically need a little more money to do it. And like the time as money added is appropriate, but there's a multiplier on time, as we talked about earlier, for startups where there's such an importance around making progress quickly when layering in the intersubjective nature of capital markets that like if you fail, like if you make progress quickly, great, makes it easier to raise your next round and therefore do all the other things you need to do. But if you don't, the lack of momentum will kill you because it'll become multiplicatively harder to raise capital the less progress you make. I would rather need more money but make time my friend than treat them as pure trade-offs. Can you give me like a canonical example for you of like a company either you are or not involved with that is full stack in a category where they could otherwise be selling tech to incumbents? Yeah, so I mean, a great example is mining. And there's a few companies in this space, full disclosure, one of our largest investments is Orthaei. But you also have Cobold, which rates a lot of money and Varei. And there's a couple of others in this space. So mining is an industry that is massive and there were just not that many startups in. And I thought that was interesting because it's such an important industry. This is definitely a commodity industry. And it is increasingly important for semiconductors, for defense tech, for electrification of the grid. Yet we're not seeing much innovation there. There had been some startups along the way that said, hey, we're going to use satellite imagery, AI to help people mine better and know if there's a deposit near your existing mine or something like that. And it turns out it was very hard to sell that technology into mining companies. And two, they weren't willing to pay much for it. And so the company we invested in, or the AI, and I believe Cobold may have had a similar journey, but although I won't speak out of turn, said, well, hold on, how much is it to acquire these mineral rights and which is a drill? Like, let's just hire some geologists and go apply for the rights. Earth AI went out and bought rights and drilled their own hypotheses. And we now own deposits that we think are very valuable. There's a lot more work to be done to prove them out. You've seen Cobold go out and acquire a deposit. They're using AI to maybe find and definitely mine a little more efficiently. And this is one where like if you had taken the typical startup path of just selling software, maybe you make a software license, but if you are willing to go out and take a little more operational risk and need to raise a little more capital to be sure, then you can end up owning literal gold in the route. And that's a lot more interesting to me as an investor than a mining SaaS company. The other category that I think of as you described this that I think it's equally applicable to is the like AI for materials discovery category where there's a bunch of companies doing that now where like my question to every one of them and I've talked to them is like, okay, let's say you can you build your magic model and you can use that model to discover novel materials. Are you going to license the model and the technology to a big company? Are you going to try to sell the IP around the materially discover or are you going to do what you probably should do which is make the material? Whatever you discovered, if it's better, you should just make and sell that thing. And that ultimately, that's your business. You're not an AI discovery company necessarily. You're an AI enabled materials company. And some of them are doing that. But it's kind of the same story as I think you're describing in the mining industry. Yeah, totally. I mean, one of the initial thread that I started pulling on that led me to my preference for full stack hard tech startups was I invested in a construction software business that was doing AI for planning. And there were a couple of these out there and we were sort of selling against some of those other companies. And the general contractors are really slow to adopt. And I was like, could we just buy a failing general contractor? Like, just do this better. And it turns out it's not just the technology that improves every single time we've invested in a capable team or watched a capable team go after an industry with a lot of inertia. There are a thousand little things that can be improved upon that if you're not taking that on and you're just selling into the industry, you're not going to help innovate those areas. You mentioned even commodity thing. Let's talk about commodities for a second. A lot of the world that I treat, I'm like, you know, focusing energy and industrials. And like, when you boil that world energy in particular down to its core constituent parts, it's mostly commodities, right? Electrons or MMBTUs or whatever. And notoriously commodities are difficult markets. Commodities sectors are difficult markets to build startups. And that's like a trope. I think there are a bunch of ways that you can do it. But you said in here even commodities. So like, what is it that makes a company who is going to end up, if they go full stack, they integrate downstream, they're going to sell a commodity. What does it take for that to be attractive to you? Yeah, I love commodities. For a long time, it was used as a pejorative in venture capital. I love when a company is selling a commodity. When the technology that is embedded in their full stack business actually gives them a cost advantage, that's incredibly powerful. And taking a step back, like what we do as investors is in a way price risk. And so if we're thinking about the types of risks that a startup takes, there's technical risk, there's execution risk, and there's market risk. And you always have execution risk. So let's focus on the other two in hard tech and deep tech and physical world. You're typically taking a bit more technical risk than some of our peers who focus on maybe software and AI applications. And not foundation models, a lot of technical risks there, of course. But if we're taking more technical risk, and we are on balance, basically paying the same prices at seeds or is a series B, whatever, as companies that are not taking more technical risk, then unless you are offsetting that with a equivalent decrease in market risk, you're probably just going to make worse investments. These are the physics of finance. And so why I love commodities is because it offsets the technical risk we're taking with less market risk. Because I know if I'm selling a commodity, i.e. my product is molecularly identical to the competitors, but I have a cost advantage. I know you can sell that. I love one like in my memo, I can just look at the spot price of something on a liquid market. And I know that's the mark that we're shooting for. Whereas if you're developing something new, or you're having to convince a customer that they need it, even if you know it's objectively better, then there is inherently market risk there, and that just makes it a riskier asset. I've heard of the node, CoSla, say something very similar, like he'll take technical risk, but he won't take market risk. The other thing that I would say here about commodities is like, I think people- But he invested in impossible foods for getting that there was market risk there. Yeah, I mean, many things have- I think nothing is as simple as that makes it sound, right? Like there's market risk where you think there's not, but also commodities are not commodities in the way that you think they are. Like I mentioned that electrons are commodities. They're kind of not, right? Like, yeah, an electron is a fungible thing, and it's similar to every other electron, except where and when it is delivered is very, very important. And so there are lots of non-commodity businesses built on selling electrons because they're able to sell electrons in the right place at the right time, or both. And I think that's true of most commodity markets, right? Like very few of them are truly indifferent to time and place. And that additional factor matters in terms of whether something- whether it's truly like a knife fight to the bottom on cost, which is why people don't like commodities from an investment perspective. I don't want to go on too much of attention, but there's an interesting corollary here to the type of real-world full-stack business that we both like and sort of decentralization of infrastructure. Like if there is advantage to defy economies of scale and co-locate your product, your, you know, behind the meter, energy generation, whatever, then you are operating your own sub-facility, but you're still taking some market risk by virtue of customer concentration, you know, because you can presumably as a startup only afford to have so many of these co-located things. And, you know, if they're with the same two or three customers and they change their mind or someone gets fired and the new gal doesn't like you or whatever, that's risky. So I've invested in some of those, but you just have to be clear about like there's, you know, whether the counterparty is going to slow your sales cycle down. Yeah, there are also interesting examples that are like companies in a commodity space with a differentiated input and or companies in commodity space that like their execution and ability to learn in that market allows them to enter into a new market that's non-commodity. So let's say you want to give an example, Crusoe, right? So Crusoe was flare gas to Bitcoin. That was that was the start of the company. They went and locked up assets that were methane flaring. It's wasted energy. They turned that they, you know, put little data centers there and mine Bitcoin. That's that's a commodity, right? Bitcoin's clearly a commodity. And they did that whole bunch and then that allowed them to sort of like build up more expertise. They built, they started going beyond Bitcoin and into cloud and they had their own little cloud managed services thing. And they had all this experience building small data centers and then like the right place at the right time came around and to give them credit, like they fully went after it and took full advantage of it. And then now they're building, you know, Abilene Stargate campus for OpenAI and Oracle and a bunch of others and they just raised money at a $10 billion valuation. Another totally different company. Yeah. I think Corrie started mining crypto too. I don't know if it was because they were flaring, but no, no, it was different. I mean, Corrie was just just doing crypto mining. A lot of crypto mining companies are now, you know, AI data center companies that that pivot is not unique to Crusoe, but I think everything is computer. Yeah. But they've been able to particularly take advantage of it. What's interesting to me about it is like they were, they were certainly in a commodity business. They had to differentiate the original version of the business had differentiated input, right? It was flare gas was their input to create Bitcoin. And that's cheap energy, right? If you could take advantage of it. That's what I mean. If you have a car, you have a structural advantage in producing a commodity, that's like the holy grail. Right. Right. Like if I can make dollar bills for 70 cents, I'm a trillionaire. So I have a different frame that I often use to describe to categorize startups. And my version of it is wave makers and wave riders. So like there are companies that make a wave, they do a thing that but for the existence of that company, the would not have happened, certainly would not have happened in that timeframe or their wave riders, right? They correctly predict a trend a few years ahead of time. And they time the development to their technology or their company correctly to that trend. And then they're able to ride that wave, you know, Tesla being the canonical wave maker, like the EV thing wouldn't have happened at least on that timeframe that it has but for Tesla. And then for every Tesla being the wave maker, there are hundreds of wave riders, EV charging companies, battery technology companies, etc, etc. Right. And it's useful frame in the first place, but it's also valuable for me because I think the the the onus on the, you know, what matters the most is different across those two categories. There's a certain type of particularly on team. There's a certain type of founder and founding team that is required in the wave maker category because it is so hard because you are swimming against the tide. And you have to bend the arc of the universe to meet your your needs. I think it'd be similar in the full stack deep tech concept, right? Like it's harder to do you need more money, you have to do more things. Definitely. Right. And so what do you how do you think about like the archetype of the founder that can do the full stack deep tech thing? Our preference for this type of business has also increased the onus on the entrepreneurs. And you know, when we when we thought that you just needed incredible technology and you know, sort of good enough business sense, I was not not that we were lowering our bar for entrepreneurs, but I was sort of looking for different things. And now we flesh it out. I actually have internally like a wave of scoring founders along six axes and how we tease out each of those. And a lot of them are around the qualitative. It's sort of, you know, it's talent gravity. It's narrative ability. And if you're going to raise the capital required to vertically integrate a business and go full stack, then you just have to be that much better at fundraising. And I think you have to be really honest about the fact that, you know, a lot of people don't like the reason that I'm on this side of the table, not operating a company is I know I don't have those qualities. I have enough of them to run a small investment firm, but not to build a full stack business that's going to come at a giant advantage incumbent. And to do so, you probably need to raise, you know, nine figures of capital, probably ultimately billions of capital across equity and other forms of capital. So the type of person you need to make a wave is like you said, like, you know, bends the arc of time toward them. We'll say that a founder has to have such a powerful gravity well that like, we feel ourselves being physically pulled toward them in a meeting. And if we don't get that sense, we sort of say, okay, well, maybe this isn't a wave maker. And we've just found ourselves looking for people that are both incredible technologists and also have this ability to communicate things in a hyperflament way. They can kind of go up and down the stack of understanding, communicate it to an expert, communicate it to the general audience and get people so fired up that they bend the fabric of space time to their will. Yeah. All right. Just to close out the other category of things that you do look for to invest in, which I also share, you described as weird n of one never seen anything like it before. So here's my question for you. Apart from those things, I mean, I'm drawn to them too. But apart from just them being cool, like, how would you articulate? Why are the weird n of one never seen anything like it before? Ideas, good venture investments on balance to continue the astrophysics parallel? Like, if you're in a area with other astronomical bodies, you're sort of like competing with their gravity to pull in talent and capital and PR, then that's harder than if you are the only body to reach some critical mass in an area with a lot of, you know, a lot of matter. And if you're like the, you know, we saw an early stage company recently that I thought was weird and interesting. We ultimately didn't invest where a woman had left Wall Street to build, as she calls it, to beers for dinosaurs. And she's using, you know, some satellite imagery and AI and a field team to go out and find dinosaur fossils, which have been selling for a higher and higher prices. And I thought that was really interesting. I mean, I've been doing this for 10 years. I see like a thousand startups a year more. I never seen anything like this. And if it's an area that is sort of big and interesting enough, and I don't know if fossils are, I didn't go that deep, but then she's going to build like the company. And when people think of dinosaur fossils, they're going to think of her company. Whereas if you've got, you know, you and I both invested in long duration energy storage businesses, but if you've got like the 20th Elders business, it's going to be a little harder to stand out and the venture capitalists you need to raise money from have probably made a bet already. And a lot of them don't want to make a competing bet and it just complicates things. Yeah, but I want to separate two things. I mean, there's a part of this is just the flip side of nth company doing the current thing, right? Like if you just first to a market, I guess would be another way to put it. That's a piece of it. But the other piece of what you described is weird, never seen anything like it before. Like it's something above and beyond just you are the first in this category. It's I think to me, an enormous amount of startup success ultimately comes down to narrative. How well the founders able to construct the narrative that raises capital and attracts talent. But also just like if the narrative, if the story, if I can tell myself the story of what this company is trying to be and my eyes light up as I'm trying to do it, because it's so interesting and so weird or so impactful, if it would have such a big impact on the world, I'm drawn to it. And that's a part of the magnetism that we're talking about before that can come from the founder, but can also come from the vision. I think of a company like Colossal Biosciences, who's the tag, I don't know anything about them apart from that they're trying to bring back the woolly mammoth. Like that's interesting. It's weird. Yeah. It's weird. So yeah, I guess I just want to I want to clarify that it's not just being first, it's not being the sole body in that part of the universe. It is also about that part of the universe being exciting, I guess. Right. It's not valuable just because it's weird for us. Weird as a filter for might be unique and unique in a valuable way. Look at this defense tech wave. And now it's like the hottest area outside of AI. And that was more or less created by Andrew and I'll give a lot of credit to Palmer, one of the four founders of that company for like completely reversing this trend. And that is I don't know if I would have called Andrew weird in the beginning. Maybe I would have like now it's sort of hard to look back because it's so big and spun off all these other defense tech unicorns that yeah, when I first heard about it, I thought it was weird. And then weird sometimes means controversial to be clear like to lean into these areas you necessarily are going to have to disagree with people. And if you're not comfortable doing that, then it's going to be difficult to build a weird, unique end of one company. All right. And this was unsurprisingly a lot of fun for me. Thank you again for joining. Of course. Yeah. Well, this is just one of our normal conversations we have recorded this time. That's right. Ian Rountree is a partner and the founder of Cantos. This shows production of Latitude Media. You can head over to latitudemedia.com for links to today's topics. Latitude is supported by Prelude Ventures. This episode was produced by Max Levinson mixing in theme song by Sean Markwan. Stephen Lacey is our executive editor. I'm Shale Khan and this is Catalyst.",
    "release_date": "2026-01-08",
    "duration_ms": 3162000,
    "url": "https://traffic.megaphone.fm/PSMI3511689872.mp3?updated=1767839976",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2026-01-30T02:26:53.962933"
  }
]