[
  {
    "title": "How geothermal gets built",
    "description": "Geothermal seems to be nearing an inflection point. With rising load growth, clean, firm power is more valuable than ever. Next-gen geothermal players like Fervo Energy and Sage Geosystems are signing PPAs with major tech firms. Even U.S. Secretary of Energy Chris Wright — a known critic of renewables — has praised the potential of geothermal. \n\nThe size of the U.S. geothermal resource accessible through next-gen geothermal technologies like enhanced-geothermal systems is enormous — potentially thousands of gigawatts. But tapping into it hinges on figuring out the economics.\n\nSo what does it actually take to develop a geothermal project — and how are new tools reshaping the process?\n\nIn this episode, Shayle talks to Carl Hoiland, co-founder and CEO of geothermal energy company Zanskar, which uses AI for enhanced geothermal exploration. Shayle and Carl cover topics like: \n\n\n  \nWhy geothermal stalled — and what’s changing now\n\n\n\n  \nThe full step-by-step process of developing a project\n\n\n\n  \nHow to avoid exploration risk, also known as dry hole risk\n\n\n\n  \nMethods for estimating resource size and managing depletion risk\n\n\n\n  \nThe geothermal supply chain \n\n\n\n  \nHow permitting is speeding up\n\n\n\n  \nCarl’s outlook for when and where development is likely to happen\n\n\n\n\nResources:\n\nLatitude Media: Geothermal could meet 64% of hyperscale data center power demand\n\nLatitude Media: Why geothermal might benefit from Trump’s tariffs\n\nThe Green Blueprint: How a text message launched a geothermal revolution in Utah\n\nLatitude Media: The geothermal industry has a potential ally in Chris Wright\n\nLatitude Media: Why California lawmakers are warming to geothermal \n\n\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.\n\nCatalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, and increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data plus tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.\n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "Latitude Media is hosting the Transition AI conference on June 12, 2025, focusing on energy infrastructure in the AI-driven load growth era. The event will bring together industry experts and feature live episodes with Google and Commonwealth Fusion Systems. Geothermal energy is gaining momentum for its clean, firm base load power potential, with companies like Fervo Energy securing PPAs with utilities and Google. The podcast delves into the history and challenges of geothermal power development in the US, highlighting the need for improved exploration methods and the distinction between conventional hydrothermal and enhanced geothermal systems (EGS). The exploration process involves drilling temperature gradient holes and slim wells to confirm resource viability. ANZA and Energy Hub are sponsors, offering data platforms for energy storage analytics and virtual power plant solutions, respectively.",
    "transcript": " Mark your calendar for June 12, 2025. Latitude Media is holding its fourth transition AI conference in Boston. This year's theme, energy infrastructure in the era of AI-driven load growth. We're going to bring together investors, developers, researchers, and tech companies to talk about the creative ways to meet data center demand. And companies include FERVO Energy, Form Energy, Scale Microgrids, Spark Fund, KKR, Generate Capital, Orenia, FlexGen, National Grid Partners, and more. Plus, we're going to have a live open circuit episode featuring Caroline Golan from Google, and a live green blueprint episode featuring Rick Needham from Commonwealth Fusion Systems. Get your ticket at latitudemedia.com slash events, podcast listeners, get 10% off their ticket, use the code latitudepods10 at checkout latitudemedia.com slash events. We will see you at transition AI. Latitude Media, covering the new frontiers of the energy transition. I'm Shail Khan, and this is Catalyst. When you look at the full stack of kind of near-term EGS and conventional, we really are talking about hundreds of gigawatts to terawatts of resource potential. There's much potential to give as, say, the entire Gulf of Mexico from an oil point of view. Coming up, the heap beneath our feet. Do you want instant access to energy storage supplier pricing that's project-specific, or the ability to compare domestically-made battery and PCS options across the market? Anza now offers the industry's first battery energy storage data and analytics platform to make better development and procurement decisions. Anza provides in-depth commercial, technical, and risk data and analytics to help developers choose the best equipment for any project. Improve your returns and save months of evaluation time with Anza. Learn more about Anza's energy storage subscriptions at go.anzarenewables.com slash latitude, or click the link in the show notes. Imagine a world where connected devices like EVs, home batteries, and smart thermostats work together to support a more efficient and reliable power grid. Well, you don't have to imagine it anymore. This vision is a reality today, thanks to Energy Hub. With Energy Hub's Edge Derm's platform, utilities can create virtual power plants through customer-centric flexibility programs, making it easy to manage distributed energy resources and balance the grid. Unlock grid flexibility and reliability through cross-DER management with Energy Hub, the trusted Edge Derm's leader. Visit energyhub.com to learn more. I'm Shail Khan. I invest in early-stage climate technologies at Energy Impact Partners. Welcome. So, is geothermal having a moment? Here's the case for its clean-firm base load power, which is a hot commodity right now. Hyperscalers of all expressed interests, some of them have signed PPAs. Fervo Energy notably has PPAs, both with utilities and with Google for hundreds of megawatts of new development. The Trump administration, in particular to the Secretary of Energy, Chris Wright, came into office with very positive rhetoric about geothermal, in contrast to other forms of renewables. The case against is the big, beautiful bill that just passed the House last week, which throws the geothermal baby out with the wind and solar bathwater, basically. So, all of that enthusiasm is not currently reflected in legislation, at least, though, let's see what happens in the Senate. Anyway, I think regardless, the case 4 is a lot stronger than the case against here, to be honest. And so, I wanted to bring on Carl Huyland to talk a little bit more about geothermal at a high level. Carl is the CEO and co-founder of Zansgar, which is a startup that's leveraging AI to enhance geothermal exploration and ultimately production. But beyond that, Carl is basically an encyclopedia of geothermal, as you will soon see, and I have taken great advantage of that myself. So, it's your turn. Here's Carl. Carl, welcome. I shall. It's great to be here. All right. I want to start with you giving me a history lesson, as you have given me before. But walking through the history of geothermal power in the United States, in brief. Fantastic. So, humans have been using geothermal energy for many purposes for a long time. But, really, you see the origins of this power industry emerge in the United States in the 1960s, with the initial development being in the geysers field in Northern California. And it's really ushers in this early mover experimentation phase. You start ushering in this new phase of early geothermal developments, and they're really exploring for the first time the ability to use this resource to generate electricity. And it's fairly basic at the time. Just take the steam that's coming out of the ground, drive it through a steam turbine to generate electricity. And usually, they were evaporating it at that point. But we see it. Most of the United States growth actually happens in those first one to two decades. And for a while, it looks like geothermal is just going to take off. It's scaling faster than any other renewable at the time. And through the 1980s, we had gigawatts of capacity in the United States. But then, things kind of come to a halt. And you go through this period through the 90s and 2000s, where you really see almost no growth. And then another tip up in the late 2000s, early 2010s, and then it's been flat almost until just recently. And even that tip up in the late 2000s and early 2010s, how much did we build during that period? We added hundreds of megawatts, but they were really in some ways offsetting some of the losses that we saw in some of the early steam fields. And so in terms of total installed capacity, it's meaningful, but it's relatively minor, and not as much as we were hoping. I think a lot of people know this to be true of nuclear. We built a lot of it decades ago, and then we stopped building new stuff in the US. I think a lot of people don't appreciate that the same thing is true of geothermal, and actually, interestingly, on a roughly similar timeline, which I find kind of intriguing. Not exactly the same, but similar kind of story. So what happened? Why did it stall out? Well, I think there were a couple of things that happened in the early days. The early technologies could really only work with very high temperature steam. And so they were looking for exceptional locations in the Earth's crust, where this was 200 Celsius and often higher. And it turns out those were relatively rare. And the further down in temperature, you go the more abundant they become. But the other part of it is that we had so many failures in trying to drill into these resources, where there was a hot spring or geyser at the surface. They thought this was a no-brainer. And when they come in and started drilling those deeper wells, they would not find the resource they were expecting. And so this is what we call exploration risk, or dry hole risk in geothermal. And it led the industry to start having enough failures to scare capital investors to say, whoa, should we really be throwing more money after this? And this kicks off really a race, a lot of it funded by the Department of Energy, to solve the problem in one of two ways. We were either going to get better at finding these systems, so better exploration methods and data types, or we were going to avoid the exploration problem altogether by just engineering in place the things that we needed to make that system work. And so you see the beginnings of both the unconventional enhanced geothermal industry starting at that time, as well as the beginnings of some of the modern exploration methods. Before we talk about the process of exploration and development and so on, from a technical standpoint, what is happening there? What is going on when you have steam at the surface, what looks like it should be a perfect resource, and then you drill down, and it's a dry hole? What's actually going on under in the subsurface? Yeah, so at the geology or geothermal one-on-one level, everywhere on the planet is you go deeper. It gets hotter, usually, or at least in general. And in most places, that's, let's say, 25 Celsius per kilometer. So you'd have to go four or five kilometers or so to get to where you'd have steam temperatures. But in certain locations, that temperature is actually elevated, either because of magnetic or volcanic processes that may have brought heat closer to the surface, or in many places in the western United States, even in the absence of volcanism or magnetism, you can have fractures or permeable zones within the earth that will allow it to start convecting hot water from greater depth to closer to the surface. And hot springs are usually that kind of manifestation where there's hot water circulating, often in a convective nature, to bring that water to where you see it. What we've since learned in the decades since is that where you see hot springs at the surface, those are kind of the outliers. That's the tip of the iceberg. Most of these convective cells of hot water underground are not coming to the surface. And we now know that the majority of them are actually what we call blind. There's no hot spring, no volcano, and you wouldn't have even known they existed had you not, in most cases, drilled into them accidentally. And so with the Geyser's projects, for example, which by the way, is still producing power, some of them, right? It's amazing. It's a great resource. We just kind of got lucky in that case, was that just such a good resource? I guess what you're saying is that most of the good resources do not show at the surface, and many of the things that show at the surface are not actually good resources. Is it just that that first time around in the Geysers, it just happened to be the overlap? I think that's exactly right. And so the first pass, and this is true for almost all natural resource industries, the first pass is the low-hanging fruit. The really obvious stuff at the surface. There's copper, there's gold, there's steam, there's oil seeping out, let's drill there. And the Geysers was just one of those world-class resources. And there may be more of those around the globe yet to be developed, but at least here in the United States, it's unlikely that there's another gigawatt scale conventional geothermal resource to be discovered of that type. But there, you're right, there were Geysers at the surface fumaroles. In fact, the early explorers, a lot of them came from oil and gas. You had chevron, unical, phillips, hunt, and others that entered into the space in the late 70s and early 80s, and they actually spent hundreds of millions of dollars going out and drilling test holes, looking for more Geysers-like fields. And the Geysers was such a unique field in terms of its size and scale. They thought, oh, we just have to drill every few miles, and we'll see something like that if it's out there. And it turns out they didn't find anything like that in all of their searching. But in the process, they did find some of these other geothermal systems, some of which are now being turned into EGS fields, and some of which are being developed for conventional. I think they just underappreciated how narrow and small they could look at the surface and yet still have meaningful power potential of depth. Can you just give a little bit more detail on the difference between a conventional or hydrothermal field and an EGS field? What are you looking for in each? Yeah, in a conventional geothermal field, you need to find the temperature. So it needs to be hot enough to boil water or working fluid. You need to have porosity or permeability in the rock so that that fluid can circulate through, extract heat, you'll bring it out at the surface, then you'll re-inject it so it can circulate again. And you need water. So that working fluid that's going to sweep that heat through the system. And in the conventional field, all of those exist naturally. That's what we call a hydrothermal system. EGS was based on that early recognition that we drilled a lot of holes or wells that were hot but didn't necessarily have the water or the porosity and permeability to be able to circulate the water. And EGS was this hope that we could stimulate or engineer the rocks to have that permeability and maybe even add the water in some cases. And so this in many ways, I think, is analogous to what you see in oil and gas. The division between conventional oil and gas and unconventional is the ability to just drill a well and have what you need versus needing to modify the subsurface in some way. Okay. So the failing, the reason that the market stalled out, was we weren't great at exploration at the time. It turns out we sort of lucked into some great resources and in geysers and then couldn't replicate that success. And in the process of failing over and over again to replicate that success, it became harder and harder to finance new exploration. And then everybody kind of just fell out of love with geothermal. Now, obviously, we have these resurgence and as you said, it's coming in sort of two different categories. One is the, can we do better at finding the existing hydrothermal resources? And then the other is, can we engineer them via EGS? Let's talk about conventional hydrothermal development. Can you kind of walk me through what that like the actual steps in the exploration and then development process? And when you said they drilled a bunch of test wells, what is a test well? What does it cost? Like what is, you know, right? Yeah. So the first thing you're usually looking to confirm is temperature. You want to see that there's a resource here with enough heat in place to make a meaningful resource. And the standard tool of the industry is what's called the temperature gradient hole. And so you're literally going out and drilling a hole into the ground. Sometimes it's 100 feet, might be hundreds of feet or a thousand feet. And you're going to come back and measure the temperature gradient in there. And based on those gradients, estimate how much heat is in place and what might be at greater depths. One question I've always had about this, um, you ultimately, if you're finding a resource, you're going to be drilling deeper than 100 feet or 1000 feet. So it must be true that the temperature gradient that you find even pretty near the surface is highly correlated. It's like the temperature gradient is a spectrum that is consistent. And so you can infer from 100 foot depth well, what the temperature gradient, what the temperature expected would be at a kilometer or something like that. Is that right? I think directionally, it's right in that heat has a harder time hiding than other types of resources. Say like oil that might be underground. And so it is diffusing through the rock. But there are geologic processes that can obscure that or make it difficult to see. You might have a lot of cold water sweeping through from the climate or rainfall in an area that obscures the surface of it. And so there's large parts of Idaho, for example, where there are deep geothermal resources that you don't see at all in the first few 100 or even 1000s of feet because of that obscuring. But in drier areas, yes, you're right. You'll often see pretty distinct anomalous caps above these systems. Okay, so you drill this temperature gradient whole, and that's presumably pretty cheap to do. You're not drilling that deep and depth is the main cost of drilling. And you're not drilling, you're not putting casing or anything like that, you're basically just drilling a hole with a sensor measuring temperature gradient. So I assume that that is a lowest cost part of exploration, at least a physical lowest cost. In terms of the drilling to really confirm a resource, before that you will have deployed even lower costs, shallow and geophysical methods, to help you identify the areas that are worth drilling. But at this point, if you're drilling temperature gradient holes, you're deploying tens of thousands, maybe hundreds of thousands of dollars to test a certain target area. Catalyst is brought to you by ANSA. ANSA offers a one-of-a-kind data and analytics platform and advisory services to support better project development and procurement decisions. For energy storage developers, ANSA's platform provides crucial information that you never had easy access to before. Now at your fingertips is real-time pricing for a long list of system configurations to suit any project. ANSA provides a 360 degree view of the market with a life cycle cost analytics in commercial, technical and risk data. With ANSA, developers can easily determine which products to use in their designs, finance models and RFPs. Learn more about how ANSA helps save time and maximize profit at go.ansarunuables.com slash latitude. Catalyst is brought to you by Energy Hub. Energy Hub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. The Energy Hub platform takes the guesswork at a balancing energy supply and demand. It uses machine learning to control customer-owned distributed energy resources like EVs, home batteries and smart thermostats to precisely shape load profiles for grid flexibility and reliability. As the industry leader, Energy Hub helps more than 80 utilities manage 1.6 million devices. That's more than any other edge derms on the market. Click the link in the show notes to learn more or go to energyhub.com. You drill your first well, which is your temperature gradient hole. How easy is it? Is it binary? I assume it's not binary. What is the... So how much art versus science is there in the interpretation of that data? Is it easy to determine go no-go or do you have to do something sophisticated? In the early days, there was a lot of uncertainty. There really just weren't enough success cases or even failure cases to help them understand what some of these data types meant. They often use very high thresholds. If it's not boiling, I'm not interested. Increasingly over time, our experience has taught us, like you said before, that even a semi-anomalous or readings at a shallow level might indicate that it's worth drilling deeper. It's often an estimation of, given what I know now, is it worth investing additional capital to drill into that resource at greater depth, to gain greater confirmation. You can start with some probability distribution of possible outcomes. In the deeper you go, and the more capital you invest in the project, the tighter that distribution of outcomes becomes, and the higher your confidence is and what kind of resource you're working with. Okay. So let's say you drill your temperature gradient hole, you confirm you see what you're looking to see, and at least your interpretation is positive there. What's the next step? At that point, you're going to need to put together, if you haven't already, a pretty detailed conceptual model or understanding of what might be driving the system. Is it a volcanic system? Is it a sedimentary system? Is it a fault-hosted system? And that's going to give you a better predictive ability to go deeper into the resource, at least with classical methods here. And you're ultimately going to then want to say, okay, if I've proven temperature, now I need to prove permeability, or the ability to flow water through the wells that I would drill here. And so you're going to step up in size and complexity of your drilling program and drill slim wells, or small, you think of those mini production wells, that are going to be able to allow you to pull water out of the system. At which point you're flowing, like you leave that well open for a while and flow it, presumably. Is this when you're also able to start to determine what a decline curve would look like, or is this too early for that? It depends on how well you engineer, how large that well is, but the initial step is just showing that you can flow it at commercial scale. And then what you really want to do is be able to flow it long enough to run a flow test and indicate that over time it's not declining too fast, and that you'll be able to manage this resource sustainably. And like rough order of magnitude, what is the cost of one of these wells? And depth. Yeah, in this case, you're going to be going to a few thousand feet, maybe as much as five or six thousand feet. And your cost is going to be in the million plus range. So call it one to two million, maybe three or four, depending on the more complex wells to prove that out. So this is where you, I presume, like historically, when it became more difficult to finance, the cost of capital got higher and higher. This is the step where like real money starts to show up. I would assume. That's right. At this point though, you also have a little more confidence because of your earlier drilling and exploration. So your conversion rate is also a little bit higher. And so yes, you're putting more capital to work, but you're a little more confident it's going to be worth it. Those earlier stages, it is less capital, but you have to pursue more projects in parallel, which all sum up to also meaningful amounts of capital. But when we talk about dry hole risk and what happened historically and so on, is this the stage where the dry hole shows up? Basically, I mean, you might have gotten your temperature gradient, but then you drill down and you can't flow anything. Yeah, you would start seeing it here. And actually, in the early days, they would often skip that intermediate and what I was calling a slim well or more miniature well, and they would go straight to production well. We've got great temperatures, let's drill into this and they might drill the five, 10, 15 million dollar well, only to realize that there was no permeability or porosity in the rock. And we call that a dry well. So hot, but dry, no water coming through it. Okay, so next step. So you drill this well, you're able to flow, you confirm permeability and porosity, you've confirmed temperature. Are you de-risked at this point? Do you know what you've got? You're much further along the route of de-risking, but until you can also drill the injection well, which is going to be the way that you reinsert that water back into the system and let it circulate through the rock or through the ground network, you're not actually going to know that full decline rate to be able to build a robust reservoir model or estimate of the long-term potential of that resource. Can you describe what I know I brought up decline rate, but I realized we didn't describe what causes it. What causes the decline? Like, you could imagine a scenario where, look, it's hot underground, you just keep recirculating water and it should work infinitely. Why doesn't it? Yeah, so you are pulling heat out of the system, right? You're taking that to the surface, you're extracting it either through your turbines or through heat exchangers. And when you re-inject it, the water is going to be a little bit colder or quite a bit colder. And because of that, it needs to extract more heat from the rock before it returns to the production well. And you can think of these two wells. If your injection well is too far away, it actually might not ever return and you can start to draw down the pressure in the reservoir. If it's too close where it maintains good pressure in that reservoir, it might return too quickly. And you could think of that as then not having enough time to recharge in temperature. And part of the challenge was finding that optimal distance where it has enough time to fully recharge while also maintaining pressure in your system. Right. And then kind of moving ahead in the development process, I imagine that the other challenge related to that is, okay, so let's say you're successful, you drill your production well and your injection well, and it's working. Actually, give me context here. How much power might you generate out of a single pair? Let's see. So we recently actually drilled a new production well operating power plant in New Mexico. And that single well, the larger diameter well, going to about 8,000 feet depth, and it can produce about 15 megawatts net. So enough to power about 15,000 homes day and night. That's sizable. 50 megawatts is sizable. But ideally, probably you want projects that are multiples of that size or in order of magnitude bigger. That's right. In an ideal world. So in order to do that, now you're drilling another pair. And I presume if you're drilling another pair into that same reservoir, you're obviously extracting even more of the heat. And so I assume there is a fair amount of magic in the question of how close together can you put well pairs, first of all, and second of all, basically, how much can you extract from a given resource without accelerating the decline? Yeah. And this is an area of research and really just resource understanding that matured a lot over the past few decades as the industry was dealing with their existing resources and looking to expand or preserve them. And this is really where reservoir modeling becomes key. So there's certain data types like your flow and pressure information, but also we can put trace chemical tracers into the wells that will help identify how long it takes for them the water to return from injection to production. And based on these, we can build pretty robust models that are bankable in terms of the feasibility that they provide. And this is where you can start to estimate if I had two or three or four wells here, how much will that impact my decline versus just doing one or two in the same location? Okay. So this is the end. I mean, you drill the well pair. It works. You drill your however many additional well pairs you're going to drill. Now you've got a resource. What are you putting topside? We haven't talked about that yet. You get the heat out, but obviously heat is not the end of the story. Could be the end of the story, I suppose. Is anybody done just geothermal, like ground geothermal for, I guess, ground source heat pumps are this, but... And the most shallow ground source heat pumps. But in terms of direct use geothermal, there are a number of locations around the world that do use it in a direct way. In Europe, they're looking to repower many district heating systems by just bringing in hot water from underground. And even in the United States, the city of Boise, the city of Klamath Falls, they've been running district heating systems with geothermal where they're just directly taking that heat. At Zanskar, at our company, we're actually working with large mining companies now to also provide heat for industrial applications. And so I think there's a lot of exciting applications there, even before you convert to electricity. Okay. But let's assume you do want to produce power, which is what most of the projects end up doing. What is the topside infrastructure that you require? The topside, in many ways, looks like many other thermal plants. You're taking heat, you're generating steam, and that steam is going to drive a turbine, which then drives a generator and puts electricity onto the grid. In geothermal, especially in the western United States, oftentimes we're working with such a low temperature starting fluid that it's more efficient to put that heat into a working fluid, something that boils at a lower temperature. So think of isobutane or isopentane. And for that, we actually use heat exchangers. So most modern systems are going through heat exchanger. We call this binary. And then that working fluid on the other side goes through the turbine system. And you re-inject your fluid back into the ground. And that working fluid just cycles through the system. Okay. So I think we've reached the end of the development process. I'm curious about the timeline, both historically and maybe today. We're in an interesting moment now where there's plenty of demand for new power period, new sources of generation period. And then in some circles, particular demand for clean firm, which is what geothermal is. But everything is slow right now. It's hard to get anything fast. The fastest thing you can get maybe is renewables. But even that is gummed up by supply chain challenges and all sorts of tax credit issues and so on. But gas turbines are backordered for five years. Nuclear takes nuclear timeframes. What is the time frame of exploration and development for geothermal historically and how much opportunity is there to compress it? Historically, it was also a fairly long lead time type development. Historical projects took usually over five years and oftentimes as much as 10 years from start to COD. And major part of that is the slow decision making. As I mentioned, the incremental de-risking of a resource. We collect data, go back to the drawing board, decide if we're going to move forward. But another part of it was the permitting timelines is that a geothermal development project would have to go through five NEPA reviews if on federal lands. And the ability to accelerate a lot of that permitting is another area where we're seeing a lot of progress in the industry. Geothermal was recently given a categorical exclusion for the exploration activities of confirming and verifying a resource. And there's potentially still permitting reform ahead for the construction stage of the project. If you just take it down to the bare bones of you need about one to two years to explore and confirm the resource, and about one and a half to two years to construct that power facility and tie it into the grid. So the ideal scenario would be three to four years is realistic. And we're now seeing that as a possibility in certain locations in certain states where the regulatory frameworks are clear enough. And an example, not necessarily the Greenfield build, but of at least being able to come in and do meaningful work in a short period of time is work that we did recently in New Mexico. So we acquired in May of last year the Lightning Doc geothermal field, which is a field that had in many ways I think been seen to have underperformed and was no longer believed that it had much upside left in it. We based on data sets that we had and the models that we had really came to a conviction that there was a lot more there to give. And so shortly after acquisition, we permitted engineered, designed, and constructed a new production well to a zone that was four times deeper than the prior production zone. We built new pipelines, the electrical, installed the new line shaft pumps, and we were able to tie that into the grid in less than 12 months from acquisition. So in certain locations, we can actually move pretty quickly. And in our Greenfield projects, we have several that are in areas where we believe four years is a realistic timeline to bring those projects online. So you mentioned locations. I mean, that's the last thing that I want to talk about, I guess, with you, which is, talk to me a little bit about the history. I mean, we talked about geysers and geysers in California, but actually most of the geothermal that has been developed historically is not in California so much as Nevada and places like that. What's your view on how much geographic expansion should we be expecting for this next wave of geothermal development? How wide is the geographic aperture that people are looking at? Yeah, I think in terms of right now, the technologies that work today and that are on the precipice of commercial scale up in just the next few years, which is really conventional hydrothermal and EGS, we really think you're still going to be limited to tectonically active areas or areas with higher heat flow. And that's about a third of most continental land masses. So think the Western Third of the United States and many other tectonically active areas around the globe. And the main reason for that is because even with EGS or with conventional, you're still drilling as a primary cost driver. And if you can find that heat closer to the surface, it's going to have meaningful impact on economics. As drilling costs come down or as demand for clean firm power continues to increase, we see the economic shifting to where you could start to justify new build geothermal using some of these new methods and even more unconventional locations. We think that timeline could be on the order of decades though. Can you give me an order of magnitude of how much power we might... Well, let's say we stay in the Western Third of the United States. What's the total resource size that we expect? When you look at the full stack of kind of near-term EGS and conventional, we really are talking about hundreds of gigawatts to terawatts of resource potential. That to me is super exciting in terms of the United States' unique resource potential because you can think of this as a resource that has as much potential to give as say the entire Gulf of Mexico from an oil point of view. This is a real national treasure. And even just focusing on the conventional geothermal resources that I mentioned before, which is where a lot of our near-term work has gone, there are tens of gigawatts. And by some estimates, 100 gigawatts or more of that, which can have a meaningful dent right away without any first-of-a-kind technology risk. And so in terms of adding low-cost firm renewable energy in the next five to 10 years, we really think there's a chance to add more with geothermal than any other competitive form. All right, Carl, always appreciate you schooling me on geothermal. Thank you so much for joining. Thank you, Shale. Great to be here. Carl Hoyleand is the co-founder and CEO of Zanzcar. This shows a production of latitude media. You can head over to latitudemedia.com for links to today's topics. Latitude is supported by Prelude Ventures. Prelude Bex Visionaries accelerating climate innovation that will reshape the global economy for the betterment of people and planet. Learn more at PreludeVentures.com. This episode was produced by Daniel Waldorf, mixing and theme song by Sean Markwand. Stephen Lacey is our executive editor. I'm Shale Khan, and this is Catalyst.",
    "release_date": "2025-05-29",
    "duration_ms": 1981000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI1880502245.mp3?updated=1748466184",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-06-05T01:45:59.456957"
  },
  {
    "title": "What to make of Trump's deep-sea minerals push",
    "description": "In April, the Trump administration issued an executive order to accelerate the development of deep-sea minerals — part of its broader push for “energy dominance.” The world’s oceans hold vast, untapped deposits of critical minerals like nickel, copper, manganese, and rare earth elements — all essential to batteries and clean energy technologies.\n\nDespite decades of interest, no commercial deep-sea mining project has begun production. The reasons? Regulatory uncertainty, environmental concerns, and the complexity of processing polymetallic nodules.\n\nSo what does this new executive order actually do?\n\nIn this episode, Shayle talks to Hans Smith, president and CEO of Ocean Minerals, a company participating in exploration of the Cook Islands. Shayle and Hans cover topics like:\n\n\n  \nWhat the Trump executive order mandates — and its legal limits\n\n\n\n  \nThe bottleneck of U.S. deep-sea exploration \n\n\n\n  \nThe controversy about U.S. legal authority over international waters\n\n\n\n  \nThe economics and geopolitics of deep-sea hotspots like the Clarion-Clipperton Zone, Japan, and the Cook Islands\n\n\n\n  \nThe technical challenges of refining polymetallic nodules\n\n\n\n  \nCapEx, OpEx, and barriers to commercial deployment\n\n\n\n\nResources:\n\n\n  \nCatalyst: Mining the deep sea\n\n\n\n  \nWorld Resources Institute: What We Know About Deep-Sea Mining — and What We Don’t\n\n\n\n  \nReuters: Trump signs executive order boosting deep-sea mining industry\n\n\n\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.\n\nCatalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, and increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data plus tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.\n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "Latitude Media is hosting its fourth Transition AI conference in 2025, focusing on energy infrastructure in the AI-driven load growth era. The event will gather industry leaders, including companies like FERVO Energy and Google, to discuss meeting data center demand creatively. The podcast also explores deep-sea mining, with a focus on the recent Trump executive order supporting deep-sea mining exploration in US waters and beyond. Challenges such as regulatory regimes and technology requirements are discussed, along with the potential impact on the industry. The Cook Islands and Japan are highlighted as leaders in deep-sea mining exploration, with progress in regulatory frameworks and licensing.",
    "transcript": " Mark your calendar for June 12, 2025. Latitude Media is holding its fourth transition AI conference in Boston. This year's theme, energy infrastructure in the era of AI-driven load growth. We're going to bring together investors, developers, researchers, and tech companies to talk about the creative ways to meet data center demand. And companies include FERVO Energy, Form Energy, Scale Microgrids, Spark Fund, KKR, Generate Capital, Orenia, FlexGen, National Grid Partners, and more. Plus, we're going to have a live open circuit episode featuring Caroline Golan from Google, and a live green blueprint episode featuring Rick Needham from Commonwealth Fusion Systems. Get your ticket at latitudemedia.com slash events, podcast listeners, get 10% off their ticket, use the code latitudepods10 at checkout latitudemedia.com slash events. We will see you at transition AI. Latitude Media, covering the new frontiers of the energy transition. I'm Shane O'Con and this is Catalyst. You know, there's this perception that the EOS been signed and this is a, you know, it's like flipping a light switch. All of a sudden it's going to go from nothing to everything. What this action has done is that it's taken DSM and put it into the spotlight. Coming up, going deep underwater for energy dominance. Do you want instant access to energy storage supplier pricing that's project specific? Or the ability to compare domestically made battery and PCS options across the market? Anza now offers the industry's first battery energy storage data and analytics platform to make better development and procurement decisions. Anza provides in-depth commercial, technical and risk data and analytics to help developers choose the best equipment for any project. Improve your returns and save months of evaluation time with Anza. Learn more about Anza's energy storage subscriptions at go.anzarenewables.com slash latitude or click the link in the show notes. Imagine a world where connected devices like EVs, home batteries and smart thermostats work together to support a more efficient and reliable power grid. Well, you don't have to imagine it anymore. This vision is a reality today, thanks to Energy Hub. With Energy Hub's Edge Derm's platform, utilities can create virtual power plants through customer-centric flexibility programs, making it easy to manage distributed energy resources and balance the grid. Unlock grid flexibility and reliability through cross-DER management with Energy Hub, the trusted Edge Derm's leader. Visit energyhub.com to learn more. I'm Shale Khan. I lead the Frontier Strategy at Energy Impact Partners. Welcome. All right, so it's been a couple of years, I think, since we talked about deep sea mining here. So here's a quick reminder of why it's interesting. At the bottom of the ocean, in certain places, there appears to be an enormous volume of these golf ball-sized rocks. They are polymetallic nodules, and they appear to be basically a rock full of battery minerals, essentially. I think nickel, cobalt, a lot of manganese, and copper. And in some cases rare earths as well. And there are literally trillions of dollars worth of these rocks just waiting to be hovered up and used to displace terrestrial mining. But for at least four things, one is a regulatory regime that doesn't fully exist yet for exploitation of deep sea mining, at least in some locations. Second is a heated battle over the environmental impacts of extraction. Third is the actual CAPEX technology and resources it's going to take to do it. This is mining, it's not cheap. And fourth is what you do with it once you get it, i.e. refining. Anyway, one thing that wasn't on my bingo card when we talked about this a couple years ago was that President Trump, in his second term focus on energy dominance, would find his way to deep sea mining and issue an executive order intended to speed up the market, at least for the United States. So for this one, I brought on Hans Smit, who is the president and CEO of Ocean Minerals, one of the companies that is exploring for deep sea minerals in the Cook Islands currently. Here's Hans. Hans, welcome. Thank you. Let's start by talking about this Trump executive order on deep sea mining that came out a few weeks ago. Now, maybe start by just explaining what's in it. Well, I think the key important thing about the EO is the fact that the US has now publicly come out and said that it supports looking into deep sea mining and has directed the US government to take positive and proactive action to help get this off the ground. I think that's the big thing that that executive order is done. And I think the other important thing about the executive order is that it has stipulated that it's not just US territorial waters. This is international waters as well as other exclusive zones. So what Trump has come out and said is, let's look at deep sea mining as part of the solution, but let's not just focus on US areas. Let's look at all projects and see how we can use them to solve this problem we have with critical metals. Which has become a bit of a point of contention, the part about operating outside of US exclusive economic zones. Maybe that's a good opportunity to step back for a second. Can you walk through the different regions where there is deep sea mining exploration or potential production to be had and where the authority and control over them sets? Yeah, essentially the two areas. You have the exclusive economic zone, which is the territorial waters of any country. So it's that country sovereign waters and the country's sovereign right to do whatever they decide to do within that region. And then we have what is known as beyond national boundaries, which is international waters. So those are all the areas outside of the exclusive economic zones. And the key difference between the two is during in an exclusive economic zone. It's the work that anybody does is subject to the rules and the law of that country. When you go into international waters back in 1984, uncloss, which is the United Nations law of the sea was ratified. And that is now under the auspices of the United Nations. And I think there are about 136 countries that have signed up to it. However, the US has not signed up. They have not ratified that. And in the international waters, it has been deemed since the signing of uncloss that that would be regulated by the United Nations and specifically the ISA, which is the international sea bit authority. And so that's where a lot of the, you could tell me if I'm wrong on this, but a lot of the early activity in deep sea mining world has been in international waters, particularly in this area called the Clerian Clipperton Zone. Is that because the understanding is that the resource is especially attractive there? Is that just because international waters, ISA regulation has been attractive to go after? Yeah, look, I think it's been done there because countries wanted to be sure that they didn't not mess up. So in a sense, there was a fear of missing out. So when that got ratified, all the major nations throughout the world made sure that they staked their claim. And they were participating in what was being released under the ISA. What happened when you stake your claim and you now take responsibility for that area, the onus is on you to execute a certain amount of work on that area. You cannot just sit and squat in the land. You need to show that you make in progress. So I think that was why there was a lot of work done in the Clerian Clipperton Zone. Also, a lot of that work was funded by governments. So there was a source of funding that was available to make sure that that work happened. And that work has been invaluable. You know, since 1984, there's been a lot of exploration work there. There's been a lot of money spent there. The European Union has spent a lot of money developing technology and equipment, so have the Chinese. So I think in general, it has been incredibly positive and incredibly useful for underwater mining specifically in that region. And giving us a good understanding and serving as a great foundation for developing guidelines and procedures and methods for doing this type of thing. Okay. So back to the EO. The EO pertains both to the US exclusive economic zone where there had been very little activity prior to this, as I understand it. So I'm curious what you think this might actually result in. But then is it essentially saying beyond US exclusive economic zone, this is the Trump administration saying we are interested in deep sea mining exploration and production. And we have not signed on to the treaty that would make us a part of the international seabed authority. And so we're sort of competing with the rest of the world for those resources. Is that the right way to think about it? I think there are two parts to that question. Firstly, the EO says exclusive economic zones are not only of the US, but in any country. There are other countries, Japan, Cook Islands, Papua New Guinea, who currently are actively working in their exclusive economic zones developing these resources. In the US, there hasn't been very much, if any, work in the exclusive economic zone of the US. But that is due to a regulatory issue rather than anything else. And then with the EO saying in international waters as well, this is where things start becoming a little more vague and a little more challenging. As you would note in the press, since that has been announced and the metals company have indicated that they want to use the EO and apply for licenses through the US laws to mine in international waters, there's been some surprise and there's also been some resistance to that. And I think this is something for the lawyers to get into and figure out how the metals company and the US with the EO are going to go and work in international waters without taking into consideration the precedent and the regulatory authority of the international seabed authority. So I think there's still a lot of stuff to be worked through and a lot of issues to be resolved in international waters. But in exclusive economic zones, it's pretty clear. They are laws in the US that allow companies to go and apply for expirational mining licenses. However, the current structure of the legal framework in the US is not very encouraging. So we as a company, for example, are not inclined to explore in US territorial waters because our investors are not given the kind of assurances and rights that we would get in other areas that would allow us to get a return on an investment if we were to spend tens of millions of dollars. So that raises this obvious question, which is, is this EO, we don't have to talk exclusively about the US because it is where the minority of activity is going. But just because there is this recent EO, is it going to do anything? Are there other factors that are stopping the US from doing serious exploration for deep sea mining that this doesn't change? And so as a result, it's just going to be sort of a piece of paper. I don't think it's going to be a piece of paper. I think the EO has got incredible value and has got incredible merit. But I don't think it's necessarily going to be the solver bullet that certain people think it's going to be. There's this perception that the EO has been signed and this is a, it's like flipping a light switch. All of a sudden it's going to go from nothing to everything. It's very rare that that is the occurrence of this type of action. What this action has done is that it's taken DSM and put it into the spotlight. It has brought the world's attention to a nascent industry that up until the EO has been in existence, but it's kind of been on the sidelines, been in the shadows, so to say. And this has really brought it into the, you know, into focus. And that has been, you know, very clear from my side, for example, over the past three weeks, once the EO had been, you know, been published and people had time to work through it, I've been getting a lot of people phoning, wanting to speak about DSM, wanting to better understand what's going on, wanting to see what the prospects are, wanting to understand, you know, what is the real story? Because everything that they've seen prior to this has been predominantly dominated by the anti-contingent who have been out trying to get moratorium in place. And what this has done has brought this sort of mainstream media and the mainstream interest into DSM. And that for me is a big, big step in the right direction. And it's also a great opportunity to create visibility, because the issue we've had has been a lack of visibility, a lack of understanding and a lack of context. And the EO certainly does address that. So I think it's valuable in that perspective. Catalyst is brought to you by ANSA. ANSA offers a one-of-a-kind data and analytics platform and advisory services to support better project development and procurement decisions. For energy storage developers, ANSA's platform provides crucial information that you never had easy access to before. Now at your fingertips is real-time pricing for a long list of system configurations to suit any project. ANSA provides a 360-degree view of the market with lifecycle cost analytics and commercial technical and risk data. With ANSA, developers can easily determine which products to use in their designs, finance models and RFPs. Learn more about how ANSA helps save time and maximize profit at go.anzerannuables.com slash latitude. Catalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. The EnergyHub platform takes the guesswork at a balancing energy supply and demand. It uses machine learning to control customer-owned distributed energy resources, like EVs, home batteries and smart thermostats to precisely shape load profiles for grid flexibility and reliability. As the industry leader, EnergyHub helps more than 80 utilities manage 1.6 million devices. That's more than any other edge derms on the market. Click the link in the show notes to learn more or go to energyhub.com. Okay, so before we move on from the US to talking about what's going on in the rest of the world, apart from sort of a less than ideal regulatory environment, are there other things that are going to be bottlenecks in the evolution of deep-sea mining within the United States? I mean, are we going to see significant exploration activity during the Trump administration before new administration takes hold and could make a bunch of changes if they so desired? Well, I think the key bottleneck with the US exclusive economic zone is the manner in which the US approaches mineral resource development. They've modeled the deep-sea mining of minerals and minerals in the ocean on the oil and gas model where the exploration work and a lot of the geophysical work that is that underpins this is done by the US government. And then based on that interpretation, they determine areas of interest that they put out on public lease for companies to bid and tender on. Now, the issue is with the deep-sea mineral space, is that means the likes of Boem and Noah have to go and do all of this work throughout this massive body of water. And they need to determine where exactly these mineral deposits are. Pull all the information together that would make it attractive for a company like us to bid on a lease. And the issue that you have is this is going to take multiple years of just exploration, sending ships out there and covering tens of thousands of square kilometers of the ocean. And I think this is going to be the problem. Noah's boats are already booked out for the next two to three years, possibly even the next four years. So before you can repurpose those vessels to specifically go and address this task, you have these jobs that they need to do, or you have to go and sacrifice those jobs and refocus them on this. And I think neither one of those is a great idea. What I would suggest is that the US take a leaf out of what everybody else is doing, where what they do is they put the onus on the person wanting to develop the resource. So if I use the example of the Cook Islands, for example, the government there has said to exploration companies, we will give you an exploration license that will give you exclusivity over that area for you to do your exploration. If you find resources within that area, you then have first right of refusal to apply for a mining license over it. So now I have done a couple of things. One is I've put the onus on companies that specialize in finding minerals to go and do the research and the exploration work in order to find them. And in return for that, what they are going to get is the right of first refusal to commercialize that. So the money that they invest, they get paid back through the project becoming commercial. And the benefit of that is you have people that specialize in this driving the process of doing it. So I think there's an interesting challenge that the US faces at the moment. If they want to follow through and deliver on the EO, I think there is a need for some significant changes that need to be done with regards to how they doing it at the moment. And if that is too big of a challenge, just change the contracting model. Don't rely on NOAA and BOEM to do it. In addition to that, look at some way of privatizing that exploration and giving people that specialize in it to help those agencies get to the point where commercialization of the resource in US territorial waters becomes a reality. Okay, you mentioned the Cook Islands. So moving on from the US, my sense is that the Cook Islands is furthest along here. Is that in terms of general exploration and moving toward actual deep sea mining? Do you agree with that, as anywhere else that you would put on the same levels of the Cook Islands? No, I think that would be a reasonably accurate statement. I think the country that is coming up close second to that would be Japan. Japan last year announced a fairly significant nodule field in their territorial waters and they are now moving forward with that development and that program under the guidance of the University of Tokyo. I think the Cook Islands are ahead of Japan in the fact that the Cook Islands have the regulatory frameworks in place to go from prospecting exploration and exploitation with a great environmental requirement and plan in place to make sure that there's no significant harm as a result of that. The Japanese still need to place some catch up there. So I would say between Japanese territorial waters Cook Islands, they certainly are as far as polymetallic nodules are concerned, certainly leading the way as far as deep sea minerals are concerned. Okay, so what is the latest in the Cook Islands? Who has got licenses to do what? How far along are they just orient me in terms of given the Cook Islands as the leader? Where are we? Yeah, so the Cook Islands back in 2022 awarded three exploration licenses to three different companies. So the first company is a company called Mahana Minerals, which is owned and operated by a US-based company called Ocean Minerals. You have CIC is the second license holder and then the third license holder is a joint venture between a Belgian company and the Cook Islands Investment Corporation, which is a government company that is focused on developing businesses within the Cook Islands. So those three companies have been awarded exploration licenses. Those licenses are five years in duration and the companies are currently in year four. And the intention and the plan of these organizations and Mahana Minerals is the company that I work for. The intention is in the next two years or so to apply for our mining licenses. So we are currently all embarked on the environmental data campaigns, collecting all the information so we can make the case for minimal environmental impact. But we also have our mining systems developed in our case and as well as the processing of the modules. So putting it a different way, we probably two to four years away from first production is where we are in the Cooks. You mentioned environmental data collection and trying to minimize environmental impact. Obviously that's been an area of contention historically, as you mentioned, with activists pushing for a moratorium and so on. From your perspective, is there a technical, is there a technological challenge in how do we actually extract resources while minimizing environmental footprint or is the technology known and proven already today? And it's just a matter of implementing it. The technology is known and proven and it has been proven and incidentally, the first time it was proven was back in the 1970s. So the tech for this has been around for multiple decades. As far as the environmental side is concerned, that's where the ISA comes into the picture. The work that the ISA has done over the past 20, 30, 40 years has been massive because it's really helped us focus on the specific areas where the impact would be and the technologies have obviously been modernized and updated to further reduce those impacts. So I think as a whole, the technology is there, how we apply it is well understood. What we are doing is establishing all the baseline data. To give you an idea, when you build a home, one of the things you have to do is look at the environmental impact of building your home. But the benefit you have is all the environmental data that exists. So you are very easily and quickly able to look at what the impacts of building your home would have. In the deep ocean where we are operating, we don't have that baseline data. And that is why we spend three, four years collecting that baseline data so that when we make the statements in our environmental impact statement, talking about what the impacts would look like, we are doing it from a data source and an unknown reference. And this is a process that will continue going on way beyond commencing of this operation. We have this plan called adaptive management, where we continually update the data we're collecting and how the systems operate and we keep refining and improving. The other technological question that I've heard that I think is kind of interesting is not about extraction so much as it is about refining. You mentioned you might be two to four years out and you and a couple others, two to four years out from production. So I understand that the challenge here is, okay, you get these polymetallic nodules, you extract them from the ocean floor, they contain a mixture of valuable minerals. They contain nickel and cobalt and copper and manganese. And our existing mineral refining, which we do from terrestrial mining, is not really set up for that because we don't have these polymetallic nodules in the same way on the ground or under the ground rather. And so what we have right now is a big refining industry set up to basically extract a single mineral, generally speaking. So does this mean that you are going to end up having to or having to find somebody set up some new refining infrastructure? Is that new technology? What does that look like downstream of extraction? So I think there are a couple of things to unpack. I think the first one is that we've recently started hearing a lot of noise about the processing technology doesn't exist. And that's an interesting shift in the arguments against why DSM should not go ahead. Because the reality is quite different. Yes, we have a polymetallic resource. So we have, as you mentioned, nickel, copper, cobalt, manganese, and in the case of the Cook Islands nodules, ray earths as well, which is another thing everybody's hot about. But the only part that we've had to crack and unlock is not the separation or the refining, because the separation or refining that exists with all these other mining industries is exactly the same technology that we're going to use to pull out those specific metals out of the nodules. So it's actually a benefit for us that all this knowledge and technology exists for selecting all those different metals. What is different for us is two things. The first one is the nodule is in the form of a golf ball size rock. And what we have to do is we have to get all those metals into, we refer to it as into solution. The best way to explain it is if you take table salt and you pour it into water and you dissolve it, it goes from sodium chloride, which is salt, and when you dissolve it, it becomes sodium ions and chloride ions in water. We do exactly the same thing, but instead of using water, we use acid. And what we do is we crush the nodules and we use acid and we dissolve all the metals. Now all the metals are floating around in this liquid and we apply all those existing technologies to strip them out. The only difference is we need to figure out in what sequence to pull them out to get the best results. You need basically a train of existing technologies. If it's a nickel mine or a nickel refining operation, you're just trying to pull out the nickel, you're going to do that, but then you also have to pull out the manganese and the copper and the cobalt. Now what that does is it starts creating some interesting possibilities for us. So nickel mines and copper mines are nickel cobalt or copper cobalt, so they bring up both those products. So one of the things we can do is create a nickel cobalt or a nickel copper cobalt hydroxide and we can send it to one of those existing facilities and they can pull them out. Or as you said, what we do is we build our own facility, but instead of having to invent a new process, we build an existing facility and we go to these different industries and we just go and take that building block that they've used and we put it into our plant. And this is all chemistry. So what you're talking about is big tanks with pumps and circulatory circuits and what you do is you either use electrolysis or you use chemistry to cause the metals to sink or to float and it's easy to separate them out or you just have them precipitate. In other words, you dry them out. So there's nothing unique, strange or different about what we're doing. It's just again like we did with the mining system, we're using different technologies that exist and we are just putting them together in a different sequence. And yes, we'll have to build a new processing facility, but that is no different to any mine. If you go to any mine on land, the processing facility is going to be built in order to meet the uniqueness of the chemistry of that particular mine. So every process plant that you go to is normally tied to some mine or some supply and there's uniqueness to it. It doesn't make us any different. If not a technical question, it is certainly a capital question. So maybe, I guess, final topic for us is to talk about capital formation here and not just for refining, but also for extraction. Or even on capex or an opx, I suppose, just on the extraction portion relative to a terrestrial mine, what should we be thinking about? Well, I think the first misperception that we hear often is that it can't make money because it's complicated and very expensive. And I think there are two parts that the complicated and expensive is all relative because at the end of the day, profitability of a mine is the difference between operating costs and revenue. And in our case, yes, we have got these ships that are going to see and they are operating in the ocean. And it is deemed to be expensive because we're working at great depths. However, we don't have all the big capital costs of infrastructure, power lines, roads, rails, dams, et cetera, which means the cost of capital for us is going to be lower. We are going to spend less money building a ship to go mining there, what you will do, perhaps building a brand new infrastructure in some outback area. So that's one aspect of it. The other thing to consider is that we are bringing up one ton of material. And in that one ton of material, we are producing the same amount of metal as you would need to have anywhere between three and five land-based mines. So for them to get the same amount of metal that we're getting because of our high grade and the fact that they multi-metal, you could end up moving anywhere between four and eight times the tonnage of raw rock to get the same metal. So those are the aspects that people don't understand because they haven't looked into the specifics. So when it comes to economics, we're moving less tonnage, we're getting more metal. The revenue we get in per ton is much higher, even though our up-ex cost per ton may be higher than dump trucks running with front-end loaders. But the revenue is certainly there that's offsetting that. It's like an up-ex cap-ex trade-off and you get a higher value product per unit volume or per unit weight. Absolutely. Yeah. At the end of the day, there are two things you need to look at. You need to look at what is the return on your investment. So for in our case, the mining system cap-ex is around $500 million. The processing plant, probably around $2 billion. But what for that investment do you get in return for your project? So our project is in anywhere between three and four billion dollar project that's going to yield in the region of $500 million of free cash flow per year. Put that in front of any land-based miner and they'll be falling over you to fund that project with IRRs in the 30s, 40%. This project, when you look at the economics and what it yields is a no-brainer. What we just have is the stigma around underwater in the ocean and a lot of the misinformation that has been put around it. I would really love to get into a situation where people just park their motions and look at it purely on merit from an environmental impact perspective, from a cost perspective, from just an overall impact of this generally. And just look at what we are going to get from it. I think they'll be pleasantly surprised. We talk about that free cash flow number. There's obviously an assumption embedded in there as to the price you can get for the minerals that you're extracting. I think one of the things that's interesting that here is that because you're polymetallic, rather than being subject to a single volatile commodity, you've at least got multiple. You could imagine prices for manganese spiking and nickel crashing at the same time and you end up in a wash or something like that. It's beneficial in that context. But obviously, particularly with nickel, we've seen prices low recently relative to history. How do you think about the volatility of those commodities? Obviously copper probably being the least volatile, but also probably a small portion of the value stack I would expect for a given polymetallic nodule. What matters, which minerals matter the most and how do you think about price volatility? One of the things we do for our investors is obviously a sensitivity analysis. One of the interesting things we are able to show is that with the recent crash of the cobalt price and nickel for all sorts of reasons, and that's the topic for a whole different discussion. But particularly those two metals with the depression on their prices, our project remains profitable. The reason it's profitable because of the manganese is by far the biggest component to what we're doing. The manganese market is so massive that it has a certain amount of robustness just due to its sheer volume and size. The other thing we hear from people is, are we going to come into production and we're going to have a negative impact on the market because of the volumes we bring to the market? That's not going to happen with the manganese market either. What we have is manganese is a great stabilizer and it allows us to be able to ride through the fluctuations we see in the nickel and cobalt prices. But at the recent low prices, the project has remained profitable. At the prices we're projecting at the time that we go into production, obviously it makes it really interesting as to the kind of returns that this project can yield. Thank you so much for the time. This is super interesting. I'll catch you in two to four years when you're pulling up commercial volumes. Look forward to it. Thanks very much. On the smit is the president and CEO of Ocean Minerals, one of the companies that is working on an exploration license in the Cook Islands. This shows a production of latitude media. You can head over to latitudemedia.com for links to today's topics. Latitude is supported by Prelude Ventures, Prelude Bex Visionaries accelerating climate innovation that will reshape the global economy for the betterment of people and planet. Learn more at PreludeVentures.com. This episode is produced by Daniel Waldorf. Mixing and theme song by Sean Markwan, Stephen Lacey is our executive editor. I'm Shale Khan and this is Catalyst.",
    "release_date": "2025-05-22",
    "duration_ms": 2224000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI3479416220.mp3?updated=1747884584",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-06-05T01:49:50.783699"
  },
  {
    "title": "A former race car engineer on battery safety and supply chains [partner content]",
    "description": "From his days as an IndyCar race engineer to his current role as chief product officer for a leading storage integrator, Tristan Doherty has always worked at the intersection of high performance and risk management. \n\nToday, he's applying that expertise at LG Energy Solution Vertech to build more resilient, domestically manufactured energy storage systems for America's evolving grid.\n\nLG Energy Solution Vertech is the US energy storage division of LG Energy Solution, which has committed $1.4 billion to manufacture batteries in the U.S., creating a hub capable of producing 16.5 gigawatt-hours of energy storage cells annually. This investment is part of the company's long-term strategy to diversify supply chains.\n\n\"We're on schedule for early next year to be a hundred percent non-Chinese in terms of all of the components and sub-components going into those ESS cells,” says Doherty.\n\nThis manufacturing strategy is critical in a moment of trade uncertainty. While LG Energy Solution's substantial resources allow it to weather these challenges, smaller players in the supply chain face greater difficulties. \"We're seeing projects that are being paused, that are being delayed. We're seeing suppliers that are rethinking their strategy...the goalposts are continually shifting.\"\n\nBeyond manufacturing, LG Energy Solution has transformed its approach to system integration. Rather than simply connecting batteries to the grid, the company now designs comprehensive power solutions with grid needs as the starting point. Doherty describes this as \"flipping the script\" from an inside-out to an outside-in approach.\n\n\"The direction of design decisions and the direction of design intent has kind of flipped 180 degrees,\" he explains. \"It's creating much more effective and much more powerful designs.\"\n\nThis evolution in design philosophy extends to safety considerations as well. Following incidents like the Moss Landing fire, the industry has increasingly shifted toward containerized solutions that compartmentalize risk. According to Doherty, this approach, combined with other innovations, has contributed to a 97% reduction in energy storage system failure rates.\n\nAs unprecedented demand growth from data centers, electrification, and manufacturing transforms the grid landscape, Doherty sees energy storage playing a central role. \n\n\"We've made immense strides and we've figured out a whole lot of really interesting and fascinating ways of using batteries. But I think there's a whole bunch more to come.\"\n\nThis episode was produced in partnership with LG Energy Solution Vertech. LG Energy Solution Vertech is the U.S. energy storage division of LG Energy Solution, here to be your lifetime energy storage partner. Learn more about the company's approach to safety, performance, and its commitment to the U.S. market.",
    "summary": "Tristan Doherty transitioned from computer engineering to mechanical engineering with a passion for robotics. His journey led him to become a race engineer in IndyCar, making split-second decisions under high pressure. Now the Chief Product Officer at LG Energy Solution Vertec, Tristan focuses on safety in battery storage plants. The discussion delves into the Moss Landing Battery Fire incident, emphasizing the industry's shift towards containerized storage solutions for improved safety. Tristan highlights innovations in cell-level safety, system design, and software advancements, stressing the importance of quality and adherence to codes and standards. LGES's strategic investments in US manufacturing aim to localize production and diversify supply chains, navigating challenges posed by trade uncertainties. The conversation also explores the evolution of integration strategies in energy storage projects, emphasizing the shift from inside-out to outside-in design approaches for more effective and powerful solutions.",
    "transcript": " This is a branded podcast from Latitude Studios. In the late 1990s, in the middle of the dot-com boom, Tristan Doherty thought he wanted to be a computer engineer. I got about halfway through my undergrad and I decided I didn't want to make little black boxes with blinky lights on them. I thought that was probably not very exciting. So I moved into mechanical engineering and I wanted to make robotics. I wanted to do stuff where I took control systems and impacted the real physical world. Tristan pursued projects that were far more interesting than boxes with blinky lights. He was on a university team that designed a formula-style race car. He designed interactive art that integrated technology. And at the end of school, he faced a question that lots of people grapple with. And I sort of had to make a decision at the end of that and I said, well, what's my true calling? Where am I being pulled? And at that point, I was being pulled back into car racing. Tristan went all in on racing. He started as a data acquisition engineer who analyzed tens of thousands of data points coming from a race. And he eventually became a race engineer for an IndyCar team who called the shots on the setup of the car. And ultimately, it's me on the radio saying pit pit pit and a lot of stress, a lot of pressure, but very rewarding. Car racing is a very high-stakes sport. It requires a team of engineers like Tristan to analyze data and make real-time decisions about how to operate the car. And as he told Stephen Lacey, once small mistake can be catastrophic. So it was really sort of a fascinating culmination of a lot of different areas that came together. In racing, you have this huge, obviously, technology piece of it. You have a big sports piece of it. You have a logistics piece where you have to make it to race day. And layered on top of that is the sort of psychology aspect of dealing with a driver and dealing with the teams. Were there any harrowing moments? What kind of problems were you having to overcome? Oh, there's a lot of problems in racing. There's a lot of chaos. I remember vividly once in Australia, we were doing the morning warm-up on Sunday morning. It was sort of a 9 AM warm-up or something for an 11 AM race. And these are usually really low stress. You just go out, you do a couple laps, make sure everything's okay. And we come back from the warm-up and the engine had failed and the engine needed to be replaced. And it was an impressive orchestra of chaos that brought the entire team together, everyone from the team owner down to the new mechanic who just joined a couple of weeks before that was just madly trying to get this engine fixed. And everyone is just sort of grabbing parts of what's needed here and there and just trying to really, you know, single-mindedly that one mission that the entire team was 100% focused on. It's a little cliché maybe to bring that back to sort of climate and back to the energy transition. But I think that a lot of people in the industry have that similar sort of really sort of single-minded of what we had ahead of us and what we really need to accomplish. Today, Tristan is the chief product officer at LG Energy Solution Vertec, the vertically integrated US storage arm of LG Energy Solution. The company executes large-scale storage projects from cell manufacturing through system integration, O&M and warranties. We have to really deeply understand the technology and we have to understand the business. And hopefully when we solve everyone's problems, we find success. Tristan, who's no stranger to things going wrong from his racing days, is also focused on improving the safety of battery storage plants. Now let's get to developing news out of Monterey County, a fire burning at one of the world's largest lithium battery storage facilities. And it continues to burn more than 24 hours after it started. Earlier this year, the Moss Landing Battery Plant operated by Visitor Energy caught on fire and golfing the LG batteries inside the building. LG Energy Solutions provided the racks and batteries for this project, while other providers worked on the balance of systems. In the wake of the fire, Stephen Lacey sat down with Tristan to explore what has changed in the industry in the months afterward. It certainly was a huge wake-up call for the industry, a very pivotal moment for battery safety, but one that I think is going to drive us forward and really drive some positive changes that I'm looking forward to in the future. In this interview, Stephen and Tristan Outline Design changes why vertical integration is so critical for improving safety and performance and explore the future of US supply chains. So it seems appropriate since we have a former race engineer with us who has dealt with many challenges to start this conversation off by talking about safety. The Moss Landing Battery Fire in California that recently happened was a pretty pivotal moment for energy storage. I wonder if you can talk us through what happened and what we learned from that incident and how is it shaping the industry's approach to safety? I think as is always the case with these huge fires, there's some things we know. There's a lot we don't know yet and there's probably plenty that we may never know. Fundamentally though, and I think we don't yet know what the root cause is. We're working really, really closely with the site owner and all the local authorities to try and figure it out. What we do know is that mid-afternoon, January 16th, one of those modules went into Thermal Runaway. What we don't know yet is we don't have an official sort of answer on is for some reason that water system didn't work correctly. And that thermal runaway spread from one module to the next and eventually to the entire section of that building, ultimately destroying it. And so just a little bit of background about that site because it was an important site, I think, in the history of energy storage and energy storage deployments. It was the largest site by a long shot for many years. But it was a retrofitted gas and oil power plant that was originally built in the 50s. And in 2013, California passed a law that was sort of requiring a big build out of energy storage and Vistra, the project owner, answered that call in 2018 announcing that they were going to build this Moss Landing project. What they did was they essentially pulled all the equipment out of a massive turbine hole and they replaced it all with battery racks. The incident earlier this year was in that first phase of the Moss Landing complex. There's a couple other battery projects on that complex, but they weren't involved in this particular incident. I think that it's really worth noting that there was a certain era in the energy storage industry where anything over a certain size, any project over a certain size, and people listening to this may laugh when they say that certain size maybe was 20 or 30 megawatt hours, which seems teeny, tiny compared to today's standards. But anything that was of any meaningful size would typically go into a building. And that was just sort of the design practice of the time. Things have moved on quite a bit since then, but that was the case. And so these systems, they were racks essentially sitting in a building. They had a water-based fire safety system that was essentially when a thermal runaway was detected, it would spray water on the module to reduce the heat in that module and to make sure that that thermal runaway didn't propagate to the modules around it. And that's sort of the layout of this site. I think one thing that's really worth noting is that these huge projects, that there's a lot of different players on site. This was also a time in the industry when LG wasn't vertically integrated as it is today. And then there was sort of layers and layers and layers of other players at this project site. They all had to come together and everything had to work together to defer it all to function. What I'm really thankful for and I think everyone is really thankful for is that all the first responders did an amazing job and nobody was hurt. Thankfully, all the environmental measurements that came back, all the EPA's been doing extensive testing all around the site. All those measurements have come back within sort of safe limits. And I hope that in the next months, we're going to have a nice extensive report that will help the entire industry learn from this event. And are you seeing a shift to more containerized battery storage solutions compared to like a building-based installation like Moss Landing? How is that evolving and how does that impact safety? So definitely there has been a huge shift to containerized systems instead of building based systems. You see almost no building based systems built now anymore. Everything is essentially containerized. There are a lot of different reasons for that. It's one big one, but I think safety is another aspect that's an important piece to talk about. Fundamentally, I find the easiest way to think about why containers help on the safety front is that you're just splitting the problem into smaller pieces. A container has a limited amount of energy in it. It has its own fire safety systems in it. And it has walls and potentially even air gaps around it. So when one container or when one module in a container goes into a failure, goes into a thermal runaway. Ideally, that module is dealt with by the fire safety system. Maybe hopefully that module just turns into a non-event. That module has failed. You pull it out, you replace it with a new one. What you think about in terms of safety, you think about worst-case scenarios. And now the worst-case scenario is simply that you lose a container. Maybe the next container over gets a couple of scorch marks on it, but typically right now the worst-case scenario is you lose one container, which is several orders of magnitude less than what we saw at Moss Landing. And so fundamentally, what's your problem? Make it a smaller problem. And then when that problem happens, it's much more manageable. So looking ahead, are there other safety innovations or design approaches that you're also excited about that can improve safety? That's a great question. I see there's a lot of innovation happening right now at a lot of different levels. There's plenty of cell-level innovation that's happening. There's a lot of chemistry work and a lot of cell safety work that's happening. But I also see a huge amount of effort and a lot of progress being made at the system level. From a safety innovation perspective and from a design approach perspective, I really think that it's a multi-tiered approach. We're continuing to see a lot of system-level safety improvements that are happening along with the cell-level improvements. I see a huge play in terms of software. There's a big component to software and all the algorithms and AI and machine learning that are really being able to identify and catch failures before they turn into bigger failures. There's a lot of advancements here in terms of how much data is being collected and how you relate that to the things you know about the cells. And honestly, that's one of the big advantages that as a vertically integrated play that we have because we have this entire lifecycle of data that goes along with that we sell. But over top of it all, I think there's a big piece in terms of quality. And I talk about quality not only at the cell level and the manufacturing level but also at the system level and how these projects are coming together. And I think that there are a lot of sort of top tier integrators that have done a really great job of quality at the project level. But there's also this layer of codes and standards which I think is something that you think at the industry level that's going to force and require every single project that gets deployed to really meet that high bar of safety and system effectiveness. I want to sort of go back though a little bit and take note of how far we've come. And I think there's an eppery report out there that I think a lot of people in the industry have probably read and seen. But if you look at the number of failures and the failure rate from 2018 to 2023, it was just a five year span that it dropped by 97%. And I think that's something that's really incredible and something to be really proud of. Obviously we still have a long ways to go and there's still a lot of work ahead of us. But the knowledge that we made that much progress in that short a time period I think gives me a lot of confidence that these advancements are coming and that we'll get where we need to get. Let's turn our attention to manufacturing now. I know LGES has made some pretty big investments in US manufacturing. Can you talk about what those investments entail and what's the strategic approach to the American market? We've made a lot of very big investments. Right now we've been working heavily on localizing our production into the US. We've been doing that for a long time. Just for a little context, we started construction on our first factory in the US and Holland, Michigan. That was back in 2010. So that's almost 15 years ago that we've been working on this. We had cells coming off that line in 2012. That was back in, that was for the EV market. But we've continued to build from there. Right now we've got seven battery plants in the US that are either producing or in construction. We've got it also in advanced cathode facility. The one in there that I care the most about being on the energy storage side is our Holland Michigan. It's the second Holland Michigan plant that's producing 16.5 gigawatt hours a year of energy storage dedicated cells. That's our side of the investment. For many years we've had a strong strategy of diversifying away from China. We sort of have a two-step strategy to localize into the states. Step one is to find a supplier that is outside of China so that we have a more of a global supply chain. And then step two is to bring that supply chain into the US. That takes a long time. I think that's something that is sometimes lost. It seems really easy. Just flip a switch and we'll just build this stuff in the States. It takes years to build local supply chains, to qualify local supply chains, to get the right people and the right skill sets locally to be able to build what are ultimately really high-tech products. But I think so far we've been quite successful and we're in a good spot. Right now coming off of the Holland Michigan line we're on schedule for early next year to be 100% non-Chinese in terms of all of the components and sub-components that are going into those ESS cells. So it's a huge testament to the work and it's a lot of work that's gone into it by both the US and the Korean teams to make all that happen. So this has been a long-term strategy to invest in the US and diversify your supply chains. Of course this became a lot more urgent coming out of the supply chain disruptions from COVID and now we have these new challenges related to tariffs. How is the current trade environment impacting project timelines and your investment decisions? Taking a lot of analysis and reanalysis and re-reanalysis every time something changes. I think there's a lot of uncertainty right now in the environment and we've been lucky that we can be very flexible but it's also been a huge strain on I think us and everyone in the organization and everyone in the supply chain and everyone in the industry. We have to remember that these are enormous investments. LG's got sort of 25 billion investing in the US supply chains, 1.4 billion on that ESS factory. That's not something you just turn on and off at a moment's notice. You have to have a little bit of certainty. You have to know that it's going to make sense from a business perspective to be able to put down that kind of money. And I were lucky that we're a large multinational company with a balance sheet that can weather some of this uncertainty but it's not unlimited. What I do worry is I worry that there's a lot of other players in the supply chain, in the broader supply chain that don't have those kinds of balance sheets and maybe can't afford to have that kind of patience. We're seeing projects that are being paused, that are being delayed. We're seeing suppliers that are rethinking their strategy and what makes sense and what doesn't make sense. It's the goalposts are continually shifting and when that happens you don't really know what to do and so you're sort of paralyzed. What I really fundamentally worry about I think for the industry is not that we're not going to keep moving forward. I really do fundamentally believe that the economics are there for this industry and I think that the ultimate goal is something that we will achieve. It's just a matter of when and how fast. And this uncertainty I think all it does is it just slows that down. If you don't give people a clear signal they're not going to know what to do and they're not going to react in the most effective way possible and people are going to make, I call it a millimeter of progress in a million directions, which isn't an effective way when you're wanting to get single-minded leap to an end goal. I want to get your thoughts on integration strategies. So there has been a significant evolution in the size and type and integration strategies for storage from building batteries and connecting them to the grid to designing power plants that happen to use batteries. How has this change driving system integration and project development? I think that there's been a real strong shift in the mentality of how you integrate these plants and being a part of a company that has control over the supply chain from the cell all the way out to your transformer or even your interconnection allows us to think differently. We've kind of been able to flip the script on how exactly to do these projects. Originally, if you run the clock back into the early 2010s, a lot of people would say, hey, I have all these batteries. I've got maybe some EV batteries. What can I do with them? Well, let's put them together in a rack. Let's put those racks together in container. Let's put those containers together in a project. It was very, very inside out. Starting at the cell and then it was sort of multiplying and building and to create your project. Whereas I think the mentality has taken a strong shift and now we're thinking from the outside in. We're saying, what does a power plant look like? What value does it need to bring to the grid? What does it need to do to be really effective and to meet the business goals of the operator? What do the batteries need to do that are going to do that? You start at the power plant and then you move into your power block or your enclosure and then you move there into your module and you move from there into your cell. The direction of design decisions and the direction of design intent has kind of flipped 180 degrees, which is a fascinating change to see in the industry. But it's also one that I think is creating much more effective and much more powerful designs. What are the advantages of vertical integration? Well, the ability to do exactly what I just mentioned is when you're a system integrator and you're using a third-party cell, you're often kind of stuck with what your cell suppliers have. You've got to look through your catalog, figure out what's out there, how you put it all together to meet the need. When you're fully vertically integrated and you are understanding what the customer is truly needing and you can take that information and pick up the phone and talk to the designers who are actually designing the modules and the cells and describe to them what challenges you're facing. They understand that they can make their designs work much, much better with the overall plant. I think that's really a strong key. I see another big strength of vertical integration in just understanding and being able to control the supply chain and being able to manage the supply chain. One of our advantages and one of our superpowers as a battery company and being the largest non-Chinese battery company out there is that we have not only ESS production, but we also have EV production. This was one of the plays when we decided to shift our original plans of building the ESS production facility in Arizona and shift that to Holland, Michigan. It was so that we could build cells, more cells and build them sooner. That was only because we had the experience in the EV plants and we had this EV plant and we had these facilities that we saw market shifting. We saw that the EV market wasn't growing quite as fast as the ESS market was, that our forecasts were not quite right, but we could readjust. We had that ability to be flexible and we had that ability to readjust. Then instead of taking three or four years to build a complete green-fueled battery factory in Arizona, we could take six to 12 months, take an existing shell, an existing building that had all the permitting done and had all the infrastructure and all the utilities, take all that equipment that it was originally destined for Arizona, send it to Michigan and we were suddenly up and running almost a year earlier with ultimately a higher level of production per year. That vertical integration, that ability to maneuver things around and change and adjust to the market environments and the conditions really gives you the ability to be more flexible and to be more adaptable and what is ultimately a really variable environment right now. The players that have that adaptability and have that power are in a good spot right now. Tell me about how the software is evolving. As the use cases for storage on the grid diversify, what is happening in the software side as part of that stack? How are you approaching software development? What's changing that's most interesting? Yeah, software is an interesting piece. I think there's a lot of really interesting technology that's happening on the software side. There's a lot of AI machine learning that we mentioned earlier in terms of the safety aspect. There's a lot of operational efficiency and keeping really high availability of your systems. We're also working a lot with how to operate energy storage more effectively on the grid. What's the optimal dispatch? What's the way to play in the power markets and really be effective there? I think the other side of software and it flows into availability and safety is the cybersecurity piece and the domestic supply chain piece. I see software as a really key component of our supply chain. The fact that we build all of our software either in the US or in Korea, the fact that we have 100% visibility over every piece of every single controller in our enclosure, I think puts us in a stronger stance, I think, from a safety and cybersecurity perspective. I'm happy to see that we've brought all that in, that that's actually one of the really strong components that we bring to market. It just fundamentally I think makes for a better product. It's more secure, it's more stable and ultimately it's going to bring better value to the customer. It's impossible to have this conversation without talking about the demand backdrop now that is making storage even more valuable. Of course, around the world, but particularly here in the US we're seeing this surge in demand particularly due to data centers. It's a wide variety of things like electrification, factory development and data centers. I'm curious about how you see this shaping the market for storage. Is it changing the need for storage, the applications for storage? How do you see this demand backdrop influencing deployment? Well, there's a lot. It's a very foundational shift in the energy markets and the energy space. Everyone I think most people know has been talked about quite a bit in the last sort of six, 12 months, but our electricity demand as a country has been fairly stable and fairly flat for the last couple of decades. Only now we're starting to really pick up. It's a good thing because we're picking up economic activity. We're picking up these data centers. We're picking up manufacturing, but it's also a big challenge that we have ahead of us. Now, what's that crystal ball and how do you tell what that future holds? Is it 30 gigawatts of extra data center demand? Is it 60 gigawatts of extra data center demand? Is it even more than that? What's the overall demand growth? Is it going to be 50, 100, 200 gigawatts total? The sort of band of uncertainty is quite wide in terms of what the future holds and what that demand growth is actually going to be. I think what the trillion dollar question really is is how you go about serving that demand. Whatever it is, it's going to be big. It's going to be very big. But how do you get to serving that demand? There's a lot of different options on the table. I think every energy option out there is being looked at and is needed in solving this problem, but the timelines are quite varying. Nukes are probably five or 10 or more years out. New gas generation, you can't get a new gas generator for probably four or six years at the very shortest. The most immediate and economical solution is really those renewables and batteries. I think from a pure data center play, you brought that up. What are the specifics in terms of how we address the data center needs? There's a lot of variability there. I think that goes back to speaking to the uncertainty in exactly how we're going to bring all this online. There's everything from completely off-grid microgrids that are powering data centers until they can get grid connections to working really closely with utilities to bring extra generation on board. I think there's a lot of questions there, but there's a lot of smart people in the industry that are working really hard on those. I've got a lot of confidence and a lot of faith. Do you think we'll see a lot of batteries hosted at data centers? Yes, I think we'll see a lot of batteries at data centers. I think we'll see a lot of batteries on the grid next to data centers. I think we'll see a lot of batteries that are on the grid far away from data centers. I think we're just going to see a lot of batteries everywhere on the grid. We've made immense strides and we've figured out a whole lot of really interesting and really fascinating ways of using batteries, but I think that there's a whole bunch more that are to come. I'm really excited for what's going to come. We've covered innovations in safety, system design, integration, strategy, supply chain development. What other technical innovations and batteries are you most excited about right now? I think obviously there's a lot of technology advancement. I think there's some great battery chemistry plays coming out. I think that as the markets shift to these longer and longer duration, some of these longer duration battery chemistry plays could be really interesting if they hit the right timing. I do think that the advancements that I'm most excited about are really how to get that deployment to be smooth, how to get that deployment to be effective, how to keep these systems really up 99% of the time, 99.5% of the time, just keeping that massive, really, really stable uptime and get the reliability that you need to support the grid. Fundamentally though, I do think that we have a great technology in LFP and that we're starting to get really good at deploying these huge sites quickly and effectively and that there's just a lot more value that we're going to get out of them as we learn to manage fleets that are at the tens or hundreds of gigawatt hour scale or even thousands of gigawatt hour scale. That's where a lot of the advancement is going to come. It's the scaling question and the scaling problem that we have ahead of us. Do you still get the same thrills working on energy storage as you did working on Indy cars? I'll be honest, every time you turn on a one gigawatt hour site, there's a little bit of a thrill. There's a little bit of excitement to see that happening. It is still fun for sure. Tristan Doherty, thank you so much. I enjoyed this conversation. Likewise, thank you for having me. This episode was produced in partnership with LG Energy Solution Vertec. LG Energy Solution Vertec is the US Energy Storage Division of LG Energy Solution, here to be your lifetime energy storage partner. For more on the company's approach to safety, performance and its commitment to the US market, follow the link in the show notes.",
    "release_date": "2025-05-20",
    "duration_ms": 1597000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI1882358341.mp3?updated=1747684845",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-06-05T01:53:01.315122"
  },
  {
    "title": "Terrawatt Infrastructure’s billion-dollar strategy",
    "description": "This week, we're bringing you a special episode of The Green Blueprint, a show about the stories behind first-of-a-kind climate projects. In this episode: Terawatt Power's first commercial electric truck charging depot, which opened in April near the ports of Los Angeles and Long Beach. It was a significant milestone for the industry. So how’d Terawatt pull it off? \n\nHost Lara Pierpoint talks to Terawatt’s founder Neha Palmer about the financing, offtakes, and market demand for electrified trucks. It’s the kind of deep-dive conversation we love to have here on Catalyst, so we think you’ll enjoy it. \n\nIn 2021, Neha Palmer co-founced Terrawatt Infrastructure with a bold mission: create the backbone for America's electric trucking revolution.\n\nWithin its first year, Terrawatt secured a billion-dollar investment. But as the company developed plans for a nationwide charging network, it confronted the daunting challenge of building infrastructure for an electric truck market that barely existed. \n\nHigh-profile bankruptcies like Nikola Motors cast long shadows over the sector's viability, raising questions about whether heavy-duty transport can truly be electrified.\n\nIn this episode, Lara talks with Neha about how Terrawatt aims to transform freight transport despite market skepticism. Neha explains Terawatt’s strategic approach to site selection, innovative charging designs for fully-loaded trucks, and the vision for a revolutionary California-to-Texas network.\n\nCredits: Hosted by Lara Pierpoint. Produced by Erin Hardick. Edited by Anne Bailey and Stephen Lacey. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.\n\nCatalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, and increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data plus tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.\n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "Latitude Media is hosting the Transition AI conference on June 12, 2025, focusing on energy infrastructure and AI-driven load growth. The podcast discusses the challenges and progress in electrifying heavy transport, with Terawatt Power making strides in building charging depots for electric trucks. Neha Palmer, Terawatt's co-founder, shares insights on financing, market demand, and overcoming obstacles in the industry. The episode explores Terawatt's vision for a network of charging stations and their approach to hardware supply, site development, and construction management. The podcast highlights the importance of collaboration, spare parts availability, and local expertise in successfully implementing large-scale charging infrastructure.",
    "transcript": " Mark your calendar for June 12, 2025. Latitude Media is holding its fourth transition AI conference in Boston. This year's theme, energy infrastructure in the era of AI-driven load growth. We're going to bring together investors, developers, researchers, and tech companies to talk about the creative ways to meet data center demand. And companies include FERVO Energy, Form Energy, Scale Microgrids, Spark Fund, KKR, Generate Capital, Orenia, FlexGen, National Grid Partners, and more. Plus, we're going to have a live open circuit episode featuring Caroline Golan from Google and a live green blueprint episode featuring Rick Needham from Commonwealth Fusion Systems. Get your ticket at latitudemedia.com slash events, podcast listeners, get 10% off their ticket, use the code latitudepods10 at checkout, latitudemedia.com slash events. We will see you at Transition AI. Hey everyone, Daniel Waldorf here. I'm the producer of Catalyst. So if you wanted to pick one of the hardest problems to solve in climate tech, near top of that list would be electrifying heavy transport. It's a problem we've talked about on this show. Fuel and molecules just have significant advantages over electrons and batteries, at least in the arena of hauling heavy things over long distances. A case in point, nickel emoteers high profile bankruptcy back in February. The collapse of the company raised a serious question, is electrifying heavy transport just too hard of a problem to solve right now? Maybe, but maybe not. Just last month, another company called Terawatt Power opened its first commercial heavy duty charging depot near the ports of Los Angeles and Long Beach. It was a significant milestone for the industry. So how did Terawatt pull it off? And what comes next for electrified heavy transport? This week we're bringing you an episode of the green blueprint. It's a show about the stories behind first of a kind climate projects. And it's hosted by a friend of this show, Laura Pierpoint, who has guest hosted before. Laura is the managing director of Trellis Climate, and she talks with terawatt's founder, Neha Palmer, about the financing, the off takes, and the market demand for electrified trucks. The kinds of questions that are, you know, the DNA of catalyst. So we think you'll like it. We will be back next week with a new episode. But for now, here's Laura and Neha. Heavy duty trucks make up less than 5% of vehicles on the road, but they generate nearly 25% of transportation emissions. Electrifying these massive vehicles seems like a no-brainer. But some skeptics say it's just not possible. Neha Palmer, however, is not one of those skeptics. This is a transition that is happening. When Neha Palmer co-founded Terawatt Infrastructure in 2021, she wasn't just building a charging company. She was creating an entirely new category of infrastructure. While passenger EVs had a decade-long head start, heavy duty electric trucks were still in their infancy. But she saw their path to electrification as inevitable. The analogy I love to use is transition that happens once every century. So you had the railroads, and that required a significant amount of investment very quickly. Then you had the National Highway Network. And now you have an overlay on both of those, really, which is the electrification of those modes of transport. The complexity of the challenge is staggering. A single site for heavy duty truck charging requires finding the perfect location, securing megawatts of power, navigating the permitting processes that have never seen this type of infrastructure before, and then convincing fleet operators to take a chance on a technology that's still evolving. And the road has been bumpy. Earlier this year, Nicola Motors, once a promising pioneer in zero-emission trucks, filed for bankruptcy after a spectacular rise in fall. Critics pointed to it as proof that electrifying heavy duty transport was simply too difficult. You know, I certainly hope it's a blip. We need as much investment into the technology or the vehicle itself as we do in the charging to make all of this a reality. But in April, Terawatt proved the doubters wrong when it opened its first commercial heavy duty charging depot near the ports of Los Angeles and Long Beach. The ports are technically separate, but operate as one big complex. They're the biggest container ports in the US, and it wasn't just a charging station. It was the first node in what will become a network of sites across all of Southern California. In California, we have built what I think is the best network of sites, and three of them will be live this year with the Port of LA Long Beach site being the first one. We'll have a third one that's further north near the intramodals. And so with those three sites, we kind of have amazing coverage of the entire LA basin. I'm Laura Pierpoint, and this is the Green Blueprint, a show about the architects of the clean energy economy. We've already invented most of the solutions needed to decarbonize the global economy, but many of these technologies are not yet commercial, and they need to get financed and built at scale. We don't have decades to get them commercialized. We have years. This week, we're talking about the monumental challenge of electrifying heavy duty trucking with Neha Palmer, co-founder and CEO of Terawatt Infrastructure. We know that this is a trillion dollar investment over years, and so the scale that we're talking about and the impact that we need to make, even with a few sites, is going to require lots of capital. Do you want instant access to energy storage supplier pricing that's project-specific, or the ability to compare domestically-made battery and PCS options across the market? Anza now offers the industry's first battery energy storage data and analytics platform to make better development and procurement decisions. Anza provides in-depth commercial, technical, and risk data and analytics to help developers choose the best equipment for any project. Improve your returns and save months of evaluation time with Anza. Learn more about Anza's energy storage subscriptions at go.ansarunuables.com slash latitude, or click the link in the show notes. Imagine a world where connected devices like EVs, home batteries, and smart thermostats work together to support a more efficient and reliable power grid. Well, you don't have to imagine it anymore. This vision is a reality today, thanks to EnergyHub. With EnergyHub's Edge Derm's platform, utilities can create virtual power plants through customer-centric flexibility programs, making it easy to manage distributed energy resources and balance the grid. Unlock grid flexibility and reliability through cross-DER management with EnergyHub, the trusted Edge Derm's leader. Visit energyhub.com to learn more. Terawats approach is ambitious. Shortly after launching in 2021, the company secured a huge chunk of capital from investors. Very amazingly, you secured a billion dollars in funding led by VisionRidge just after you launched, really. This was about a year after you launched as a company. So can you tell us a bit about what convinced investors at that stage to make such a big commitment to your vision? When you think about our sites that we're starting to build out, the billion dollars is not going to last that long to build that many assets. And so it was really the vision for the beginning that this is not just a small-scale effort. It's going to be something that requires significant capital. And there'll be have to be multiple billion dollars raises, frankly, to get this even off the ground. Terawat doesn't just install chargers. It acquires the real estate, works with utilities to secure power, installs chargers and associated infrastructure, and ultimately handles ongoing operations and maintenance. Really, our business model is investing into these sites and taking that cap expert and away from our customers, allowing them to engage in a more off-x basis, and also taking away the pain of working with utilities when they're used to buying fuel, of the time that takes to put the construction together, all of the investment, and really making that a seamless process for them as they change to electric vehicles over time. Terawat began piloting its business model in 2022. Then in October 2024, it opened its first full-scale commercial site near LAX. This site is for passenger vehicles, and in this case, that mostly includes ride share companies. It's not suited for big semi-trucks. On the ride share side in dense urban markets, where there's a lot of traffic we're hearing from operators, it's cost-creative for them to run EVs instead of traditional vehicles because of the fuel savings. The market momentum is slower for medium and heavy-duty charging. In part, that's because of what we mentioned at the top. The electric semi-trucks industry has struggled to take off, and it's tough to make the case for building chargers when there aren't trucks to charge. But Neha is optimistic that that market is going to tip with more big trucks being electrified. We've had almost close to 20 years of learning on the passenger side. On the electric truck side, it's certainly earlier days. You see a lot of the same things you saw on the passenger side. You're seeing improvements in battery pack costs and performance of the vehicles themselves. As that starts to mature, you're starting to see more and more demand. The heavy-duty charging facility near the ports of LA on Long Beach, the Terawat Open this year, is called Ranchero Dominguez. It features pull-through stalls that can accommodate full tractor trailers, which is a unique feature. And up to 125 trucks can charge there in one day. It marks the beginning of what Terawat envisions as a network of charging stations all along the I-10 corridor, all the way from California to Texas. We call it kind of a corridor, but it would start the port of Long Beach and go all the way to El Paso, Texas. And so allowing somebody in an EV truck to travel that confidently, knowing that they had charging along the way, that would accommodate the range of the vehicle. I talked with Neha about Terawat's audacious plans for heavy-duty electric vehicles and her outlook for the industry. I started by asking her about the passenger vehicle side of the business, because the LAX project was Terawat's first full-build charging site and a major proof point for the company. So you started off near LAX. Can you talk a little bit first of all about why you chose that particular site? Yeah, so you know, ride share autonomous vehicles has always been a focus for us from the beginning. And a huge number of rides or initiates from airports. It's also a location that's near a major stadium and a lot of other good venues that would require ride share to be part of that ecosystem. So the location just made sense from density of demand. It also was a site that was for sale. Oftentimes, we might be excited about a specific geography or geo-fenced area, but there may not be any flat lots or open lots or undeveloped lots to go and work with. So this was something that allowed us to engage in this area. And it was the right size for the application we were trying to put in, which was what ended up being about 30 chargers focused on passenger vehicles with enough space for drivers lounge and all the space for all of the electrical equipment chargers, everything else that we needed. So the last piece that is always so important and I'm making it sound like an afterthought, but it really is the most critical thing and the thing that we almost always think about first once we identify a location is it had power. So it had five megawatts of power that was available from day one. We just had to start construction on our site and the utility had to do a little bit of construction on their end, but we knew that we could get that power from day one to allow us to serve that many chargers all at one time. So really it had that confluence I call it the Venn diagram of the things we need, which are customer demand, available real estate. It didn't have the right zoning at the time, but we worked on that. And then the last piece and the most important piece being the power available at the site as well. Okay, well, let's talk a little bit about the development for the sites. Can you walk us through some of the things that you had to do around permitting site preparation, all that sort of stuff? What did it look like to get ready to build it? Yeah, and so this is something that's always fun when you're starting a new industry. I came from data centers and we had this whole pattern of recognition for data centers too. When it was early days, we'd go into jurisdictions and people would say, I don't even know what that is. Certainly that everyone knows what that is in the world now, but for EV charging, there's oftentimes not any code available in the planning code for how do you permit, how do you entitle an EV charging hub? So we worked very closely with the city of Englewood, who is a fantastic host for us here in this site to understand what their existing code was and how we might fit into it. It had to go through a whole process with the city council, the planning council, to have them understand what the project was, what kind of benefits it would bring to the community, and then they had to actually put new language in their code to allow the entitlement of this. And so that's something that we find in many new HJs or authorities having jurisdiction that we enter. They may have never seen this before, so we have the benefit of having done it now. We could hold up this template, but this was the first time. And so we did have to work through that process with the city. Again, they were super, super collaborative. And so we were able to do that, but that did take time. So it wasn't like, day one, we have closed on this real estate site. We know exactly where to go to file for the permit, etc. There was a little bit of legwork to do ahead of that in the entitlements to get the right zoning for the site. And then there was a whole permitting process and kind of a little bit same thing again. There have not been many of these installations at this scale built anywhere. And so it takes some time to work with the city engineers to get them to understand like, here's what this looks like. Here's our electrical design. This is what a typical site looks like. And so we re-end that process with the city again, again, very collaborative. But anytime you have to do a little bit of educating and collaborating, it does take more time. Sure. Okay. Well, and then let's talk for a second about your hardware supply. So there are a lot of different charging companies that supply hardware for passenger vehicle charging. So how did you think about that? How did you select your hardware provider? And is it kind of a single provider that you always work with? Or how do you think about your supply chain here? Yeah. So it's interesting you say supply chain because there's so many components, not just the chargers. For this site, for the chargers, we wanted to make sure that we had a partner that was going to be working with us to maintain that high uptime. And so we worked with that partner really closely to make sure that any kind of visibility software we were building was going to be very compatible with their chargers. That's a level of integration that's generally not there. Generally, there's probably, call it four to eight would be a large, large installation of chargers in one location. This is a much larger deployment that I think most charger companies are used to doing in one location. So the concept was a little bit different for them as well, I believe. And so working really closely with them to make sure that our software worked with their hardware and that we were able to do what we needed to do to have the remote network operating center, have the visibility they needed. So there was a lot of work up front to make sure. And again, we're also deploying our software for the first time. So a lot of work to make sure that there was a level of collaboration. So when we look for hardware providers, obviously the hardware has to work, it has to be high quality. But the real table stakes for us is collaboration. And so ensuring that they were willing and able to do that level of collaboration. Another piece is spare parts. It seems really simple that if you create chargers, you would have a full spare parts program, but that's not the case for all charger providers. So making sure that they had a robust program here in the US, oftentimes you have chargers coming from other geographies. And so they might be deeper there, but not here in the US. So deep spare parts program. And then also just texts that are available and understand that technology again, it's a very global supply base. And so you might have depth in Europe, but you may not have very many texts that know that equipment here in the US. So really thinking through that whole aspect of how do we make sure that we're going to have the highest uptime we possibly can. And so kind of one last question about this, well, a couple of questions actually about this about this commercial site. So one of the things that comes up pretty frequently on the show is the question around, do I use an engineering procurement and construction firm to build something or do I do it myself? And some really interesting impacts flow from those decisions, particularly when you're building things that are effectively first of a kind. So can you talk a little bit about how you were thinking about managing the construction on this first site and what you ultimately decided? So for this first site, we did work with an EPC firm. And I think we learn a lot about working with an EPC firm. One thing that we learned is the civil aspect of our sites is very heavy. If you look at a site, actually, I think sometimes people look in like, oh, that's interesting. It's like, you know, 30 chargers are nice and pretty standing on the ground, but you don't see what's happening below ground, which is massive duct banks. We oftentimes put in extra capacity. So when the charger power might go up, we would have the capability to actually make that change over pretty quickly. So future proofing underground. And so there's a lot of stuff happening below the grade. And I think that's one thing that we learned in that EPC, if you think about it, the civil trade, and I'm actually a civil engineer, is very local. So having that local expertise is very, very critical for the types of things we build, because, you know, the type of soil that you're dealing with, the codes that are related to how much rainfall ends up in an area, etc., is oftentimes really contingent upon local expertise to understand those characteristics and how the local planning commissions and engineering leaders in those planning commissions will think about our construction. So something that we had to kind of learn the first time. And so how we contract in the future would be really taking that lesson in hand. With the first commercial site built, Neha and the Terawat team turned their attention to their flagship heavy duty project, Rancho Domingos at the Port of Long Beach, which had actually already been underway for years. More about that after the break. Catalyst is brought to you by ANSA. ANSA offers a one-of-a-kind data and analytics platform and advisory services to support better project development and procurement decisions. For energy storage developers, ANSA's platform provides crucial information that you never had easy access to before. Now at your fingertips is real-time pricing for a long list of system configurations to suit any project. ANSA provides a 360 degree view of the market with lifecycle cost analytics and commercial technical and risk data. With ANSA, developers can easily determine which products to use in their designs, finance models, and RFPs. Learn more about how ANSA helps save time and maximize profit at go.ansarunuables.com slash latitude. Catalyst is brought to you by Energy Hub. Energy Hub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. The Energy Hub platform takes the guesswork at a balancing energy supply and demand. It uses machine learning to control customer-owned distributed energy resources like EVs, home batteries, and smart thermostats to precisely shape load profiles for grid flexibility and reliability. As the industry leader, Energy Hub helps more than 80 utilities manage 1.6 million devices. That's more than any other edge germs on the market. Click the link in the show notes to learn more or go to energyhub.com. This is very cool. It sounds like tons and tons of lessons learned from this first site that then launched you into building your second site at the port of Long Beach. Can you talk a little bit about how that project got started, at which point you started thinking about doing this particular project, working into the heavy-duty vehicle space, how did that all begin? So it's interesting. Our vision for the company really from the very beginning was focused on being able to electrify the heavy freight industry. The gleam in our eye was this segment. We started engaging the search for sites right when we started this business in early 21. Heavy-duty fleets tend to focus on locations that are near ports in warehouse hubs near intermodals. The port of LA Long Beach was a location where there already is an intense push for electrification. There's a green lane at the port. So if you are in a zero-emission vehicle, you actually can get into the port faster with less wait time. Time is money for these guys. And so there's some significant upside for them to be able to do that. In Southern California, you also have something called the wear rules, where non-zero-emission vehicles going in and out of warehouse hubs can start to incur fines for those warehouses. And so there is a push in the area for electrification with the port kind of being ground zero, the nexus of a lot of those efforts. And so finding a site near the port was kind of our first order of business when we started the company. And so it took us a while to find an ideal site. And when we did, it was pretty expensive. It was probably going to be the biggest single real estate investment we had in the portfolio at the time. As a result, we had to look really carefully at this investment and make sure it was the right location. Again, close to the port, but not in the port or on top of the port. So really understanding the characteristics of the flow of traffic from the port to different locations that those vehicles go to. Understanding the density of the flow of traffic, because the Port of LA Long Beach is the biggest container port here in the US. Freight goes in every single direction from that port. Are we on the right trajectory coming out of that site? So we did a lot of interesting things, everything from looking at anything that was available publicly from the Department of Transportation on freight flows, all the way to having someone just stand on the corner one day and count how many trucks went by in a specific two hour period. So we really put a lot of thought and energy into deciding on this as a location for that really important first heavy duty site. I love that story so much because I feel like so often we tell the stories of guts and glory for startups. And then it's really important to remember that some of what makes startups successful is exactly that as an employee with a launcher sitting on the side of the freeway counting tracks at various points to influence how this decision went. And can you say a little bit about how that felt to kind of finally make a decision on this site? Because this was a pretty huge moment for the company to ultimately make this down selection and put as you put it, like a fair amount of money on the line to make this site acquisition happen. I mean the location has to be there and that's why I talked about the Venn diagram. So we got comfortable with the location. This site also had something really incredible where you don't find this in many locations, which is 7 megawatts of power available from day one. So that amount of power allowed us to do a lot of great things with the site. It was, you know, a corner a lot. It had the right dimensions. It had a lot of space. So the site characteristics were great as well. You know, we had started to build these other sites and so we kind of had an idea of what that process is for entitlements. So kind of everything started to tick all the boxes and that got us comfortable with it. But ultimately we got super excited actually, not just comfortable excited about this location based on everything I just said and we're excited to get this into our portfolio and under construction. So and then you're starting to design the site. So let's talk a little bit about this. One of the things that you had mentioned earlier was that you offer the opportunity for folks to pull in, not just with these bobtails sort of front end of the trucks, but really a fully loaded truck that actually has a trailer behind it. So were you already sure at that point that you wanted to offer that kind of charging capability or were you really thinking about, you know, what would the site layout look like? What were some of the trade offs around these different options for charging? So again, there's very few sites that have this scale of power and size that would allow that many chargers in one location and that need trucks to charge in one location. So we're kind of, you know, I won't say, you know, making it up, but we were doing a lot of kind of product assessment and design to understand what would customers need. And if you look at a lot of the sites that are out there today and even sites that customers have behind their fence when they have the charging, it's usually just for a bobtail stall. So this was a little bit of a tug of war between the finance team and the product team. The product team came from places that had worked with semi trucks before. And so they really were pushing for those pull through stalls saying, hey, if you look at the traffic flow patterns, they're going into the port or out of the port with the trailer attached to the tractor. It's going to be a really big lift for them to have to find a place to put the trailer, detach it, come in and charge, or, you know, just be in a position where they don't have the trailer for whatever reason. They're between loads to come back to the site, charge, and then go back and get their trailer, just a lot of work. And so wouldn't be really a great customer experience if they had to do that. The tussle with the finance team was, well, if you have more chargers, you can potentially make more revenue from a site, right, and have more utilization. So we landed kind of on a compromise, but we wanted to optimize the site for the pull through. So we got as many pull throughs on the site as possible. And then when we had more power in space left, we added in some bobtail charging that will also allow, you know, smaller box trucks or even light duty vehicles that need a huge amount of power or a high power charge to charge there. And when we had, you know, the kickoff event, we had a bunch of customers in the site, and they were all just marveling and really kind of gleeful about the fact that we had that many pull through stalls. Oh, that's awesome. I can't wait to ask you a year from now how the utilization goes on both sides of those. I'm sure you all are dying to know that too. Very cool. Let's talk about those customers for a sec because they're obviously very key to the equation here. So can you say a bit about what your customer interactions were like, particularly for this project? When did you start engaging them to understand what they might want and what sort of contracts they might be willing to sign up for and when and how did those how did those negotiations go? Yeah, so we started engaging customers the minute we had the site. It is really hard to have a conversation with a customer if they can't and been imagined the location. So generally speaking, we don't start conversations until we have the specific site in mind. And even a layout that said, what's interesting is it takes us call it 18 months to 24 months to find a site, get it entitled, permitted, constructed, and then an operational. Most vehicles make vehicle purchasing decisions at the most a year in advance, sometimes six months in advance. So they may decide that they want to buy a few EVs and, you know, have those six months later. Charging doesn't come that quick. So for this first one, it was a little bit of lining up those timelines. And so one thing that we did see is we got closer and closer to project completion, a lot more engagement from these fleets because they could actually come to the site and see, oh, you've got this thing paved and this is what the flow looks like. And it's really going to come to fruition. I think there is in any industry that's new in nascent, a lot of discussion of, we could build this or we could build that by having actually done it. And it's in site and operational. We actually saw even the week before we launched, you know, we were doing site tours with lots of customers and that turnaround from site tour to contract was starting to happen a lot faster because of course it's ready to go from day one. But also just being able to see it is everything. Very cool. So can you say a bit more in detail when was the first customer contract signed? Like what had you done or completed at the site that got the first person in the door to say yes and actually sign on the dotted line? It honestly was about two years ago. So it was a customer that has pretty good experience with electric vehicles. They're one of the first movers in the industry. They have a larger fleet of EVs than most fleets do. I think they have well over 50 right now. And so they had some good experience where and they were at a point where they were starting to outgrow their on site charging and they're also located close to us. So again, it was a good validation of that location selection. But the conversation really was like, hey, we've never done this off site. We don't know how it's going to work. We'll take a chance with you guys. You know, there was some preexisting relationships there that maybe helped Greece to skids. But you know, they really were taking a chance that we were going to do what we said, build the site, deliver it, and then it would fit into their operations. And so now that it's live, I'm super excited to see how it fits in. I think it's going to be a lot more utility than they probably thought. This does open up a lot of different use cases like top off charges. The amount of power we have per charger allows it to charge a vehicle to charge much faster than most behind the fence chargers. And so having that capability can sometimes allow for a double shift of a vehicle where if it was a slower charge, they could use it for one run, has to come back to the yard, spend six to 12 hours charging, and then can go out again. But if you can top off, you might be able to get two runs in a day. And all of a sudden that utilization that vehicle's doubled. So, I think those are the types of conversations we were having, the hopes that they had that we had. And now we'll see how this actually plays out. So my next question is, how, as you're building this site at the port, you're obviously, I'm sure, in the process of thinking about your next site and the one after that and the one after that, and a whole fleet of sites to come, particularly on the nighttime corridor in California, but maybe elsewhere too. So tell us about what comes next. What is the next site that's going to come online? How are you thinking about your future build out how many sites are you working on all at once? Yeah, so for this, this definitely is the first of a couple of projects. We have our next site that will come online in the summertime that will be in the inland empire, which is after a vehicle goes to the port, it generally goes to the inland empire, which is the giant warehouse district for the port here in California. And so we'll have a second site there in a few months. And it really is thinking about this as a network, right? These are moving assets. I mentioned that top off charge that could be really beneficial to how our utilization of these pretty expensive vehicles for now. And so really excited that that will allow a lot more operational flexibility for EV fleets to move freight around the area. And so we call it a lane in the freight industry. So the lane between the port and the inland empire is a very important lane and having charging on both ends just allows a lot more confidence electrification, having the capability to maybe have a contract that allows access to both sides, which we're seeing the demand for now, is also really freeing and exciting for customers. If they had to do that on their own, they would have to figure out a location that they had to find access to near the port and one near the inland empire. And oftentimes these are drainage companies where their main operations may be near the port, but they are just delivering to their customers in the inland empire. And so don't really have access to sites there. So super exciting that this will be the first node in the network. You mentioned the i10 project, and that's also super exciting. And this is also the first node in that. What's interesting is, we know that the site's going to corridor will take a little bit of time to build. And already, as I mentioned at the top of our discussion, that technology is starting to change. So those sites are generally about 150 miles apart. We know that the range is generally much, much longer than that. Another thing that's happening is we're starting to see standardization of the charging infrastructure. Seems really simple, but the connector has to be the same from all the charging providers and all of the tracks have to use the same connector. And so there's a global body called Charon that has been working on that protocol for quite a while now. It does seem like that they're finally at a place where that specification is built out enough that we have confidence of what to build along that corridor that can serve any kind of truck. Our customers are not generally going to have just one type of vehicle. They will have multiple models in their fleets. And so they want to know that if they have a contract with us or anybody else, or even if they're putting in infrastructure behind their fence, that they don't have to put in different infrastructure for different vehicles. That sounds crazy to a fleet, right? But we are starting to get that maturity in technology in the industry. That's really making that project super exciting and viable. If I wired $100 million into Terawats Bank account tomorrow, what would you do with it? You know, I mentioned the location piece. And I think that we're already doing this. And so maybe it's not different. And we have raised quite a bit of capital. So we have a little bit of freedom to do this. But I would make sure that we're investing into the next generation locations where we know this will be needed. So sometimes there's places where there just is no power. It will take four plus years to get there. So if you're able to have that site and start to develop it quicker, you would have that when that demand comes to that market. But I think the thing that we are really thoughtful about right now, and I think that we're going to be able to do a lot of great work with is how we use the energy that's available on a site. So there's a lot that we're learning again from seeing the utility of these sites. And these sites are designed for every vehicle to come in at the exact same time, and be the top of the charge curve pulling the full power of the charger at the same time. And that just doesn't happen. And so there are ways that we can actually, you know, we have seven megawatts in the street of power from the utility at our heavy duty site. But maybe instead of serving, you know, 20 chargers, we can serve 25 chargers with that. So really, or we can serve higher power at each charger with that. So I would invest it into making sure that we're being really thoughtful about that piece of it. Because again, I mentioned that power is the first thing that we always look for once we find those two other things. And being able to be more efficient with that is great for us. We have more capability of the site, but it's also great for the utility. You know, we're in an era where they are under pressure to do all kinds of things and, you know, build really fast for lots of increasing electricity demand. And so removing some of that pressure for them allows us to work more collaboratively with them as well. So I would invest into that. I don't think it takes $100 million, but sometimes money is speed. But I love that a piece of your answer is making your financial team happy by making sure that you're optimizing and increasing utilization. So that's awesome. Always have to keep them happy. Thank you so much. This has been such an awesome interview. It's really interesting to hear about all the things that you've done on your journey and the challenges you've overcome. So we wish you all the best. Neha Palmer is a co-founder and a CEO of Terawat Infrastructure. The Green Blueprint is produced by Latitude Media in partnership with Trellis Climate. The show is hosted by me, Laura Pierpoint. Our producer is Aaron Hardick. And Bailey is our senior editor. Sean Markwand is our technical director. Steven Lacey is our executive editor. If you'd like to suggest topics or guests for the show, send an email to thegreenblueprint at LatitudeMedia.com. You can listen to the Green Blueprint at latitudemedia.com or subscribe wherever you get your podcasts. And if you have fellow clean energy or climate tech travelers who would benefit from the insights in this show, send them a link. This is the Green Blueprint, a show about the architects of the clean energy economy.",
    "release_date": "2025-05-15",
    "duration_ms": 2333000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI9911507760.mp3?updated=1747286579",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-06-05T01:57:17.706030"
  },
  {
    "title": "The U.S. nuclear groundswell",
    "description": "The nuclear renaissance of the 2000s turned out to be something of a mirage. Buoyed by rising fossil gas prices, growing climate awareness, and steady load growth, nuclear seemed poised for a breakout moment. But that momentum stalled. Electricity demand flatlined. The fracking boom sent gas prices plummeting. And Fukushima rattled public confidence in nuclear power. Ultimately, only two new reactors, Vogtle units 3 and 4 in Georgia, reached completion over a decade later.\n\nSo is this latest wave of nuclear hype any different?\n\nIn this episode, Shayle talks to Chris Colbert, CEO of Elementl Power, which on Wednesday announced a deal with Google to develop three nuclear projects of at least 600-megawatts each. (Energy Impact Partners, where Shayle is a partner, is an investor in Elementl.) Chris, a former executive at NuScale Power, thinks last year may have marked the start of a nuclear revival: the recommissioning of Pennsylvania’s Three Mile Island and Michigan’s Holtec Palisades; Big Tech deals to support small modular reactor development; and the start of construction on TerraPower’s Wyoming reactor, the Western Hemisphere’s first advanced nuclear facility.\n\nBut until new reactors move beyond one-off projects to serial deployment, nuclear won’t achieve the cost reductions needed for widespread adoption. Chris and Shayle discuss what it will take to turn this groundswell of activity into widespread deployment, covering topics like:\n\n\n  \nCurrent tailwinds, like load growth and interest from corporate buyers\n\n\n\n  \nWhy corporate buyers may be better positioned than utilities to take on development risks\n\n\n\n  \nElementl’s technology-agnostic approach\n\n\n\n  \nDifferent nuclear technologies — light water, non-light water, and advanced designs — and Chris’s predictions for when they’ll reach commercialization\n\n\n\n  \nWhy iteration is essential to driving down costs (and why the Google deal involves three separate projects)\n\n\n\n  \nHow regulatory timelines are speeding up\n\n\n\n  \nThe steps of project development with a corporate buyer\n\n\n\n  \nChris’s criteria for site selection — and why attracting skilled labor ranks surprisingly high\n\n\n\n\nResources:\n\n\n  \nLatitude Media: Was 2024 really the year of nuclear resurgence?\n\n\n\n  \nLatitude Media: Is large-scale nuclear poised for a comeback?\n\n\n\n  \nCatalyst: The cost of nuclear\n\n\n\n  \nLatitude Media: Trump’s DOE is reupping Biden-era funding for small modular nuclear reactors\n\n\n\n  \nLatitude Media: Utah bets on a new developer to revive its small modular reactor ambitions\n\n\n\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.\n\nCatalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, and increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data plus tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.\n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "Latitude Media is hosting the Transition AI conference on June 12, 2025, focusing on energy infrastructure in the AI-driven load growth era. The event will feature discussions on meeting data center demand with companies like FERVO Energy and Google. Elemental Power, a nuclear developer, recently partnered with Google to build 1.8 gigawatts of new nuclear capacity in the US. The podcast delves into the nuclear power market's current groundswell, driven by political support, off-taker interest, and regulatory changes, aiming to translate momentum into tangible grid capacity. Discussions cover customer engagement, supplier landscape, regulatory challenges, and utility roles in shaping the future of nuclear energy.",
    "transcript": " Mark your calendar for June 12, 2025. Latitude Media is holding its fourth transition AI conference in Boston. This year's theme, energy infrastructure in the era of AI-driven load growth. We're going to bring together investors, developers, researchers, and tech companies to talk about the creative ways to meet data center demand. And companies include FERVO Energy, Form Energy, Scale Microgrids, Spark Fund, KKR, Generate Capital, Orenia, FlexGen, National Grid Partners, and more. Plus, we're going to have a live open circuit episode featuring Caroline Golan from Google, and a live green blueprint episode featuring Rick Needham from Commonwealth Fusion Systems. Get your ticket at latitudemedia.com slash events, podcast listeners, get 10% off their ticket, use the code latitudepods10 at checkout latitudemedia.com slash events. We will see you at Transition AI. Latitude Media, Podcast at the Frontier of Climate Technology. I'm Shail Khan, and this is Catalyst. If you ever went to IKEA and bought like four pieces of furniture the same type and constructed them yourself, the first one, you probably break it and have to go back and find a few things that you're missing. The second, third, and fourth ones, you're just knocking them out of the park in terms of how long it takes you to do it. And the same is true for nuclear, and that's just been proven over and over and over again. Coming up, new nuclear has come into the US, right? Do you want instant access to energy storage supplier pricing that's project-specific, or the ability to compare domestically-made battery and PCS options across the market? Anza now offers the industry's first battery energy storage data and analytics platform to make better development and procurement decisions. Anza provides in-depth commercial, technical, and risk data and analytics to help developers choose the best equipment for any project. Improve your returns and save months of evaluation time with Anza. Learn more about Anza's energy storage subscriptions at go.anzarenewables.com slash latitude, or click the link in the show notes. Imagine a world where connected devices like EVs, home batteries, and smart thermostats work together to support a more efficient and reliable power grid. Well, you don't have to imagine it anymore. This vision is a reality today, thanks to Energy Hub. With Energy Hub's Edge Derm's platform, utilities can create virtual power plants through customer-centric flexibility programs, making it easy to manage distributed energy resources and balance the grid. Unlock grid flexibility and reliability through cross-DER management with Energy Hub, the trusted Edge Derm's leader. Visit energyhub.com to learn more. I'm Shail Khan. I lead the Frontier Strategy at Energy Impact Partners. Welcome. All right, so I've been thinking about this. And here's the word that I would use to encapsulate what's happening in the US nuclear power market. It's a groundswell. I don't think anyone would deny that there's something happening here, driven by a combination of political support and load growth, off-taker interest, capital formation, possible regulatory reform. But let's be clear, it is still true that the US has built one, count of one new nuclear project in the past X number of decades. And that's why a groundswell feels like the right word to me, because sometimes a groundswell leads to a massive wave. But sometimes it doesn't. So in my mind, the operative question is in which direction we are headed here. We at EIP for disclosure do believe that there's a wave coming as evidenced by the fact that we helped to stand up and invested in elemental power, the peer play nuclear developer who's CEO Chris Colbert, you're going to hear from in a few moments. But there is still a lot of work to do to translate all this momentum and excitement into actual capacity on the grid. Anyway, elemental came out of stealth this week and announced a big partnership with Google to develop a three-site portfolio of at least 1.8 gigawatts of new nuclear in the US. See, groundswell. Anyway, there's a lot to talk about though in translating that to real action. And so we brought on Chris, who is the co-founder and CEO of Elemental. Prior to that, he was the CFO at NewScale, which many of you will know is the first SMR company to actually achieve design certification from the Nuclear Regulatory Commission. And again, for disclosure, as I mentioned, we at EIP are investors and elemental and I'm on the board. Anyway, here's Chris. Chris, welcome. Thanks for having me. Let's start by, I guess, getting your overall take on the state of the market, such as it is for new nuclear in the US. You've been in it for a while. What does it feel like? Like, where are we today? Yeah, so, you know, I have been in a while. I first was recruited over the nuclear in 2007 at the first nuclear renaissance. But it's been through its ups and downs since that time. But now I think that there's the right confluence of both market demand, investor sentiment, and regulatory and government policy to really make it happen this time. And we feel pretty well situated to make that happen in this marketplace. So I'm pretty comfortable with where it is and really excited about where we are given the journey I've been through with nuclear. Yeah, you said the first nuclear renaissance in 2007 or so. That one was a mirage, right? So the question is, is this one going to be different? Yeah, so, you know, there's a couple of reasons why I think it's different this time around is that the, you know, all the things that we've learned from that first renaissance and keep in mind, like the Vogel three and four project came out of that first renaissance. That's not a total mirage. Just a project. Just a project. Just a project, you know, and it had issues, but all the things that we learned from that first time around in terms of the policy, the offtake, the execution stuff, I think is now all available to us with people who are involved in that to make this, you know, next round be successful. But really the advent of the demand side where, you know, back in the 2000s, there was not really any demand growth. Now we're seeing phenomenal demand growth, which was strong to begin with, but just, I mean, really taken off with artificial intelligence driving it. And, you know, there's trillion dollar balance sheet from those hyperscaler companies that can really allow nuclear to flourish and happen this time around. That wasn't prevalent last time. Right. So I wanted to talk through this sort of where we are now through four lenses, which I think are the key lenses, and you've already alluded to a couple of them. But so one is offtake and customers. Second is suppliers, OEMs, like who's actually making reactors and of what kind and so on. Third is the role of the utilities, who obviously have a big role to play here. And then the fourth, maybe the big one at the end is the regulatory state of regulatory environment for nuclear projects and nuclear reactors. So the one you talked about the most already, we can just go through relatively cookie, which is the offtake side. What difference does it make? I mean, what I think historically, correct me if I'm wrong, anybody who's considering new nuclear in the United States wasn't really doing a corporate PPA type offtake prior to this new, this new wave right now, where obviously you guys just announced this big deal with Google. All the hyperscalers have made some kind of announcement or another on nuclear. So it feels like one big change there is of course there was low growth in general. But also you've got this class of corporate buyers that are generally universally leaning into nuclear and interested in doing something creative with their balance sheets, right? Going above and beyond just saying, okay, I'll sign up PPA when you get the price down sufficiently. Yeah, absolutely. The first time around it was all based upon regulated utilities getting the rate pairs to underwrite it. And at the time they were trying to underwrite $17 billion, $20 billion projects and their balance sheet or their market capitalization may be $20 to $30 billion. And the growth didn't show up and their expectation for high gas prices at the time didn't come to fruition. We had cheap gas. And so those two things really conspired against the demand side of it, where we have kind of the opposite, where we have pretty much all-time low gas prices but still a huge demand and requirement from the hyperscalers out there as corporate buyers that want reliable base load power and increasingly want to see it be clean and build for long duration so that they're going to have it available to them for a long period of time. So that has really changed from the first time around both in terms of what's driving the demand and the rest of the environment around it from a market perspective, really much better for nuclear this time than the first time. Can you talk a little bit more about what is the market or what should the market be asking of those hyperscalers of the buyers? Again, above and beyond, yes, we will sign a PPA if you get the price down low enough because there's a lot of risk to retire along the way in project development. And then there's also this question of how do we get the cost down in nuclear, which is at least in part a function of building multiple projects, not a single project and then driving down a cost curve. So I know the hyperscalers have been thinking about, okay, what can we do beyond the obvious PPA? How do you think about that suite of possibilities? That's been the biggest change from the hyperscalers probably in the last two or three years, Shell, is that, you know, when I was before I came to Elemental, I was at NewScale, and we talked a lot to the hyperscalers and really said in order for projects to go on, they needed to have some, you know, skin in the game or some exposure to the development cost because, you know, unlike renewables where the development cost might be in the tens of millions of dollars at most, it's hundreds of millions of dollars for nuclear and you can't just have a power purchase agreement to make that kind of investment as a developer. And, you know, it took a while for people to realize that that was what needed to happen. And, you know, necessities, the motherhood and invention is that once people realize that I need clean and large amounts of base-load megawatts, nuclear needs to be part of that. How are we doing before isn't going to work. That kind of moment really solidified over the last, you know, year and a half with the hyperscalers are saying, okay, I need to do more than just say, I'll write you a power purchase agreement. We're going to make some investment. They've made investment, you know, mostly in the technology, but increasingly, as a steal we're doing now with Google is in the upfront development, which is really the key part that needs to be re-rressed. Okay, so that's the customer slash off-take side. Let's talk about the supplier universe. Obviously, it used to be at NewScale, which was one of the suppliers OEMs in the space. But it's an interesting landscape there of like lots of activity, but also very few proven and or approved from a regulatory perspective products, I suppose, that you can buy as a developer. So, how do you think about that landscape? So, you know, we approach it in that there's been billions of dollars invested by these technology developers and either, you know, traditional light water reactors, which you call Gen 3 or Gen 4 reactors, which might be high temperature gas or sodium cooled. And they're all kind of nearing the end of their development process, where they're not quite ready yet. They're all kind of trying to solve for something, whether it's a supply chain or licensing or whatnot. So, we're technology agnostic and the belief that or the knowledge that we can go out and find sites that are amenable to the hyperscalers, what they need for off-take and location, that we can develop in a way that in a year from now or a year and a half now, we can pick the technologies that have made it through. They're sort of crucible of licensing and development and cost estimation that we can pick with confidence that we know what we're going to get, when we're going to get it, and what it's going to cost. They're almost there and, you know, I can't tell you which one of them is going to be successful, but there's so many of them out there that have invested so much. I'm very comfortable that there's going to be, you know, probably three or four at least that are going to make it through that part of it that will be successful in the long term. Just hard to pick now, but that's how we really see it. And if you look at the two different kinds of broad types of the fission reactors between light water and non-light water, the light water is 50 to 60 year old technology. They're just doing it with better designs that are safer and simpler and bringing the cost down. Sometimes smaller so they do more work in a factory versus doing it in the field. And then you have the non-light water types which, you know, have better safety characters and whatnot, but it may not be, you know, really quite ready from a supply chain or the fuel supply or some aspect of it, which probably will take a little bit longer to get confidence around that part of the OEM's equation. But certainly what we're looking for in the early 30s, in the late 30s, we think that that's the early 30s is the light water reactors and the late 30s is when we'll see commercially more of the non-light water reactors coming before. You mentioned briefly the question of scale. This has obviously been another hotly debated topic in nuclear world, which is, you know, historically we've built large mega projects pretty much exclusively. There are technology companies who are developing everything from micro reactors that are a megawatt or five megawatts or something like that up to, you know, gigawatt scale type reactors. The deal that you just announced with Google is for three projects of 1.8 plus gigawatts total. So 600 megawatts plus per project. Is that scale born out of sort of what you view as the sweet spot given the technology landscape or is that more a function of, well, this is the scale that a hyperscaler needs to fulfill the capacity of a data center or both. It's really both because we're solved for two things, right? One is they have huge needs, but they want to see us get down the cost curve, which means you need to have multiples. And when you look at the sort of intersection of doing multiples, the size of the need they have, the capital they can deploy, and what it costs for various, whether it's micro, small or large reactors, the small light water reactors fit more generally into that category, as well as some of the smaller Gen 4 reactors as well. So this is kind of anything from 75 megawatts to 300 megawatts electric. That fits pretty well because again, you get more swings at bad. So if you have one not work out, the other two will carry you through, which is how you want to see a portfolio work. And when you have multiples at a site and multiples in a deployment, you can get down those cost curves both in the factory and in the field more readily than you could with a large reactor. So that's really how we saw it playing out in real time. And the hyperscalers looked at all of them. And as our goal as elemental was to find the right solution that kind of threads in the needle between the OEMs, utilities, and the customers in terms of what makes the most sense. And that's where we landed up in our conversations with Google. Okay. So to sort of encapsulate what you're saying overall on the supplier side, your bet is that currently nobody's quite crusted over the commercial readiness hump yet. But you think there will be multiple vendors OEMs who will get there over the next year or two. And so you're basically positioning yourself to wait and see who gets through the crucible or over the crucible around the crucible, whatever the metaphor is meant to be. And then and then pick the winners there. But that's obviously contingent on anybody sort of like getting through and getting commercially ready, which maybe is a good segue to the next category here, which is the regulatory, the state of regulatory and permitting. Talk to me about where you see that. Yeah. So I mean, number of designs have gone through design certification process, which gets your license for your technology. Think about like Boeing gets their 787 jetliner approved. Some folks have gone out and gotten construction permits or their applying form. So that's getting the permission to start constructing it. Nobody's gotten yet to the point of an operating license where you get the ability to load the fuel into these new designs. So that's kind of like the remaining one. But for the light water reactors, this is really 50 year old technology being run by the Navy successfully for, you know, since the 50s and then commercial nuclear fleet since the 50s. It hasn't changed dramatically in terms of the fuel type or what you do. Basically, you know, you split atoms, create heat, make steam, turn a turbine, make electricity. It's that simple. So all these technologies are going to work. And I would point out that, you know, all the technologies that have been deployed just most recently, whether it's an EPR, an APR 1400 or an AP 1000, they may have had challenges getting to the finish line. But once they got to the finish line, they are all working and an AP 1000s working very well. So for light water reactor technology, there really isn't a technology risk. It's just pulling together the right pieces to, you know, de-risk it in the front end to get to a final investment decision and then start construction and have a solid plan to be successful when you get into the field. Because that's where the challenges have been traditionally. Do you see any evidence? There's obviously been a lot of talk about having the NRC reformed in some fashion or another to speed up permitting. Do you see any momentum there from the NRC? Has anything changed? Do you need anything to change there? So, you know, there's been a lot of legislation over the last several years really driving the NRC to revise his policies, become more balancing its approach for, you know, making sure they'll maintain the safety to the public and the environment. But, you know, recognizing that there is a public benefit for nuclear power given its clean base load attributes. That has been demonstrated by reduced timelines for them to review various applications that I've observed just in the 15 years I've been in the nuclear space where, you know, what once took four years is now being done in two years. The hope is that we'll get down to maybe a year, year and a half. But, you know, what you'd like to see is that for the base load technology, which is what it is, to be sort of in the same timeframe of development of traditional combined cycle gas plant, which might be, you know, two years of development and licensing and then two years construction and then, you know, four years or five years, you're operational. We're not there yet, but I do see a path by which you get down to from the seven to eight years we're looking at the first ones. They're getting down to five or six years, which to me really makes a game changer when people have their planning horizons. That brings it all forward to be a real equal discussion. And, you know, I think we're going to get there. And we haven't been getting there clearly. All right. So then the final lens through which to look at the current state of affairs, I think, is utilities who operate basically all of the existing nuclear in the United States. Georgia Power is the one company that has actually built a new nuclear generating facility in the past, I don't know, three decades, four decades, whatever it's been. And now they, many of them, are also exploring new nuclear. But I think, you know, coming into it, maybe a little bit more caution, at least than the hyperscalers seem to be. What's your perspective on what you're hearing from utilities? Yeah. So, you know, what I hear from utilities now is what I heard from utilities back in the past, right, is that, you know, they fundamentally can't take development risk. And, you know, that's a having done fossil plant development. I did that for 15 years of coal and gas plants. That's a business where you expect to make two or three times return on your investment, on the development of the FID. And that doesn't happen for utilities. They're stuck at 10%. Right. So they're taking three X risk for 10% return. It just doesn't work out for them. And, you know, we're seeing with a, with the many of them, not all of them, but many of them, is a desire to have a developer like elemental come in, align with the hyperscaler, take care of the commercial risk, take care of the development and the construction risk, and then transfer the asset at commercial operation when, you know, you can just look at what consolation trades that in terms of what their cost of capital is. Pretty easy from the do that, very huge markups and value to them to do so. Or they can operate the plant as the operator for in their territory. And we're looking at all those models with them. But, you know, what we really see is that the recognition that somebody needs to come in to take that development and construction risk, the government's taking a piece of it, but there's going to be a slice left over from the private sector. And utilities just aren't the right investor for that, because they're just a fundamentally different risk profile from what a developer does traditionally. I think the other thing we're seeing from utilities is interesting is like, that the subset of utilities that already have operating nuclear that either has retired already, I'm sorry, was operating and has retired, or is scheduled to retire, or that they were thinking about building, but then stopped building. I mean, they're all kind of re-examining all that and saying, oh, there's maybe there is a nuclear renaissance coming here. How do I take advantage of the fact that I do actually have experience in nuclear to get that capacity back online or online in the first place? And that seems kind of universal, right? Like, I feel like every utility in their boardroom, if there's nuclear somewhere in their fleet, or there was supposed to be nuclear somewhere in their fleet, they're taking a fresh look at it. Yeah, I mean, I think that most of these utilities that are operating utilities of nuclear plants, if they had the opportunity to pick up an existing operating asset or one that was largely complete and de-risked, they'd be very inclined to do it, because you just look at what constellation stock price has done. I mean, that's the example I look at since it floated. It's just been phenomenal returns because of the preponderance of nuclear in its base. And that's a purely merchant generator. It's not even a regulated utility constellation. It's phenomenal in terms of what it's done. But that just proves the value of nuclear to all these folks. It's how do you get the assets on there? And interestingly, through the investment that EIP made and elemental were exposed to a large number of those operating nuclear utilities. So we have that capability of working with them and they're familiar with what we're doing. And in part, validate what we're claiming to do, which is to really span the void between the billions of dollars that have been invested by OEMs doing new designs and the gigawatts of demand required by hyperscalers. How do you meet those two things and us coming in the middle and making that happen is really what elemental is about. Catalyst is brought to you by ANSA. ANSA offers a one-of-a-kind data and analytics platform and advisory services to support better project development and procurement decisions. For energy storage developers, ANSA's platform provides crucial information that you never had easy access to before. Now at your fingertips is real-time pricing for a long list of system configurations to suit any project. ANSA provides a 360-degree view of the market with lifecycle cost analytics and commercial technical and risk data. With ANSA, developers can easily determine which products to use in their designs, finance models, and RFPs. Learn more about how ANSA helps save time and maximize profit at go.ansarunuables.com.com. latitude. Catalyst is brought to you by Energy Hub. Energy Hub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. The Energy Hub platform takes the guesswork at a balancing energy supply and demand. It uses machine learning to control customer-owned distributed energy resources, like EVs, home batteries, and smart thermostats, to precisely shape load profiles for grid flexibility and reliability. As the industry leader, Energy Hub helps more than 80 utilities manage 1.6 million devices. That's more than any other edge derms on the market. Click the link in the show notes to learn more or go to energyhub.com. All right. I want to talk about project development for nuclear because I think it's actually something that people certainly we hadn't thought enough about before we started chatting with you folks and getting involved with Elemental. It's different and distinct from project development of a wind or solar project, for example, or a battery project, or even a gas or coal project. So you just give me a quick snapshot of end-to-end. What does project development look like for a new nuclear? We start off with, and this is the first thing we did, was we went out, find a customer, somebody who's willing to say, I want 20 to 30 years of power at this price range and willing to put in a portion of the development capital. That was probably the first 12 months of our existence was doing that with all the hyperscalers. Just Google happens to be the first one across the line on it. And then working with them saying, where do you need these assets and working cooperatively with them and their host utility? Because many times they're building data centers where they have existing data centers and they know the existing utilities. We're coming in saying, we don't want to get between you and your customer. We just want to give you what your customer wants in a way that works for you as a utility. That's a very different model from what you saw in the late stages of fossil, which I participated in, which was basically if you build it, they will come. Also with renewables, we'll go out and get a plot of land, connect it, and then go hunt for a PPA from somebody. We've reversed that process by putting the customer in the demand forest, then finding a site, working with utility, go through the red flags analysis of it, do it in a technology agnostic manner, which you can do in the NRC process under an early site permit application. And then once that's in, and you've gotten the site proven up from that perspective, and that's really the environmental characteristics of it, you then select the technology and do a construction permit that's particular to that technology. And that brings us to say 25, 26, we're doing that first part, 26 to 28, we're doing a construction permit, 29, we start construction by 32, 33, we're operating the plant. There's a lot more in there than what I just said, obviously, but there's a lot of pieces to it that's more akin to a fossil plant development, but just much more expensive because the amount of work you have to do with the regulator, any amount of design you have to have done. And the fact that unlike a two-on-one CCGT, which you can go out and talk to Siemens or GE or, you know, Alistomor, whoever's out there doing those now, they have proven designs. We're still getting through that end of the development cycle for the new technologies in nuclear. You talk a little bit more about the site selection bit. Like what are the, just at the high level, what are the characteristics, what are the checkboxes you have to check for a site to be suitable for new nuclear? So, you know, it comes down to what's the technologies by size you're looking at, because generally size dictates how much fuel you have on the plant, and the amount of fuel tells you how much danger or risk you have. So, the smaller plant size is the small modular act you're looking at for Google. It can probably fit about 100 acres or so or less, and you have no other consequences beyond that. But the sites have to be seismically, you know, qualified for the design you're building, and some designs are more seismically robust than others. So, you kind of have to envelope that part of it. You want to be sure you have access to transmission, because I'll tell you that, you know, it's going to be easier to permit and get a nuclear plant built than it is to get new transmission lines. And that's just historically how it's been, you know, everywhere I've been, whether it's in the US, the UK, Australia, over in Taiwan, Philippines, people think that somehow transmission is a uniquely American problem. It's not, it's a challenge wherever you go, because transmission lines are infrastructure that don't provide a lot of spin-off economic development for the people whose property it crosses. That's just the fact of life. So, you want to be close to that. But fortunately in the US, we have a pre-robot system where any former coal plant or any former large industrial site will typically have the transmission infrastructure necessary for it. So, that's the key piece of it. And then beyond that, it's pretty much, you can be in a lot of places. And we have a proprietary system that we've developed through a number of different databases and vendors that rapidly just select down those sites that meet those criteria, and then layering over it, where is it that our customer wants to be in the utility they want to work with. And that's probably the interesting thing, because people, started a lot of investors asking, like, well, what's the right place to be? And the answer is, the right place to be is where our customer wants to be. Well, where do they want to be? And what we found is that there is some geography to it, but they are more focused on who the utility is they're working with, because they feel they have a better relationship with some utilities than others. And given that they're going to be making these investments for assets that will provide benefit, not only to the hyperscaler, but also to the rest of the grid, because frankly, once you add a very robust nuclear plant to the system, it benefits everybody that's connected to it because of the reliability and the stability it brings to the grid. They want to make sure that they're getting proper benefit for that recognized and what they're doing. And, you know, some utilities are more evolved than others in doing that, or the discussions between the hyperscaler and utility are more evolved in that regard. So, you know, that's kind of the process that we've been going through in the site selection. And, you know, I would say that finding sites hasn't been the challenge quite honestly. It's making sure we know where the people want them. Once they tell us where they need to be, we can find sites. All right. I want to get to the, I guess, the last key questions about nuclear in the US, which are how much when and at what cost? Maybe we'll start with at what cost. You know, the knock on nuclear in the US has been to the extent that we've done any of it. It's been ended up being very expensive, cost overruns, et cetera, et cetera. And there's lots of different theories on how you drive down costs and lots of different examples from other countries, whether it's Korea or China or whatever it might be. Given your strategy, what is your thesis on how we get nuclear in the United States to be cheap enough to be economic for whoever the customer is? Obviously, it's a different answer if you're Google or meta or whatever versus somebody else. But like, clearly, we need to drive costs down. It's not entirely clear. The first project anybody builds is going to be the cheapest. So, what does it take? Is it just repeatability? Do the same reactor over and over again? Is it at a site level? Like, what's your thesis on cost? Yeah, there's probably two levels to it. One is repeatability, right? So, just doing a one-off design isn't going to work. And so, that's why it led us to the three projects with Google. Is three a good number? Yes. Would five be better? Absolutely. Does it need to be five? It would be a bigger check for people to write to do that. So, you have to be constrained by what that part is. And to put it mildly, you can't do enough large reactors in order and raise the capital to do it. It's just too much of a check to write to make it happen. So, you need that repeatability because Google and everybody we've talked to recognizes that, okay, the first one is going to be more expensive than the second one than the third one. And if I have a project that has two units on the site, the first unit on that site is going to be more expensive than the second unit on the site. That was true for Vogel. That was true for Baraka. That's true for any single, anytime you've looked at a construction that multiplied the same units in the same site. Units two, three, and four, you're amazed at how much less they are. But it shouldn't be surprising because if you ever went to IKEA and bought like four pieces of furniture, the same type and constructed them yourself, the first one, you probably break it and have to go back and find a few things that you're missing. The second, third, and fourth ones, you're just knocking them out of the park in terms of how long it takes you to do it. And the same is true for nuclear. And that's just been proven over and over and over again. So I think the key thing is that the repeatability in going in there with the mindset of you're doing multiples on a site and multiple sites really allows you to have the confidence because it's been demonstrated even at Vogel. Unit four, I think was 40% less than unit three. I mean, just think about that part of it. So if you start off at unit four, instead of unit three years example, you probably would have been OK. But that's not the way it played out. And then there's the site specific stuff, which, you know, again, lessons learned is just make sure you have a good plan going in. And we all know what a good project looks like. You have to go through and have the design complete, have the supply chain lined up, and more importantly, have a plan for attracting the labor you need when you start and keeping the labor there for the three years you need it. And that's, you know, not that hard. You just going to be able to, as an owner, admit that if I have to pay a person $5 extra an hour to keep working my project as opposed to going down to the data center project down the road, then you pay that because if you don't, the cost for delay is not $5 an hour. It ends up being five times that. So it's really kind of having a plan and sticking to it and working with labor, because that's the most uncontrollable aspect of this because, you know, we're a free country. And labor can go where it chooses to go. You're not going to prevent that. So your best goal is to make sure you incentivize them properly and treat them well. And you should have a successful project. All right. So that gets to our final question, which is how much and when, not specific to elemental, but what's your view? I mean, you did mention some timelines for projects you guys are working on where you expect commercial operation in the early 2030s. Realistically, given what you see out in the landscape in general, how soon do you think we could or will have new nuclear operating in the United States? And how much can we get in like the timeframe that that matters to today's customers? Yeah. So, you know, our goal was to have a gigawatt under construction by 2030, 10 by 35 and 100 gigawatts by 2040. We're now looking at 4.2 gigawatts by 2030. So you've already quadrupled that or halfway there to our 2035 goal. You know, I think realistically for commercial deployment, it's going to be the early 30s. OPG is just in Canada. So it's not part of the United States yet. It's not Tario Power Generation. Yet that Ontario Power Generation up in Canada, they're talking about their first plant being a G E H B W X 300 starting construction, nuclear safety related construction. This month or next is what they had announced to have an announced it yet. Then being operational by 2029 2030. So North America, that's the timeframe. You have others like Dominion, Duke, TVA, AEP, a whole tech with their plant out of Palisades, all talking about a light water reactor, small ones in the early 2030s timeframe. So I think that's still a pretty good prognostication on it in terms of when we'd expect to see it. Arguably some are further ahead than others. But again, whoever starts first doesn't mean they always finish first. But I think for a number of reasons, we can see these folks being available and working those projects in the early 30s. In terms of the cost, the first ones are going to be expensive. But overall, we're looking at once you get down the curve of probably $10,000 a kilowatt. So if you have a 600 megawatt plant that be about $6 billion, the first one might be 15, 20% more than that. The follow on it's going to be less and less and less. So we expect these to come down fairly dramatically over time as we get through it. But getting through the first one is key. And we have a plan for doing that to be successful. And we have great support from folks like Google who recognize that, OK, I'm willing to accept the first one is going to be more expensive. But I'm sure as heck, not going to accept it the second and the third one costs the same. And they won't. We're comfortable with that. All right, Chris, great to finally be able to talk about this publicly excited to go on this new nuclear journey with you for the next hopefully decade and not decades. Well, I've already been at it for 15. So it's another 20 or so, right? That's right. Yeah, I'm with you. I expect to have 10 gigawatts by 2035. And you can hold me to it. I plan to. All right. Thanks, Chris. This is great. Chris Colbert is the CEO of Elemental Power. This shows a production of latitude media. You can head over latitude media.com for links to today's topics. Latitude is supported by Prelude Ventures. Prelude backs visionaries accelerating climate innovation that will reshape the global economy for the betterment of people and planet. Learn more at PreludeVentures.com. This episode is produced by Daniel Waldorf, mixing and theme song by Sean Markwan. Stephen Lacey is our executive editor. I'm Shale Khan, and this is Catalyst.",
    "release_date": "2025-05-09",
    "duration_ms": 2427000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI2246629710.mp3?updated=1746760439",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-06-05T02:01:46.479418"
  }
]