[
  {
    "title": "What to make of Trump's deep-sea minerals push",
    "description": "In April, the Trump administration issued an executive order to accelerate the development of deep-sea minerals — part of its broader push for “energy dominance.” The world’s oceans hold vast, untapped deposits of critical minerals like nickel, copper, manganese, and rare earth elements — all essential to batteries and clean energy technologies.\n\nDespite decades of interest, no commercial deep-sea mining project has begun production. The reasons? Regulatory uncertainty, environmental concerns, and the complexity of processing polymetallic nodules.\n\nSo what does this new executive order actually do?\n\nIn this episode, Shayle talks to Hans Smith, president and CEO of Ocean Minerals, a company participating in exploration of the Cook Islands. Shayle and Hans cover topics like:\n\n\n  \nWhat the Trump executive order mandates — and its legal limits\n\n\n\n  \nThe bottleneck of U.S. deep-sea exploration \n\n\n\n  \nThe controversy about U.S. legal authority over international waters\n\n\n\n  \nThe economics and geopolitics of deep-sea hotspots like the Clarion-Clipperton Zone, Japan, and the Cook Islands\n\n\n\n  \nThe technical challenges of refining polymetallic nodules\n\n\n\n  \nCapEx, OpEx, and barriers to commercial deployment\n\n\n\n\nResources:\n\n\n  \nCatalyst: Mining the deep sea\n\n\n\n  \nWorld Resources Institute: What We Know About Deep-Sea Mining — and What We Don’t\n\n\n\n  \nReuters: Trump signs executive order boosting deep-sea mining industry\n\n\n\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.\n\nCatalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, and increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data plus tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.\n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "Latitude Media is hosting the fourth Transition AI Conference on June 12, 2025, focusing on energy infrastructure in the era of AI-driven load growth. The event brings together industry experts like FERVO Energy, Form Energy, and more to discuss meeting data center demand creatively. The podcast also delves into deep-sea mining, highlighting the recent Trump executive order supporting exploration, particularly in the US exclusive economic zone and international waters. Challenges include regulatory frameworks, environmental impacts, technology, and refining processes. The Cook Islands and Japan are leading in deep-sea mining exploration, with licenses awarded for polymetallic nodules. The Cook Islands have advanced regulatory frameworks, while companies are progressing towards applying for mining licenses.",
    "transcript": " Mark your calendar for June 12, 2025. Latitude Media is holding its fourth transition AI conference in Boston. This year's theme, energy infrastructure in the era of AI-driven load growth. We're going to bring together investors, developers, researchers, and tech companies to talk about the creative ways to meet data center demand. And companies include FERVO Energy, Form Energy, Scale Microgrids, Spark Fund, KKR, Generate Capital, Orenia, FlexGen, National Grid Partners, and more. Plus, we're going to have a live open circuit episode featuring Caroline Golan from Google, and a live green blueprint episode featuring Rick Needham from Commonwealth Fusion Systems. Get your ticket at latitudemedia.com slash events, podcast listeners, get 10% off their ticket, use the code latitudepods10 at checkout latitudemedia.com slash events. We will see you at transition AI. Latitude Media, covering the new frontiers of the energy transition. I'm Shane O'Con and this is Catalyst. You know, there's this perception that the EOS been signed and this is a, you know, it's like flipping a light switch. All of a sudden it's going to go from nothing to everything. What this action has done is that it's taken DSM and put it into the spotlight. Coming up, going deep underwater for energy dominance. Do you want instant access to energy storage supplier pricing that's project specific? Or the ability to compare domestically made battery and PCS options across the market? Anza now offers the industry's first battery energy storage data and analytics platform to make better development and procurement decisions. Anza provides in-depth commercial, technical and risk data and analytics to help developers choose the best equipment for any project. Improve your returns and save months of evaluation time with Anza. Learn more about Anza's energy storage subscriptions at go.anzarenewables.com slash latitude or click the link in the show notes. Imagine a world where connected devices like EVs, home batteries and smart thermostats work together to support a more efficient and reliable power grid. Well, you don't have to imagine it anymore. This vision is a reality today, thanks to Energy Hub. With Energy Hub's Edge Derm's platform, utilities can create virtual power plants through customer-centric flexibility programs, making it easy to manage distributed energy resources and balance the grid. Unlock grid flexibility and reliability through cross-DER management with Energy Hub, the trusted Edge Derm's leader. Visit energyhub.com to learn more. I'm Shale Khan. I lead the Frontier Strategy at Energy Impact Partners. Welcome. All right, so it's been a couple of years, I think, since we talked about deep sea mining here. So here's a quick reminder of why it's interesting. At the bottom of the ocean, in certain places, there appears to be an enormous volume of these golf ball-sized rocks. They are polymetallic nodules, and they appear to be basically a rock full of battery minerals, essentially. I think nickel, cobalt, a lot of manganese, and copper. And in some cases rare earths as well. And there are literally trillions of dollars worth of these rocks just waiting to be hovered up and used to displace terrestrial mining. But for at least four things, one is a regulatory regime that doesn't fully exist yet for exploitation of deep sea mining, at least in some locations. Second is a heated battle over the environmental impacts of extraction. Third is the actual CAPEX technology and resources it's going to take to do it. This is mining, it's not cheap. And fourth is what you do with it once you get it, i.e. refining. Anyway, one thing that wasn't on my bingo card when we talked about this a couple years ago was that President Trump, in his second term focus on energy dominance, would find his way to deep sea mining and issue an executive order intended to speed up the market, at least for the United States. So for this one, I brought on Hans Smit, who is the president and CEO of Ocean Minerals, one of the companies that is exploring for deep sea minerals in the Cook Islands currently. Here's Hans. Hans, welcome. Thank you. Let's start by talking about this Trump executive order on deep sea mining that came out a few weeks ago. Now, maybe start by just explaining what's in it. Well, I think the key important thing about the EO is the fact that the US has now publicly come out and said that it supports looking into deep sea mining and has directed the US government to take positive and proactive action to help get this off the ground. I think that's the big thing that that executive order is done. And I think the other important thing about the executive order is that it has stipulated that it's not just US territorial waters. This is international waters as well as other exclusive zones. So what Trump has come out and said is, let's look at deep sea mining as part of the solution, but let's not just focus on US areas. Let's look at all projects and see how we can use them to solve this problem we have with critical metals. Which has become a bit of a point of contention, the part about operating outside of US exclusive economic zones. Maybe that's a good opportunity to step back for a second. Can you walk through the different regions where there is deep sea mining exploration or potential production to be had and where the authority and control over them sets? Yeah, essentially the two areas. You have the exclusive economic zone, which is the territorial waters of any country. So it's that country sovereign waters and the country's sovereign right to do whatever they decide to do within that region. And then we have what is known as beyond national boundaries, which is international waters. So those are all the areas outside of the exclusive economic zones. And the key difference between the two is during in an exclusive economic zone. It's the work that anybody does is subject to the rules and the law of that country. When you go into international waters back in 1984, uncloss, which is the United Nations law of the sea was ratified. And that is now under the auspices of the United Nations. And I think there are about 136 countries that have signed up to it. However, the US has not signed up. They have not ratified that. And in the international waters, it has been deemed since the signing of uncloss that that would be regulated by the United Nations and specifically the ISA, which is the international sea bit authority. And so that's where a lot of the, you could tell me if I'm wrong on this, but a lot of the early activity in deep sea mining world has been in international waters, particularly in this area called the Clerian Clipperton Zone. Is that because the understanding is that the resource is especially attractive there? Is that just because international waters, ISA regulation has been attractive to go after? Yeah, look, I think it's been done there because countries wanted to be sure that they didn't not mess up. So in a sense, there was a fear of missing out. So when that got ratified, all the major nations throughout the world made sure that they staked their claim. And they were participating in what was being released under the ISA. What happened when you stake your claim and you now take responsibility for that area, the onus is on you to execute a certain amount of work on that area. You cannot just sit and squat in the land. You need to show that you make in progress. So I think that was why there was a lot of work done in the Clerian Clipperton Zone. Also, a lot of that work was funded by governments. So there was a source of funding that was available to make sure that that work happened. And that work has been invaluable. You know, since 1984, there's been a lot of exploration work there. There's been a lot of money spent there. The European Union has spent a lot of money developing technology and equipment, so have the Chinese. So I think in general, it has been incredibly positive and incredibly useful for underwater mining specifically in that region. And giving us a good understanding and serving as a great foundation for developing guidelines and procedures and methods for doing this type of thing. Okay. So back to the EO. The EO pertains both to the US exclusive economic zone where there had been very little activity prior to this, as I understand it. So I'm curious what you think this might actually result in. But then is it essentially saying beyond US exclusive economic zone, this is the Trump administration saying we are interested in deep sea mining exploration and production. And we have not signed on to the treaty that would make us a part of the international seabed authority. And so we're sort of competing with the rest of the world for those resources. Is that the right way to think about it? I think there are two parts to that question. Firstly, the EO says exclusive economic zones are not only of the US, but in any country. There are other countries, Japan, Cook Islands, Papua New Guinea, who currently are actively working in their exclusive economic zones developing these resources. In the US, there hasn't been very much, if any, work in the exclusive economic zone of the US. But that is due to a regulatory issue rather than anything else. And then with the EO saying in international waters as well, this is where things start becoming a little more vague and a little more challenging. As you would note in the press, since that has been announced and the metals company have indicated that they want to use the EO and apply for licenses through the US laws to mine in international waters, there's been some surprise and there's also been some resistance to that. And I think this is something for the lawyers to get into and figure out how the metals company and the US with the EO are going to go and work in international waters without taking into consideration the precedent and the regulatory authority of the international seabed authority. So I think there's still a lot of stuff to be worked through and a lot of issues to be resolved in international waters. But in exclusive economic zones, it's pretty clear. They are laws in the US that allow companies to go and apply for expirational mining licenses. However, the current structure of the legal framework in the US is not very encouraging. So we as a company, for example, are not inclined to explore in US territorial waters because our investors are not given the kind of assurances and rights that we would get in other areas that would allow us to get a return on an investment if we were to spend tens of millions of dollars. So that raises this obvious question, which is, is this EO, we don't have to talk exclusively about the US because it is where the minority of activity is going. But just because there is this recent EO, is it going to do anything? Are there other factors that are stopping the US from doing serious exploration for deep sea mining that this doesn't change? And so as a result, it's just going to be sort of a piece of paper. I don't think it's going to be a piece of paper. I think the EO has got incredible value and has got incredible merit. But I don't think it's necessarily going to be the solver bullet that certain people think it's going to be. There's this perception that the EO has been signed and this is a, it's like flipping a light switch. All of a sudden it's going to go from nothing to everything. It's very rare that that is the occurrence of this type of action. What this action has done is that it's taken DSM and put it into the spotlight. It has brought the world's attention to a nascent industry that up until the EO has been in existence, but it's kind of been on the sidelines, been in the shadows, so to say. And this has really brought it into the, you know, into focus. And that has been, you know, very clear from my side, for example, over the past three weeks, once the EO had been, you know, been published and people had time to work through it, I've been getting a lot of people phoning, wanting to speak about DSM, wanting to better understand what's going on, wanting to see what the prospects are, wanting to understand, you know, what is the real story? Because everything that they've seen prior to this has been predominantly dominated by the anti-contingent who have been out trying to get moratorium in place. And what this has done has brought this sort of mainstream media and the mainstream interest into DSM. And that for me is a big, big step in the right direction. And it's also a great opportunity to create visibility, because the issue we've had has been a lack of visibility, a lack of understanding and a lack of context. And the EO certainly does address that. So I think it's valuable in that perspective. Catalyst is brought to you by ANSA. ANSA offers a one-of-a-kind data and analytics platform and advisory services to support better project development and procurement decisions. For energy storage developers, ANSA's platform provides crucial information that you never had easy access to before. Now at your fingertips is real-time pricing for a long list of system configurations to suit any project. ANSA provides a 360-degree view of the market with lifecycle cost analytics and commercial technical and risk data. With ANSA, developers can easily determine which products to use in their designs, finance models and RFPs. Learn more about how ANSA helps save time and maximize profit at go.anzerannuables.com slash latitude. Catalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. The EnergyHub platform takes the guesswork at a balancing energy supply and demand. It uses machine learning to control customer-owned distributed energy resources, like EVs, home batteries and smart thermostats to precisely shape load profiles for grid flexibility and reliability. As the industry leader, EnergyHub helps more than 80 utilities manage 1.6 million devices. That's more than any other edge derms on the market. Click the link in the show notes to learn more or go to energyhub.com. Okay, so before we move on from the US to talking about what's going on in the rest of the world, apart from sort of a less than ideal regulatory environment, are there other things that are going to be bottlenecks in the evolution of deep-sea mining within the United States? I mean, are we going to see significant exploration activity during the Trump administration before new administration takes hold and could make a bunch of changes if they so desired? Well, I think the key bottleneck with the US exclusive economic zone is the manner in which the US approaches mineral resource development. They've modeled the deep-sea mining of minerals and minerals in the ocean on the oil and gas model where the exploration work and a lot of the geophysical work that is that underpins this is done by the US government. And then based on that interpretation, they determine areas of interest that they put out on public lease for companies to bid and tender on. Now, the issue is with the deep-sea mineral space, is that means the likes of Boem and Noah have to go and do all of this work throughout this massive body of water. And they need to determine where exactly these mineral deposits are. Pull all the information together that would make it attractive for a company like us to bid on a lease. And the issue that you have is this is going to take multiple years of just exploration, sending ships out there and covering tens of thousands of square kilometers of the ocean. And I think this is going to be the problem. Noah's boats are already booked out for the next two to three years, possibly even the next four years. So before you can repurpose those vessels to specifically go and address this task, you have these jobs that they need to do, or you have to go and sacrifice those jobs and refocus them on this. And I think neither one of those is a great idea. What I would suggest is that the US take a leaf out of what everybody else is doing, where what they do is they put the onus on the person wanting to develop the resource. So if I use the example of the Cook Islands, for example, the government there has said to exploration companies, we will give you an exploration license that will give you exclusivity over that area for you to do your exploration. If you find resources within that area, you then have first right of refusal to apply for a mining license over it. So now I have done a couple of things. One is I've put the onus on companies that specialize in finding minerals to go and do the research and the exploration work in order to find them. And in return for that, what they are going to get is the right of first refusal to commercialize that. So the money that they invest, they get paid back through the project becoming commercial. And the benefit of that is you have people that specialize in this driving the process of doing it. So I think there's an interesting challenge that the US faces at the moment. If they want to follow through and deliver on the EO, I think there is a need for some significant changes that need to be done with regards to how they doing it at the moment. And if that is too big of a challenge, just change the contracting model. Don't rely on NOAA and BOEM to do it. In addition to that, look at some way of privatizing that exploration and giving people that specialize in it to help those agencies get to the point where commercialization of the resource in US territorial waters becomes a reality. Okay, you mentioned the Cook Islands. So moving on from the US, my sense is that the Cook Islands is furthest along here. Is that in terms of general exploration and moving toward actual deep sea mining? Do you agree with that, as anywhere else that you would put on the same levels of the Cook Islands? No, I think that would be a reasonably accurate statement. I think the country that is coming up close second to that would be Japan. Japan last year announced a fairly significant nodule field in their territorial waters and they are now moving forward with that development and that program under the guidance of the University of Tokyo. I think the Cook Islands are ahead of Japan in the fact that the Cook Islands have the regulatory frameworks in place to go from prospecting exploration and exploitation with a great environmental requirement and plan in place to make sure that there's no significant harm as a result of that. The Japanese still need to place some catch up there. So I would say between Japanese territorial waters Cook Islands, they certainly are as far as polymetallic nodules are concerned, certainly leading the way as far as deep sea minerals are concerned. Okay, so what is the latest in the Cook Islands? Who has got licenses to do what? How far along are they just orient me in terms of given the Cook Islands as the leader? Where are we? Yeah, so the Cook Islands back in 2022 awarded three exploration licenses to three different companies. So the first company is a company called Mahana Minerals, which is owned and operated by a US-based company called Ocean Minerals. You have CIC is the second license holder and then the third license holder is a joint venture between a Belgian company and the Cook Islands Investment Corporation, which is a government company that is focused on developing businesses within the Cook Islands. So those three companies have been awarded exploration licenses. Those licenses are five years in duration and the companies are currently in year four. And the intention and the plan of these organizations and Mahana Minerals is the company that I work for. The intention is in the next two years or so to apply for our mining licenses. So we are currently all embarked on the environmental data campaigns, collecting all the information so we can make the case for minimal environmental impact. But we also have our mining systems developed in our case and as well as the processing of the modules. So putting it a different way, we probably two to four years away from first production is where we are in the Cooks. You mentioned environmental data collection and trying to minimize environmental impact. Obviously that's been an area of contention historically, as you mentioned, with activists pushing for a moratorium and so on. From your perspective, is there a technical, is there a technological challenge in how do we actually extract resources while minimizing environmental footprint or is the technology known and proven already today? And it's just a matter of implementing it. The technology is known and proven and it has been proven and incidentally, the first time it was proven was back in the 1970s. So the tech for this has been around for multiple decades. As far as the environmental side is concerned, that's where the ISA comes into the picture. The work that the ISA has done over the past 20, 30, 40 years has been massive because it's really helped us focus on the specific areas where the impact would be and the technologies have obviously been modernized and updated to further reduce those impacts. So I think as a whole, the technology is there, how we apply it is well understood. What we are doing is establishing all the baseline data. To give you an idea, when you build a home, one of the things you have to do is look at the environmental impact of building your home. But the benefit you have is all the environmental data that exists. So you are very easily and quickly able to look at what the impacts of building your home would have. In the deep ocean where we are operating, we don't have that baseline data. And that is why we spend three, four years collecting that baseline data so that when we make the statements in our environmental impact statement, talking about what the impacts would look like, we are doing it from a data source and an unknown reference. And this is a process that will continue going on way beyond commencing of this operation. We have this plan called adaptive management, where we continually update the data we're collecting and how the systems operate and we keep refining and improving. The other technological question that I've heard that I think is kind of interesting is not about extraction so much as it is about refining. You mentioned you might be two to four years out and you and a couple others, two to four years out from production. So I understand that the challenge here is, okay, you get these polymetallic nodules, you extract them from the ocean floor, they contain a mixture of valuable minerals. They contain nickel and cobalt and copper and manganese. And our existing mineral refining, which we do from terrestrial mining, is not really set up for that because we don't have these polymetallic nodules in the same way on the ground or under the ground rather. And so what we have right now is a big refining industry set up to basically extract a single mineral, generally speaking. So does this mean that you are going to end up having to or having to find somebody set up some new refining infrastructure? Is that new technology? What does that look like downstream of extraction? So I think there are a couple of things to unpack. I think the first one is that we've recently started hearing a lot of noise about the processing technology doesn't exist. And that's an interesting shift in the arguments against why DSM should not go ahead. Because the reality is quite different. Yes, we have a polymetallic resource. So we have, as you mentioned, nickel, copper, cobalt, manganese, and in the case of the Cook Islands nodules, ray earths as well, which is another thing everybody's hot about. But the only part that we've had to crack and unlock is not the separation or the refining, because the separation or refining that exists with all these other mining industries is exactly the same technology that we're going to use to pull out those specific metals out of the nodules. So it's actually a benefit for us that all this knowledge and technology exists for selecting all those different metals. What is different for us is two things. The first one is the nodule is in the form of a golf ball size rock. And what we have to do is we have to get all those metals into, we refer to it as into solution. The best way to explain it is if you take table salt and you pour it into water and you dissolve it, it goes from sodium chloride, which is salt, and when you dissolve it, it becomes sodium ions and chloride ions in water. We do exactly the same thing, but instead of using water, we use acid. And what we do is we crush the nodules and we use acid and we dissolve all the metals. Now all the metals are floating around in this liquid and we apply all those existing technologies to strip them out. The only difference is we need to figure out in what sequence to pull them out to get the best results. You need basically a train of existing technologies. If it's a nickel mine or a nickel refining operation, you're just trying to pull out the nickel, you're going to do that, but then you also have to pull out the manganese and the copper and the cobalt. Now what that does is it starts creating some interesting possibilities for us. So nickel mines and copper mines are nickel cobalt or copper cobalt, so they bring up both those products. So one of the things we can do is create a nickel cobalt or a nickel copper cobalt hydroxide and we can send it to one of those existing facilities and they can pull them out. Or as you said, what we do is we build our own facility, but instead of having to invent a new process, we build an existing facility and we go to these different industries and we just go and take that building block that they've used and we put it into our plant. And this is all chemistry. So what you're talking about is big tanks with pumps and circulatory circuits and what you do is you either use electrolysis or you use chemistry to cause the metals to sink or to float and it's easy to separate them out or you just have them precipitate. In other words, you dry them out. So there's nothing unique, strange or different about what we're doing. It's just again like we did with the mining system, we're using different technologies that exist and we are just putting them together in a different sequence. And yes, we'll have to build a new processing facility, but that is no different to any mine. If you go to any mine on land, the processing facility is going to be built in order to meet the uniqueness of the chemistry of that particular mine. So every process plant that you go to is normally tied to some mine or some supply and there's uniqueness to it. It doesn't make us any different. If not a technical question, it is certainly a capital question. So maybe, I guess, final topic for us is to talk about capital formation here and not just for refining, but also for extraction. Or even on capex or an opx, I suppose, just on the extraction portion relative to a terrestrial mine, what should we be thinking about? Well, I think the first misperception that we hear often is that it can't make money because it's complicated and very expensive. And I think there are two parts that the complicated and expensive is all relative because at the end of the day, profitability of a mine is the difference between operating costs and revenue. And in our case, yes, we have got these ships that are going to see and they are operating in the ocean. And it is deemed to be expensive because we're working at great depths. However, we don't have all the big capital costs of infrastructure, power lines, roads, rails, dams, et cetera, which means the cost of capital for us is going to be lower. We are going to spend less money building a ship to go mining there, what you will do, perhaps building a brand new infrastructure in some outback area. So that's one aspect of it. The other thing to consider is that we are bringing up one ton of material. And in that one ton of material, we are producing the same amount of metal as you would need to have anywhere between three and five land-based mines. So for them to get the same amount of metal that we're getting because of our high grade and the fact that they multi-metal, you could end up moving anywhere between four and eight times the tonnage of raw rock to get the same metal. So those are the aspects that people don't understand because they haven't looked into the specifics. So when it comes to economics, we're moving less tonnage, we're getting more metal. The revenue we get in per ton is much higher, even though our up-ex cost per ton may be higher than dump trucks running with front-end loaders. But the revenue is certainly there that's offsetting that. It's like an up-ex cap-ex trade-off and you get a higher value product per unit volume or per unit weight. Absolutely. Yeah. At the end of the day, there are two things you need to look at. You need to look at what is the return on your investment. So for in our case, the mining system cap-ex is around $500 million. The processing plant, probably around $2 billion. But what for that investment do you get in return for your project? So our project is in anywhere between three and four billion dollar project that's going to yield in the region of $500 million of free cash flow per year. Put that in front of any land-based miner and they'll be falling over you to fund that project with IRRs in the 30s, 40%. This project, when you look at the economics and what it yields is a no-brainer. What we just have is the stigma around underwater in the ocean and a lot of the misinformation that has been put around it. I would really love to get into a situation where people just park their motions and look at it purely on merit from an environmental impact perspective, from a cost perspective, from just an overall impact of this generally. And just look at what we are going to get from it. I think they'll be pleasantly surprised. We talk about that free cash flow number. There's obviously an assumption embedded in there as to the price you can get for the minerals that you're extracting. I think one of the things that's interesting that here is that because you're polymetallic, rather than being subject to a single volatile commodity, you've at least got multiple. You could imagine prices for manganese spiking and nickel crashing at the same time and you end up in a wash or something like that. It's beneficial in that context. But obviously, particularly with nickel, we've seen prices low recently relative to history. How do you think about the volatility of those commodities? Obviously copper probably being the least volatile, but also probably a small portion of the value stack I would expect for a given polymetallic nodule. What matters, which minerals matter the most and how do you think about price volatility? One of the things we do for our investors is obviously a sensitivity analysis. One of the interesting things we are able to show is that with the recent crash of the cobalt price and nickel for all sorts of reasons, and that's the topic for a whole different discussion. But particularly those two metals with the depression on their prices, our project remains profitable. The reason it's profitable because of the manganese is by far the biggest component to what we're doing. The manganese market is so massive that it has a certain amount of robustness just due to its sheer volume and size. The other thing we hear from people is, are we going to come into production and we're going to have a negative impact on the market because of the volumes we bring to the market? That's not going to happen with the manganese market either. What we have is manganese is a great stabilizer and it allows us to be able to ride through the fluctuations we see in the nickel and cobalt prices. But at the recent low prices, the project has remained profitable. At the prices we're projecting at the time that we go into production, obviously it makes it really interesting as to the kind of returns that this project can yield. Thank you so much for the time. This is super interesting. I'll catch you in two to four years when you're pulling up commercial volumes. Look forward to it. Thanks very much. On the smit is the president and CEO of Ocean Minerals, one of the companies that is working on an exploration license in the Cook Islands. This shows a production of latitude media. You can head over to latitudemedia.com for links to today's topics. Latitude is supported by Prelude Ventures, Prelude Bex Visionaries accelerating climate innovation that will reshape the global economy for the betterment of people and planet. Learn more at PreludeVentures.com. This episode is produced by Daniel Waldorf. Mixing and theme song by Sean Markwan, Stephen Lacey is our executive editor. I'm Shale Khan and this is Catalyst.",
    "release_date": "2025-05-22",
    "duration_ms": 2224000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI3479416220.mp3?updated=1747884584",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-29T01:46:06.571571"
  },
  {
    "title": "A former race car engineer on battery safety and supply chains [partner content]",
    "description": "From his days as an IndyCar race engineer to his current role as chief product officer for a leading storage integrator, Tristan Doherty has always worked at the intersection of high performance and risk management. \n\nToday, he's applying that expertise at LG Energy Solution Vertech to build more resilient, domestically manufactured energy storage systems for America's evolving grid.\n\nLG Energy Solution Vertech is the US energy storage division of LG Energy Solution, which has committed $1.4 billion to manufacture batteries in the U.S., creating a hub capable of producing 16.5 gigawatt-hours of energy storage cells annually. This investment is part of the company's long-term strategy to diversify supply chains.\n\n\"We're on schedule for early next year to be a hundred percent non-Chinese in terms of all of the components and sub-components going into those ESS cells,” says Doherty.\n\nThis manufacturing strategy is critical in a moment of trade uncertainty. While LG Energy Solution's substantial resources allow it to weather these challenges, smaller players in the supply chain face greater difficulties. \"We're seeing projects that are being paused, that are being delayed. We're seeing suppliers that are rethinking their strategy...the goalposts are continually shifting.\"\n\nBeyond manufacturing, LG Energy Solution has transformed its approach to system integration. Rather than simply connecting batteries to the grid, the company now designs comprehensive power solutions with grid needs as the starting point. Doherty describes this as \"flipping the script\" from an inside-out to an outside-in approach.\n\n\"The direction of design decisions and the direction of design intent has kind of flipped 180 degrees,\" he explains. \"It's creating much more effective and much more powerful designs.\"\n\nThis evolution in design philosophy extends to safety considerations as well. Following incidents like the Moss Landing fire, the industry has increasingly shifted toward containerized solutions that compartmentalize risk. According to Doherty, this approach, combined with other innovations, has contributed to a 97% reduction in energy storage system failure rates.\n\nAs unprecedented demand growth from data centers, electrification, and manufacturing transforms the grid landscape, Doherty sees energy storage playing a central role. \n\n\"We've made immense strides and we've figured out a whole lot of really interesting and fascinating ways of using batteries. But I think there's a whole bunch more to come.\"\n\nThis episode was produced in partnership with LG Energy Solution Vertech. LG Energy Solution Vertech is the U.S. energy storage division of LG Energy Solution, here to be your lifetime energy storage partner. Learn more about the company's approach to safety, performance, and its commitment to the U.S. market.",
    "summary": "Tristan Doherty transitioned from computer engineering to mechanical engineering, eventually becoming a race engineer for an IndyCar team. His experience in high-stakes racing led him to his current role as the chief product officer at LG Energy Solution Vertec, focusing on large-scale storage projects and improving battery safety. The discussion also delves into the recent fire at a lithium battery storage facility, highlighting the industry's shift towards containerized systems for safety. Tristan emphasizes the importance of quality, innovation, and vertical integration in advancing battery technology and navigating challenges in the US supply chain amidst trade uncertainties.",
    "transcript": " This is a branded podcast from Latitude Studios. In the late 1990s, in the middle of the dot-com boom, Tristan Doherty thought he wanted to be a computer engineer. I got about halfway through my undergrad and I decided I didn't want to make little black boxes with blinky lights on them. I thought that was probably not very exciting. So I moved into mechanical engineering and I wanted to make robotics. I wanted to do stuff where I took control systems and impacted the real physical world. Tristan pursued projects that were far more interesting than boxes with blinky lights. He was on a university team that designed a formula-style race car. He designed interactive art that integrated technology. And at the end of school, he faced a question that lots of people grapple with. And I sort of had to make a decision at the end of that and I said, well, what's my true calling? Where am I being pulled? And at that point, I was being pulled back into car racing. Tristan went all in on racing. He started as a data acquisition engineer who analyzed tens of thousands of data points coming from a race. And he eventually became a race engineer for an IndyCar team who called the shots on the setup of the car. And ultimately, it's me on the radio saying pit pit pit and a lot of stress, a lot of pressure, but very rewarding. Car racing is a very high-stakes sport. It requires a team of engineers like Tristan to analyze data and make real-time decisions about how to operate the car. And as he told Stephen Lacey, once small mistake can be catastrophic. So it was really sort of a fascinating culmination of a lot of different areas that came together. In racing, you have this huge, obviously, technology piece of it. You have a big sports piece of it. You have a logistics piece where you have to make it to race day. And layered on top of that is the sort of psychology aspect of dealing with a driver and dealing with the teams. Were there any harrowing moments? What kind of problems were you having to overcome? Oh, there's a lot of problems in racing. There's a lot of chaos. I remember vividly once in Australia, we were doing the morning warm-up on Sunday morning. It was sort of a 9 AM warm-up or something for an 11 AM race. And these are usually really low stress. You just go out, you do a couple laps, make sure everything's okay. And we come back from the warm-up and the engine had failed and the engine needed to be replaced. And it was an impressive orchestra of chaos that brought the entire team together, everyone from the team owner down to the new mechanic who just joined a couple of weeks before that was just madly trying to get this engine fixed. And everyone is just sort of grabbing parts of what's needed here and there and just trying to really, you know, single-mindedly that one mission that the entire team was 100% focused on. It's a little cliché maybe to bring that back to sort of climate and back to the energy transition. But I think that a lot of people in the industry have that similar sort of really sort of single-minded of what we had ahead of us and what we really need to accomplish. Today, Tristan is the chief product officer at LG Energy Solution Vertec, the vertically integrated US storage arm of LG Energy Solution. The company executes large-scale storage projects from cell manufacturing through system integration, O&M and warranties. We have to really deeply understand the technology and we have to understand the business. And hopefully when we solve everyone's problems, we find success. Tristan, who's no stranger to things going wrong from his racing days, is also focused on improving the safety of battery storage plants. Now let's get to developing news out of Monterey County, a fire burning at one of the world's largest lithium battery storage facilities. And it continues to burn more than 24 hours after it started. Earlier this year, the Moss Landing Battery Plant operated by Visitor Energy caught on fire and golfing the LG batteries inside the building. LG Energy Solutions provided the racks and batteries for this project, while other providers worked on the balance of systems. In the wake of the fire, Stephen Lacey sat down with Tristan to explore what has changed in the industry in the months afterward. It certainly was a huge wake-up call for the industry, a very pivotal moment for battery safety, but one that I think is going to drive us forward and really drive some positive changes that I'm looking forward to in the future. In this interview, Stephen and Tristan Outline Design changes why vertical integration is so critical for improving safety and performance and explore the future of US supply chains. So it seems appropriate since we have a former race engineer with us who has dealt with many challenges to start this conversation off by talking about safety. The Moss Landing Battery Fire in California that recently happened was a pretty pivotal moment for energy storage. I wonder if you can talk us through what happened and what we learned from that incident and how is it shaping the industry's approach to safety? I think as is always the case with these huge fires, there's some things we know. There's a lot we don't know yet and there's probably plenty that we may never know. Fundamentally though, and I think we don't yet know what the root cause is. We're working really, really closely with the site owner and all the local authorities to try and figure it out. What we do know is that mid-afternoon, January 16th, one of those modules went into Thermal Runaway. What we don't know yet is we don't have an official sort of answer on is for some reason that water system didn't work correctly. And that thermal runaway spread from one module to the next and eventually to the entire section of that building, ultimately destroying it. And so just a little bit of background about that site because it was an important site, I think, in the history of energy storage and energy storage deployments. It was the largest site by a long shot for many years. But it was a retrofitted gas and oil power plant that was originally built in the 50s. And in 2013, California passed a law that was sort of requiring a big build out of energy storage and Vistra, the project owner, answered that call in 2018 announcing that they were going to build this Moss Landing project. What they did was they essentially pulled all the equipment out of a massive turbine hole and they replaced it all with battery racks. The incident earlier this year was in that first phase of the Moss Landing complex. There's a couple other battery projects on that complex, but they weren't involved in this particular incident. I think that it's really worth noting that there was a certain era in the energy storage industry where anything over a certain size, any project over a certain size, and people listening to this may laugh when they say that certain size maybe was 20 or 30 megawatt hours, which seems teeny, tiny compared to today's standards. But anything that was of any meaningful size would typically go into a building. And that was just sort of the design practice of the time. Things have moved on quite a bit since then, but that was the case. And so these systems, they were racks essentially sitting in a building. They had a water-based fire safety system that was essentially when a thermal runaway was detected, it would spray water on the module to reduce the heat in that module and to make sure that that thermal runaway didn't propagate to the modules around it. And that's sort of the layout of this site. I think one thing that's really worth noting is that these huge projects, that there's a lot of different players on site. This was also a time in the industry when LG wasn't vertically integrated as it is today. And then there was sort of layers and layers and layers of other players at this project site. They all had to come together and everything had to work together to defer it all to function. What I'm really thankful for and I think everyone is really thankful for is that all the first responders did an amazing job and nobody was hurt. Thankfully, all the environmental measurements that came back, all the EPA's been doing extensive testing all around the site. All those measurements have come back within sort of safe limits. And I hope that in the next months, we're going to have a nice extensive report that will help the entire industry learn from this event. And are you seeing a shift to more containerized battery storage solutions compared to like a building-based installation like Moss Landing? How is that evolving and how does that impact safety? So definitely there has been a huge shift to containerized systems instead of building based systems. You see almost no building based systems built now anymore. Everything is essentially containerized. There are a lot of different reasons for that. It's one big one, but I think safety is another aspect that's an important piece to talk about. Fundamentally, I find the easiest way to think about why containers help on the safety front is that you're just splitting the problem into smaller pieces. A container has a limited amount of energy in it. It has its own fire safety systems in it. And it has walls and potentially even air gaps around it. So when one container or when one module in a container goes into a failure, goes into a thermal runaway. Ideally, that module is dealt with by the fire safety system. Maybe hopefully that module just turns into a non-event. That module has failed. You pull it out, you replace it with a new one. What you think about in terms of safety, you think about worst-case scenarios. And now the worst-case scenario is simply that you lose a container. Maybe the next container over gets a couple of scorch marks on it, but typically right now the worst-case scenario is you lose one container, which is several orders of magnitude less than what we saw at Moss Landing. And so fundamentally, what's your problem? Make it a smaller problem. And then when that problem happens, it's much more manageable. So looking ahead, are there other safety innovations or design approaches that you're also excited about that can improve safety? That's a great question. I see there's a lot of innovation happening right now at a lot of different levels. There's plenty of cell-level innovation that's happening. There's a lot of chemistry work and a lot of cell safety work that's happening. But I also see a huge amount of effort and a lot of progress being made at the system level. From a safety innovation perspective and from a design approach perspective, I really think that it's a multi-tiered approach. We're continuing to see a lot of system-level safety improvements that are happening along with the cell-level improvements. I see a huge play in terms of software. There's a big component to software and all the algorithms and AI and machine learning that are really being able to identify and catch failures before they turn into bigger failures. There's a lot of advancements here in terms of how much data is being collected and how you relate that to the things you know about the cells. And honestly, that's one of the big advantages that as a vertically integrated play that we have because we have this entire lifecycle of data that goes along with that we sell. But over top of it all, I think there's a big piece in terms of quality. And I talk about quality not only at the cell level and the manufacturing level but also at the system level and how these projects are coming together. And I think that there are a lot of sort of top tier integrators that have done a really great job of quality at the project level. But there's also this layer of codes and standards which I think is something that you think at the industry level that's going to force and require every single project that gets deployed to really meet that high bar of safety and system effectiveness. I want to sort of go back though a little bit and take note of how far we've come. And I think there's an eppery report out there that I think a lot of people in the industry have probably read and seen. But if you look at the number of failures and the failure rate from 2018 to 2023, it was just a five year span that it dropped by 97%. And I think that's something that's really incredible and something to be really proud of. Obviously we still have a long ways to go and there's still a lot of work ahead of us. But the knowledge that we made that much progress in that short a time period I think gives me a lot of confidence that these advancements are coming and that we'll get where we need to get. Let's turn our attention to manufacturing now. I know LGES has made some pretty big investments in US manufacturing. Can you talk about what those investments entail and what's the strategic approach to the American market? We've made a lot of very big investments. Right now we've been working heavily on localizing our production into the US. We've been doing that for a long time. Just for a little context, we started construction on our first factory in the US and Holland, Michigan. That was back in 2010. So that's almost 15 years ago that we've been working on this. We had cells coming off that line in 2012. That was back in, that was for the EV market. But we've continued to build from there. Right now we've got seven battery plants in the US that are either producing or in construction. We've got it also in advanced cathode facility. The one in there that I care the most about being on the energy storage side is our Holland Michigan. It's the second Holland Michigan plant that's producing 16.5 gigawatt hours a year of energy storage dedicated cells. That's our side of the investment. For many years we've had a strong strategy of diversifying away from China. We sort of have a two-step strategy to localize into the states. Step one is to find a supplier that is outside of China so that we have a more of a global supply chain. And then step two is to bring that supply chain into the US. That takes a long time. I think that's something that is sometimes lost. It seems really easy. Just flip a switch and we'll just build this stuff in the States. It takes years to build local supply chains, to qualify local supply chains, to get the right people and the right skill sets locally to be able to build what are ultimately really high-tech products. But I think so far we've been quite successful and we're in a good spot. Right now coming off of the Holland Michigan line we're on schedule for early next year to be 100% non-Chinese in terms of all of the components and sub-components that are going into those ESS cells. So it's a huge testament to the work and it's a lot of work that's gone into it by both the US and the Korean teams to make all that happen. So this has been a long-term strategy to invest in the US and diversify your supply chains. Of course this became a lot more urgent coming out of the supply chain disruptions from COVID and now we have these new challenges related to tariffs. How is the current trade environment impacting project timelines and your investment decisions? Taking a lot of analysis and reanalysis and re-reanalysis every time something changes. I think there's a lot of uncertainty right now in the environment and we've been lucky that we can be very flexible but it's also been a huge strain on I think us and everyone in the organization and everyone in the supply chain and everyone in the industry. We have to remember that these are enormous investments. LG's got sort of 25 billion investing in the US supply chains, 1.4 billion on that ESS factory. That's not something you just turn on and off at a moment's notice. You have to have a little bit of certainty. You have to know that it's going to make sense from a business perspective to be able to put down that kind of money. And I were lucky that we're a large multinational company with a balance sheet that can weather some of this uncertainty but it's not unlimited. What I do worry is I worry that there's a lot of other players in the supply chain, in the broader supply chain that don't have those kinds of balance sheets and maybe can't afford to have that kind of patience. We're seeing projects that are being paused, that are being delayed. We're seeing suppliers that are rethinking their strategy and what makes sense and what doesn't make sense. It's the goalposts are continually shifting and when that happens you don't really know what to do and so you're sort of paralyzed. What I really fundamentally worry about I think for the industry is not that we're not going to keep moving forward. I really do fundamentally believe that the economics are there for this industry and I think that the ultimate goal is something that we will achieve. It's just a matter of when and how fast. And this uncertainty I think all it does is it just slows that down. If you don't give people a clear signal they're not going to know what to do and they're not going to react in the most effective way possible and people are going to make, I call it a millimeter of progress in a million directions, which isn't an effective way when you're wanting to get single-minded leap to an end goal. I want to get your thoughts on integration strategies. So there has been a significant evolution in the size and type and integration strategies for storage from building batteries and connecting them to the grid to designing power plants that happen to use batteries. How has this change driving system integration and project development? I think that there's been a real strong shift in the mentality of how you integrate these plants and being a part of a company that has control over the supply chain from the cell all the way out to your transformer or even your interconnection allows us to think differently. We've kind of been able to flip the script on how exactly to do these projects. Originally, if you run the clock back into the early 2010s, a lot of people would say, hey, I have all these batteries. I've got maybe some EV batteries. What can I do with them? Well, let's put them together in a rack. Let's put those racks together in container. Let's put those containers together in a project. It was very, very inside out. Starting at the cell and then it was sort of multiplying and building and to create your project. Whereas I think the mentality has taken a strong shift and now we're thinking from the outside in. We're saying, what does a power plant look like? What value does it need to bring to the grid? What does it need to do to be really effective and to meet the business goals of the operator? What do the batteries need to do that are going to do that? You start at the power plant and then you move into your power block or your enclosure and then you move there into your module and you move from there into your cell. The direction of design decisions and the direction of design intent has kind of flipped 180 degrees, which is a fascinating change to see in the industry. But it's also one that I think is creating much more effective and much more powerful designs. What are the advantages of vertical integration? Well, the ability to do exactly what I just mentioned is when you're a system integrator and you're using a third-party cell, you're often kind of stuck with what your cell suppliers have. You've got to look through your catalog, figure out what's out there, how you put it all together to meet the need. When you're fully vertically integrated and you are understanding what the customer is truly needing and you can take that information and pick up the phone and talk to the designers who are actually designing the modules and the cells and describe to them what challenges you're facing. They understand that they can make their designs work much, much better with the overall plant. I think that's really a strong key. I see another big strength of vertical integration in just understanding and being able to control the supply chain and being able to manage the supply chain. One of our advantages and one of our superpowers as a battery company and being the largest non-Chinese battery company out there is that we have not only ESS production, but we also have EV production. This was one of the plays when we decided to shift our original plans of building the ESS production facility in Arizona and shift that to Holland, Michigan. It was so that we could build cells, more cells and build them sooner. That was only because we had the experience in the EV plants and we had this EV plant and we had these facilities that we saw market shifting. We saw that the EV market wasn't growing quite as fast as the ESS market was, that our forecasts were not quite right, but we could readjust. We had that ability to be flexible and we had that ability to readjust. Then instead of taking three or four years to build a complete green-fueled battery factory in Arizona, we could take six to 12 months, take an existing shell, an existing building that had all the permitting done and had all the infrastructure and all the utilities, take all that equipment that it was originally destined for Arizona, send it to Michigan and we were suddenly up and running almost a year earlier with ultimately a higher level of production per year. That vertical integration, that ability to maneuver things around and change and adjust to the market environments and the conditions really gives you the ability to be more flexible and to be more adaptable and what is ultimately a really variable environment right now. The players that have that adaptability and have that power are in a good spot right now. Tell me about how the software is evolving. As the use cases for storage on the grid diversify, what is happening in the software side as part of that stack? How are you approaching software development? What's changing that's most interesting? Yeah, software is an interesting piece. I think there's a lot of really interesting technology that's happening on the software side. There's a lot of AI machine learning that we mentioned earlier in terms of the safety aspect. There's a lot of operational efficiency and keeping really high availability of your systems. We're also working a lot with how to operate energy storage more effectively on the grid. What's the optimal dispatch? What's the way to play in the power markets and really be effective there? I think the other side of software and it flows into availability and safety is the cybersecurity piece and the domestic supply chain piece. I see software as a really key component of our supply chain. The fact that we build all of our software either in the US or in Korea, the fact that we have 100% visibility over every piece of every single controller in our enclosure, I think puts us in a stronger stance, I think, from a safety and cybersecurity perspective. I'm happy to see that we've brought all that in, that that's actually one of the really strong components that we bring to market. It just fundamentally I think makes for a better product. It's more secure, it's more stable and ultimately it's going to bring better value to the customer. It's impossible to have this conversation without talking about the demand backdrop now that is making storage even more valuable. Of course, around the world, but particularly here in the US we're seeing this surge in demand particularly due to data centers. It's a wide variety of things like electrification, factory development and data centers. I'm curious about how you see this shaping the market for storage. Is it changing the need for storage, the applications for storage? How do you see this demand backdrop influencing deployment? Well, there's a lot. It's a very foundational shift in the energy markets and the energy space. Everyone I think most people know has been talked about quite a bit in the last sort of six, 12 months, but our electricity demand as a country has been fairly stable and fairly flat for the last couple of decades. Only now we're starting to really pick up. It's a good thing because we're picking up economic activity. We're picking up these data centers. We're picking up manufacturing, but it's also a big challenge that we have ahead of us. Now, what's that crystal ball and how do you tell what that future holds? Is it 30 gigawatts of extra data center demand? Is it 60 gigawatts of extra data center demand? Is it even more than that? What's the overall demand growth? Is it going to be 50, 100, 200 gigawatts total? The sort of band of uncertainty is quite wide in terms of what the future holds and what that demand growth is actually going to be. I think what the trillion dollar question really is is how you go about serving that demand. Whatever it is, it's going to be big. It's going to be very big. But how do you get to serving that demand? There's a lot of different options on the table. I think every energy option out there is being looked at and is needed in solving this problem, but the timelines are quite varying. Nukes are probably five or 10 or more years out. New gas generation, you can't get a new gas generator for probably four or six years at the very shortest. The most immediate and economical solution is really those renewables and batteries. I think from a pure data center play, you brought that up. What are the specifics in terms of how we address the data center needs? There's a lot of variability there. I think that goes back to speaking to the uncertainty in exactly how we're going to bring all this online. There's everything from completely off-grid microgrids that are powering data centers until they can get grid connections to working really closely with utilities to bring extra generation on board. I think there's a lot of questions there, but there's a lot of smart people in the industry that are working really hard on those. I've got a lot of confidence and a lot of faith. Do you think we'll see a lot of batteries hosted at data centers? Yes, I think we'll see a lot of batteries at data centers. I think we'll see a lot of batteries on the grid next to data centers. I think we'll see a lot of batteries that are on the grid far away from data centers. I think we're just going to see a lot of batteries everywhere on the grid. We've made immense strides and we've figured out a whole lot of really interesting and really fascinating ways of using batteries, but I think that there's a whole bunch more that are to come. I'm really excited for what's going to come. We've covered innovations in safety, system design, integration, strategy, supply chain development. What other technical innovations and batteries are you most excited about right now? I think obviously there's a lot of technology advancement. I think there's some great battery chemistry plays coming out. I think that as the markets shift to these longer and longer duration, some of these longer duration battery chemistry plays could be really interesting if they hit the right timing. I do think that the advancements that I'm most excited about are really how to get that deployment to be smooth, how to get that deployment to be effective, how to keep these systems really up 99% of the time, 99.5% of the time, just keeping that massive, really, really stable uptime and get the reliability that you need to support the grid. Fundamentally though, I do think that we have a great technology in LFP and that we're starting to get really good at deploying these huge sites quickly and effectively and that there's just a lot more value that we're going to get out of them as we learn to manage fleets that are at the tens or hundreds of gigawatt hour scale or even thousands of gigawatt hour scale. That's where a lot of the advancement is going to come. It's the scaling question and the scaling problem that we have ahead of us. Do you still get the same thrills working on energy storage as you did working on Indy cars? I'll be honest, every time you turn on a one gigawatt hour site, there's a little bit of a thrill. There's a little bit of excitement to see that happening. It is still fun for sure. Tristan Doherty, thank you so much. I enjoyed this conversation. Likewise, thank you for having me. This episode was produced in partnership with LG Energy Solution Vertec. LG Energy Solution Vertec is the US Energy Storage Division of LG Energy Solution, here to be your lifetime energy storage partner. For more on the company's approach to safety, performance and its commitment to the US market, follow the link in the show notes.",
    "release_date": "2025-05-20",
    "duration_ms": 1597000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI1882358341.mp3?updated=1747684845",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-29T01:49:12.631142"
  },
  {
    "title": "Terrawatt Infrastructure’s billion-dollar strategy",
    "description": "This week, we're bringing you a special episode of The Green Blueprint, a show about the stories behind first-of-a-kind climate projects. In this episode: Terawatt Power's first commercial electric truck charging depot, which opened in April near the ports of Los Angeles and Long Beach. It was a significant milestone for the industry. So how’d Terawatt pull it off? \n\nHost Lara Pierpoint talks to Terawatt’s founder Neha Palmer about the financing, offtakes, and market demand for electrified trucks. It’s the kind of deep-dive conversation we love to have here on Catalyst, so we think you’ll enjoy it. \n\nIn 2021, Neha Palmer co-founced Terrawatt Infrastructure with a bold mission: create the backbone for America's electric trucking revolution.\n\nWithin its first year, Terrawatt secured a billion-dollar investment. But as the company developed plans for a nationwide charging network, it confronted the daunting challenge of building infrastructure for an electric truck market that barely existed. \n\nHigh-profile bankruptcies like Nikola Motors cast long shadows over the sector's viability, raising questions about whether heavy-duty transport can truly be electrified.\n\nIn this episode, Lara talks with Neha about how Terrawatt aims to transform freight transport despite market skepticism. Neha explains Terawatt’s strategic approach to site selection, innovative charging designs for fully-loaded trucks, and the vision for a revolutionary California-to-Texas network.\n\nCredits: Hosted by Lara Pierpoint. Produced by Erin Hardick. Edited by Anne Bailey and Stephen Lacey. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.\n\nCatalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, and increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data plus tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.\n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "Latitude Media is hosting the Transition AI conference in June 2025, focusing on energy infrastructure and AI-driven load growth. The podcast discusses electrifying heavy transport, featuring Terawatt Power's success in opening a commercial charging depot near the ports of Los Angeles and Long Beach. Neha Palmer, Terawatt's co-founder, shares insights on financing, market demand, and the challenges of electrifying heavy-duty trucks. Terawatt's ambitious plans include a network of charging stations along the I-10 corridor. The podcast also delves into site development, hardware selection, and construction management for charging hubs. ANZA, an energy storage data platform, and EnergyHub, a grid flexibility solutions provider, are highlighted as key players in the clean energy economy.",
    "transcript": " Mark your calendar for June 12, 2025. Latitude Media is holding its fourth transition AI conference in Boston. This year's theme, energy infrastructure in the era of AI-driven load growth. We're going to bring together investors, developers, researchers, and tech companies to talk about the creative ways to meet data center demand. And companies include FERVO Energy, Form Energy, Scale Microgrids, Spark Fund, KKR, Generate Capital, Orenia, FlexGen, National Grid Partners, and more. Plus, we're going to have a live open circuit episode featuring Caroline Golan from Google and a live green blueprint episode featuring Rick Needham from Commonwealth Fusion Systems. Get your ticket at latitudemedia.com slash events, podcast listeners, get 10% off their ticket, use the code latitudepods10 at checkout, latitudemedia.com slash events. We will see you at Transition AI. Hey everyone, Daniel Waldorf here. I'm the producer of Catalyst. So if you wanted to pick one of the hardest problems to solve in climate tech, near top of that list would be electrifying heavy transport. It's a problem we've talked about on this show. Fuel and molecules just have significant advantages over electrons and batteries, at least in the arena of hauling heavy things over long distances. A case in point, nickel emoteers high profile bankruptcy back in February. The collapse of the company raised a serious question, is electrifying heavy transport just too hard of a problem to solve right now? Maybe, but maybe not. Just last month, another company called Terawatt Power opened its first commercial heavy duty charging depot near the ports of Los Angeles and Long Beach. It was a significant milestone for the industry. So how did Terawatt pull it off? And what comes next for electrified heavy transport? This week we're bringing you an episode of the green blueprint. It's a show about the stories behind first of a kind climate projects. And it's hosted by a friend of this show, Laura Pierpoint, who has guest hosted before. Laura is the managing director of Trellis Climate, and she talks with terawatt's founder, Neha Palmer, about the financing, the off takes, and the market demand for electrified trucks. The kinds of questions that are, you know, the DNA of catalyst. So we think you'll like it. We will be back next week with a new episode. But for now, here's Laura and Neha. Heavy duty trucks make up less than 5% of vehicles on the road, but they generate nearly 25% of transportation emissions. Electrifying these massive vehicles seems like a no-brainer. But some skeptics say it's just not possible. Neha Palmer, however, is not one of those skeptics. This is a transition that is happening. When Neha Palmer co-founded Terawatt Infrastructure in 2021, she wasn't just building a charging company. She was creating an entirely new category of infrastructure. While passenger EVs had a decade-long head start, heavy duty electric trucks were still in their infancy. But she saw their path to electrification as inevitable. The analogy I love to use is transition that happens once every century. So you had the railroads, and that required a significant amount of investment very quickly. Then you had the National Highway Network. And now you have an overlay on both of those, really, which is the electrification of those modes of transport. The complexity of the challenge is staggering. A single site for heavy duty truck charging requires finding the perfect location, securing megawatts of power, navigating the permitting processes that have never seen this type of infrastructure before, and then convincing fleet operators to take a chance on a technology that's still evolving. And the road has been bumpy. Earlier this year, Nicola Motors, once a promising pioneer in zero-emission trucks, filed for bankruptcy after a spectacular rise in fall. Critics pointed to it as proof that electrifying heavy duty transport was simply too difficult. You know, I certainly hope it's a blip. We need as much investment into the technology or the vehicle itself as we do in the charging to make all of this a reality. But in April, Terawatt proved the doubters wrong when it opened its first commercial heavy duty charging depot near the ports of Los Angeles and Long Beach. The ports are technically separate, but operate as one big complex. They're the biggest container ports in the US, and it wasn't just a charging station. It was the first node in what will become a network of sites across all of Southern California. In California, we have built what I think is the best network of sites, and three of them will be live this year with the Port of LA Long Beach site being the first one. We'll have a third one that's further north near the intramodals. And so with those three sites, we kind of have amazing coverage of the entire LA basin. I'm Laura Pierpoint, and this is the Green Blueprint, a show about the architects of the clean energy economy. We've already invented most of the solutions needed to decarbonize the global economy, but many of these technologies are not yet commercial, and they need to get financed and built at scale. We don't have decades to get them commercialized. We have years. This week, we're talking about the monumental challenge of electrifying heavy duty trucking with Neha Palmer, co-founder and CEO of Terawatt Infrastructure. We know that this is a trillion dollar investment over years, and so the scale that we're talking about and the impact that we need to make, even with a few sites, is going to require lots of capital. Do you want instant access to energy storage supplier pricing that's project-specific, or the ability to compare domestically-made battery and PCS options across the market? Anza now offers the industry's first battery energy storage data and analytics platform to make better development and procurement decisions. Anza provides in-depth commercial, technical, and risk data and analytics to help developers choose the best equipment for any project. Improve your returns and save months of evaluation time with Anza. Learn more about Anza's energy storage subscriptions at go.ansarunuables.com slash latitude, or click the link in the show notes. Imagine a world where connected devices like EVs, home batteries, and smart thermostats work together to support a more efficient and reliable power grid. Well, you don't have to imagine it anymore. This vision is a reality today, thanks to EnergyHub. With EnergyHub's Edge Derm's platform, utilities can create virtual power plants through customer-centric flexibility programs, making it easy to manage distributed energy resources and balance the grid. Unlock grid flexibility and reliability through cross-DER management with EnergyHub, the trusted Edge Derm's leader. Visit energyhub.com to learn more. Terawats approach is ambitious. Shortly after launching in 2021, the company secured a huge chunk of capital from investors. Very amazingly, you secured a billion dollars in funding led by VisionRidge just after you launched, really. This was about a year after you launched as a company. So can you tell us a bit about what convinced investors at that stage to make such a big commitment to your vision? When you think about our sites that we're starting to build out, the billion dollars is not going to last that long to build that many assets. And so it was really the vision for the beginning that this is not just a small-scale effort. It's going to be something that requires significant capital. And there'll be have to be multiple billion dollars raises, frankly, to get this even off the ground. Terawat doesn't just install chargers. It acquires the real estate, works with utilities to secure power, installs chargers and associated infrastructure, and ultimately handles ongoing operations and maintenance. Really, our business model is investing into these sites and taking that cap expert and away from our customers, allowing them to engage in a more off-x basis, and also taking away the pain of working with utilities when they're used to buying fuel, of the time that takes to put the construction together, all of the investment, and really making that a seamless process for them as they change to electric vehicles over time. Terawat began piloting its business model in 2022. Then in October 2024, it opened its first full-scale commercial site near LAX. This site is for passenger vehicles, and in this case, that mostly includes ride share companies. It's not suited for big semi-trucks. On the ride share side in dense urban markets, where there's a lot of traffic we're hearing from operators, it's cost-creative for them to run EVs instead of traditional vehicles because of the fuel savings. The market momentum is slower for medium and heavy-duty charging. In part, that's because of what we mentioned at the top. The electric semi-trucks industry has struggled to take off, and it's tough to make the case for building chargers when there aren't trucks to charge. But Neha is optimistic that that market is going to tip with more big trucks being electrified. We've had almost close to 20 years of learning on the passenger side. On the electric truck side, it's certainly earlier days. You see a lot of the same things you saw on the passenger side. You're seeing improvements in battery pack costs and performance of the vehicles themselves. As that starts to mature, you're starting to see more and more demand. The heavy-duty charging facility near the ports of LA on Long Beach, the Terawat Open this year, is called Ranchero Dominguez. It features pull-through stalls that can accommodate full tractor trailers, which is a unique feature. And up to 125 trucks can charge there in one day. It marks the beginning of what Terawat envisions as a network of charging stations all along the I-10 corridor, all the way from California to Texas. We call it kind of a corridor, but it would start the port of Long Beach and go all the way to El Paso, Texas. And so allowing somebody in an EV truck to travel that confidently, knowing that they had charging along the way, that would accommodate the range of the vehicle. I talked with Neha about Terawat's audacious plans for heavy-duty electric vehicles and her outlook for the industry. I started by asking her about the passenger vehicle side of the business, because the LAX project was Terawat's first full-build charging site and a major proof point for the company. So you started off near LAX. Can you talk a little bit first of all about why you chose that particular site? Yeah, so you know, ride share autonomous vehicles has always been a focus for us from the beginning. And a huge number of rides or initiates from airports. It's also a location that's near a major stadium and a lot of other good venues that would require ride share to be part of that ecosystem. So the location just made sense from density of demand. It also was a site that was for sale. Oftentimes, we might be excited about a specific geography or geo-fenced area, but there may not be any flat lots or open lots or undeveloped lots to go and work with. So this was something that allowed us to engage in this area. And it was the right size for the application we were trying to put in, which was what ended up being about 30 chargers focused on passenger vehicles with enough space for drivers lounge and all the space for all of the electrical equipment chargers, everything else that we needed. So the last piece that is always so important and I'm making it sound like an afterthought, but it really is the most critical thing and the thing that we almost always think about first once we identify a location is it had power. So it had five megawatts of power that was available from day one. We just had to start construction on our site and the utility had to do a little bit of construction on their end, but we knew that we could get that power from day one to allow us to serve that many chargers all at one time. So really it had that confluence I call it the Venn diagram of the things we need, which are customer demand, available real estate. It didn't have the right zoning at the time, but we worked on that. And then the last piece and the most important piece being the power available at the site as well. Okay, well, let's talk a little bit about the development for the sites. Can you walk us through some of the things that you had to do around permitting site preparation, all that sort of stuff? What did it look like to get ready to build it? Yeah, and so this is something that's always fun when you're starting a new industry. I came from data centers and we had this whole pattern of recognition for data centers too. When it was early days, we'd go into jurisdictions and people would say, I don't even know what that is. Certainly that everyone knows what that is in the world now, but for EV charging, there's oftentimes not any code available in the planning code for how do you permit, how do you entitle an EV charging hub? So we worked very closely with the city of Englewood, who is a fantastic host for us here in this site to understand what their existing code was and how we might fit into it. It had to go through a whole process with the city council, the planning council, to have them understand what the project was, what kind of benefits it would bring to the community, and then they had to actually put new language in their code to allow the entitlement of this. And so that's something that we find in many new HJs or authorities having jurisdiction that we enter. They may have never seen this before, so we have the benefit of having done it now. We could hold up this template, but this was the first time. And so we did have to work through that process with the city. Again, they were super, super collaborative. And so we were able to do that, but that did take time. So it wasn't like, day one, we have closed on this real estate site. We know exactly where to go to file for the permit, etc. There was a little bit of legwork to do ahead of that in the entitlements to get the right zoning for the site. And then there was a whole permitting process and kind of a little bit same thing again. There have not been many of these installations at this scale built anywhere. And so it takes some time to work with the city engineers to get them to understand like, here's what this looks like. Here's our electrical design. This is what a typical site looks like. And so we re-end that process with the city again, again, very collaborative. But anytime you have to do a little bit of educating and collaborating, it does take more time. Sure. Okay. Well, and then let's talk for a second about your hardware supply. So there are a lot of different charging companies that supply hardware for passenger vehicle charging. So how did you think about that? How did you select your hardware provider? And is it kind of a single provider that you always work with? Or how do you think about your supply chain here? Yeah. So it's interesting you say supply chain because there's so many components, not just the chargers. For this site, for the chargers, we wanted to make sure that we had a partner that was going to be working with us to maintain that high uptime. And so we worked with that partner really closely to make sure that any kind of visibility software we were building was going to be very compatible with their chargers. That's a level of integration that's generally not there. Generally, there's probably, call it four to eight would be a large, large installation of chargers in one location. This is a much larger deployment that I think most charger companies are used to doing in one location. So the concept was a little bit different for them as well, I believe. And so working really closely with them to make sure that our software worked with their hardware and that we were able to do what we needed to do to have the remote network operating center, have the visibility they needed. So there was a lot of work up front to make sure. And again, we're also deploying our software for the first time. So a lot of work to make sure that there was a level of collaboration. So when we look for hardware providers, obviously the hardware has to work, it has to be high quality. But the real table stakes for us is collaboration. And so ensuring that they were willing and able to do that level of collaboration. Another piece is spare parts. It seems really simple that if you create chargers, you would have a full spare parts program, but that's not the case for all charger providers. So making sure that they had a robust program here in the US, oftentimes you have chargers coming from other geographies. And so they might be deeper there, but not here in the US. So deep spare parts program. And then also just texts that are available and understand that technology again, it's a very global supply base. And so you might have depth in Europe, but you may not have very many texts that know that equipment here in the US. So really thinking through that whole aspect of how do we make sure that we're going to have the highest uptime we possibly can. And so kind of one last question about this, well, a couple of questions actually about this about this commercial site. So one of the things that comes up pretty frequently on the show is the question around, do I use an engineering procurement and construction firm to build something or do I do it myself? And some really interesting impacts flow from those decisions, particularly when you're building things that are effectively first of a kind. So can you talk a little bit about how you were thinking about managing the construction on this first site and what you ultimately decided? So for this first site, we did work with an EPC firm. And I think we learn a lot about working with an EPC firm. One thing that we learned is the civil aspect of our sites is very heavy. If you look at a site, actually, I think sometimes people look in like, oh, that's interesting. It's like, you know, 30 chargers are nice and pretty standing on the ground, but you don't see what's happening below ground, which is massive duct banks. We oftentimes put in extra capacity. So when the charger power might go up, we would have the capability to actually make that change over pretty quickly. So future proofing underground. And so there's a lot of stuff happening below the grade. And I think that's one thing that we learned in that EPC, if you think about it, the civil trade, and I'm actually a civil engineer, is very local. So having that local expertise is very, very critical for the types of things we build, because, you know, the type of soil that you're dealing with, the codes that are related to how much rainfall ends up in an area, etc., is oftentimes really contingent upon local expertise to understand those characteristics and how the local planning commissions and engineering leaders in those planning commissions will think about our construction. So something that we had to kind of learn the first time. And so how we contract in the future would be really taking that lesson in hand. With the first commercial site built, Neha and the Terawat team turned their attention to their flagship heavy duty project, Rancho Domingos at the Port of Long Beach, which had actually already been underway for years. More about that after the break. Catalyst is brought to you by ANSA. ANSA offers a one-of-a-kind data and analytics platform and advisory services to support better project development and procurement decisions. For energy storage developers, ANSA's platform provides crucial information that you never had easy access to before. Now at your fingertips is real-time pricing for a long list of system configurations to suit any project. ANSA provides a 360 degree view of the market with lifecycle cost analytics and commercial technical and risk data. With ANSA, developers can easily determine which products to use in their designs, finance models, and RFPs. Learn more about how ANSA helps save time and maximize profit at go.ansarunuables.com slash latitude. Catalyst is brought to you by Energy Hub. Energy Hub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. The Energy Hub platform takes the guesswork at a balancing energy supply and demand. It uses machine learning to control customer-owned distributed energy resources like EVs, home batteries, and smart thermostats to precisely shape load profiles for grid flexibility and reliability. As the industry leader, Energy Hub helps more than 80 utilities manage 1.6 million devices. That's more than any other edge germs on the market. Click the link in the show notes to learn more or go to energyhub.com. This is very cool. It sounds like tons and tons of lessons learned from this first site that then launched you into building your second site at the port of Long Beach. Can you talk a little bit about how that project got started, at which point you started thinking about doing this particular project, working into the heavy-duty vehicle space, how did that all begin? So it's interesting. Our vision for the company really from the very beginning was focused on being able to electrify the heavy freight industry. The gleam in our eye was this segment. We started engaging the search for sites right when we started this business in early 21. Heavy-duty fleets tend to focus on locations that are near ports in warehouse hubs near intermodals. The port of LA Long Beach was a location where there already is an intense push for electrification. There's a green lane at the port. So if you are in a zero-emission vehicle, you actually can get into the port faster with less wait time. Time is money for these guys. And so there's some significant upside for them to be able to do that. In Southern California, you also have something called the wear rules, where non-zero-emission vehicles going in and out of warehouse hubs can start to incur fines for those warehouses. And so there is a push in the area for electrification with the port kind of being ground zero, the nexus of a lot of those efforts. And so finding a site near the port was kind of our first order of business when we started the company. And so it took us a while to find an ideal site. And when we did, it was pretty expensive. It was probably going to be the biggest single real estate investment we had in the portfolio at the time. As a result, we had to look really carefully at this investment and make sure it was the right location. Again, close to the port, but not in the port or on top of the port. So really understanding the characteristics of the flow of traffic from the port to different locations that those vehicles go to. Understanding the density of the flow of traffic, because the Port of LA Long Beach is the biggest container port here in the US. Freight goes in every single direction from that port. Are we on the right trajectory coming out of that site? So we did a lot of interesting things, everything from looking at anything that was available publicly from the Department of Transportation on freight flows, all the way to having someone just stand on the corner one day and count how many trucks went by in a specific two hour period. So we really put a lot of thought and energy into deciding on this as a location for that really important first heavy duty site. I love that story so much because I feel like so often we tell the stories of guts and glory for startups. And then it's really important to remember that some of what makes startups successful is exactly that as an employee with a launcher sitting on the side of the freeway counting tracks at various points to influence how this decision went. And can you say a little bit about how that felt to kind of finally make a decision on this site? Because this was a pretty huge moment for the company to ultimately make this down selection and put as you put it, like a fair amount of money on the line to make this site acquisition happen. I mean the location has to be there and that's why I talked about the Venn diagram. So we got comfortable with the location. This site also had something really incredible where you don't find this in many locations, which is 7 megawatts of power available from day one. So that amount of power allowed us to do a lot of great things with the site. It was, you know, a corner a lot. It had the right dimensions. It had a lot of space. So the site characteristics were great as well. You know, we had started to build these other sites and so we kind of had an idea of what that process is for entitlements. So kind of everything started to tick all the boxes and that got us comfortable with it. But ultimately we got super excited actually, not just comfortable excited about this location based on everything I just said and we're excited to get this into our portfolio and under construction. So and then you're starting to design the site. So let's talk a little bit about this. One of the things that you had mentioned earlier was that you offer the opportunity for folks to pull in, not just with these bobtails sort of front end of the trucks, but really a fully loaded truck that actually has a trailer behind it. So were you already sure at that point that you wanted to offer that kind of charging capability or were you really thinking about, you know, what would the site layout look like? What were some of the trade offs around these different options for charging? So again, there's very few sites that have this scale of power and size that would allow that many chargers in one location and that need trucks to charge in one location. So we're kind of, you know, I won't say, you know, making it up, but we were doing a lot of kind of product assessment and design to understand what would customers need. And if you look at a lot of the sites that are out there today and even sites that customers have behind their fence when they have the charging, it's usually just for a bobtail stall. So this was a little bit of a tug of war between the finance team and the product team. The product team came from places that had worked with semi trucks before. And so they really were pushing for those pull through stalls saying, hey, if you look at the traffic flow patterns, they're going into the port or out of the port with the trailer attached to the tractor. It's going to be a really big lift for them to have to find a place to put the trailer, detach it, come in and charge, or, you know, just be in a position where they don't have the trailer for whatever reason. They're between loads to come back to the site, charge, and then go back and get their trailer, just a lot of work. And so wouldn't be really a great customer experience if they had to do that. The tussle with the finance team was, well, if you have more chargers, you can potentially make more revenue from a site, right, and have more utilization. So we landed kind of on a compromise, but we wanted to optimize the site for the pull through. So we got as many pull throughs on the site as possible. And then when we had more power in space left, we added in some bobtail charging that will also allow, you know, smaller box trucks or even light duty vehicles that need a huge amount of power or a high power charge to charge there. And when we had, you know, the kickoff event, we had a bunch of customers in the site, and they were all just marveling and really kind of gleeful about the fact that we had that many pull through stalls. Oh, that's awesome. I can't wait to ask you a year from now how the utilization goes on both sides of those. I'm sure you all are dying to know that too. Very cool. Let's talk about those customers for a sec because they're obviously very key to the equation here. So can you say a bit about what your customer interactions were like, particularly for this project? When did you start engaging them to understand what they might want and what sort of contracts they might be willing to sign up for and when and how did those how did those negotiations go? Yeah, so we started engaging customers the minute we had the site. It is really hard to have a conversation with a customer if they can't and been imagined the location. So generally speaking, we don't start conversations until we have the specific site in mind. And even a layout that said, what's interesting is it takes us call it 18 months to 24 months to find a site, get it entitled, permitted, constructed, and then an operational. Most vehicles make vehicle purchasing decisions at the most a year in advance, sometimes six months in advance. So they may decide that they want to buy a few EVs and, you know, have those six months later. Charging doesn't come that quick. So for this first one, it was a little bit of lining up those timelines. And so one thing that we did see is we got closer and closer to project completion, a lot more engagement from these fleets because they could actually come to the site and see, oh, you've got this thing paved and this is what the flow looks like. And it's really going to come to fruition. I think there is in any industry that's new in nascent, a lot of discussion of, we could build this or we could build that by having actually done it. And it's in site and operational. We actually saw even the week before we launched, you know, we were doing site tours with lots of customers and that turnaround from site tour to contract was starting to happen a lot faster because of course it's ready to go from day one. But also just being able to see it is everything. Very cool. So can you say a bit more in detail when was the first customer contract signed? Like what had you done or completed at the site that got the first person in the door to say yes and actually sign on the dotted line? It honestly was about two years ago. So it was a customer that has pretty good experience with electric vehicles. They're one of the first movers in the industry. They have a larger fleet of EVs than most fleets do. I think they have well over 50 right now. And so they had some good experience where and they were at a point where they were starting to outgrow their on site charging and they're also located close to us. So again, it was a good validation of that location selection. But the conversation really was like, hey, we've never done this off site. We don't know how it's going to work. We'll take a chance with you guys. You know, there was some preexisting relationships there that maybe helped Greece to skids. But you know, they really were taking a chance that we were going to do what we said, build the site, deliver it, and then it would fit into their operations. And so now that it's live, I'm super excited to see how it fits in. I think it's going to be a lot more utility than they probably thought. This does open up a lot of different use cases like top off charges. The amount of power we have per charger allows it to charge a vehicle to charge much faster than most behind the fence chargers. And so having that capability can sometimes allow for a double shift of a vehicle where if it was a slower charge, they could use it for one run, has to come back to the yard, spend six to 12 hours charging, and then can go out again. But if you can top off, you might be able to get two runs in a day. And all of a sudden that utilization that vehicle's doubled. So, I think those are the types of conversations we were having, the hopes that they had that we had. And now we'll see how this actually plays out. So my next question is, how, as you're building this site at the port, you're obviously, I'm sure, in the process of thinking about your next site and the one after that and the one after that, and a whole fleet of sites to come, particularly on the nighttime corridor in California, but maybe elsewhere too. So tell us about what comes next. What is the next site that's going to come online? How are you thinking about your future build out how many sites are you working on all at once? Yeah, so for this, this definitely is the first of a couple of projects. We have our next site that will come online in the summertime that will be in the inland empire, which is after a vehicle goes to the port, it generally goes to the inland empire, which is the giant warehouse district for the port here in California. And so we'll have a second site there in a few months. And it really is thinking about this as a network, right? These are moving assets. I mentioned that top off charge that could be really beneficial to how our utilization of these pretty expensive vehicles for now. And so really excited that that will allow a lot more operational flexibility for EV fleets to move freight around the area. And so we call it a lane in the freight industry. So the lane between the port and the inland empire is a very important lane and having charging on both ends just allows a lot more confidence electrification, having the capability to maybe have a contract that allows access to both sides, which we're seeing the demand for now, is also really freeing and exciting for customers. If they had to do that on their own, they would have to figure out a location that they had to find access to near the port and one near the inland empire. And oftentimes these are drainage companies where their main operations may be near the port, but they are just delivering to their customers in the inland empire. And so don't really have access to sites there. So super exciting that this will be the first node in the network. You mentioned the i10 project, and that's also super exciting. And this is also the first node in that. What's interesting is, we know that the site's going to corridor will take a little bit of time to build. And already, as I mentioned at the top of our discussion, that technology is starting to change. So those sites are generally about 150 miles apart. We know that the range is generally much, much longer than that. Another thing that's happening is we're starting to see standardization of the charging infrastructure. Seems really simple, but the connector has to be the same from all the charging providers and all of the tracks have to use the same connector. And so there's a global body called Charon that has been working on that protocol for quite a while now. It does seem like that they're finally at a place where that specification is built out enough that we have confidence of what to build along that corridor that can serve any kind of truck. Our customers are not generally going to have just one type of vehicle. They will have multiple models in their fleets. And so they want to know that if they have a contract with us or anybody else, or even if they're putting in infrastructure behind their fence, that they don't have to put in different infrastructure for different vehicles. That sounds crazy to a fleet, right? But we are starting to get that maturity in technology in the industry. That's really making that project super exciting and viable. If I wired $100 million into Terawats Bank account tomorrow, what would you do with it? You know, I mentioned the location piece. And I think that we're already doing this. And so maybe it's not different. And we have raised quite a bit of capital. So we have a little bit of freedom to do this. But I would make sure that we're investing into the next generation locations where we know this will be needed. So sometimes there's places where there just is no power. It will take four plus years to get there. So if you're able to have that site and start to develop it quicker, you would have that when that demand comes to that market. But I think the thing that we are really thoughtful about right now, and I think that we're going to be able to do a lot of great work with is how we use the energy that's available on a site. So there's a lot that we're learning again from seeing the utility of these sites. And these sites are designed for every vehicle to come in at the exact same time, and be the top of the charge curve pulling the full power of the charger at the same time. And that just doesn't happen. And so there are ways that we can actually, you know, we have seven megawatts in the street of power from the utility at our heavy duty site. But maybe instead of serving, you know, 20 chargers, we can serve 25 chargers with that. So really, or we can serve higher power at each charger with that. So I would invest it into making sure that we're being really thoughtful about that piece of it. Because again, I mentioned that power is the first thing that we always look for once we find those two other things. And being able to be more efficient with that is great for us. We have more capability of the site, but it's also great for the utility. You know, we're in an era where they are under pressure to do all kinds of things and, you know, build really fast for lots of increasing electricity demand. And so removing some of that pressure for them allows us to work more collaboratively with them as well. So I would invest into that. I don't think it takes $100 million, but sometimes money is speed. But I love that a piece of your answer is making your financial team happy by making sure that you're optimizing and increasing utilization. So that's awesome. Always have to keep them happy. Thank you so much. This has been such an awesome interview. It's really interesting to hear about all the things that you've done on your journey and the challenges you've overcome. So we wish you all the best. Neha Palmer is a co-founder and a CEO of Terawat Infrastructure. The Green Blueprint is produced by Latitude Media in partnership with Trellis Climate. The show is hosted by me, Laura Pierpoint. Our producer is Aaron Hardick. And Bailey is our senior editor. Sean Markwand is our technical director. Steven Lacey is our executive editor. If you'd like to suggest topics or guests for the show, send an email to thegreenblueprint at LatitudeMedia.com. You can listen to the Green Blueprint at latitudemedia.com or subscribe wherever you get your podcasts. And if you have fellow clean energy or climate tech travelers who would benefit from the insights in this show, send them a link. This is the Green Blueprint, a show about the architects of the clean energy economy.",
    "release_date": "2025-05-15",
    "duration_ms": 2333000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI9911507760.mp3?updated=1747286579",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-29T01:53:27.085305"
  },
  {
    "title": "The U.S. nuclear groundswell",
    "description": "The nuclear renaissance of the 2000s turned out to be something of a mirage. Buoyed by rising fossil gas prices, growing climate awareness, and steady load growth, nuclear seemed poised for a breakout moment. But that momentum stalled. Electricity demand flatlined. The fracking boom sent gas prices plummeting. And Fukushima rattled public confidence in nuclear power. Ultimately, only two new reactors, Vogtle units 3 and 4 in Georgia, reached completion over a decade later.\n\nSo is this latest wave of nuclear hype any different?\n\nIn this episode, Shayle talks to Chris Colbert, CEO of Elementl Power, which on Wednesday announced a deal with Google to develop three nuclear projects of at least 600-megawatts each. (Energy Impact Partners, where Shayle is a partner, is an investor in Elementl.) Chris, a former executive at NuScale Power, thinks last year may have marked the start of a nuclear revival: the recommissioning of Pennsylvania’s Three Mile Island and Michigan’s Holtec Palisades; Big Tech deals to support small modular reactor development; and the start of construction on TerraPower’s Wyoming reactor, the Western Hemisphere’s first advanced nuclear facility.\n\nBut until new reactors move beyond one-off projects to serial deployment, nuclear won’t achieve the cost reductions needed for widespread adoption. Chris and Shayle discuss what it will take to turn this groundswell of activity into widespread deployment, covering topics like:\n\n\n  \nCurrent tailwinds, like load growth and interest from corporate buyers\n\n\n\n  \nWhy corporate buyers may be better positioned than utilities to take on development risks\n\n\n\n  \nElementl’s technology-agnostic approach\n\n\n\n  \nDifferent nuclear technologies — light water, non-light water, and advanced designs — and Chris’s predictions for when they’ll reach commercialization\n\n\n\n  \nWhy iteration is essential to driving down costs (and why the Google deal involves three separate projects)\n\n\n\n  \nHow regulatory timelines are speeding up\n\n\n\n  \nThe steps of project development with a corporate buyer\n\n\n\n  \nChris’s criteria for site selection — and why attracting skilled labor ranks surprisingly high\n\n\n\n\nResources:\n\n\n  \nLatitude Media: Was 2024 really the year of nuclear resurgence?\n\n\n\n  \nLatitude Media: Is large-scale nuclear poised for a comeback?\n\n\n\n  \nCatalyst: The cost of nuclear\n\n\n\n  \nLatitude Media: Trump’s DOE is reupping Biden-era funding for small modular nuclear reactors\n\n\n\n  \nLatitude Media: Utah bets on a new developer to revive its small modular reactor ambitions\n\n\n\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.\n\nCatalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, and increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data plus tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.\n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "Latitude Media's Transition AI conference on June 12, 2025, in Boston will focus on energy infrastructure in the era of AI-driven load growth. The conference will feature discussions among investors, developers, researchers, and tech companies like FERVO Energy, Form Energy, Scale Microgrids, Spark Fund, KKR, and more. Notable speakers include Caroline Golan from Google and Rick Needham from Commonwealth Fusion Systems. The podcast also delves into the current state of the US nuclear power market, highlighting a groundswell of support driven by political backing, off-taker interest, and capital formation. Elemental Power, a nuclear developer, recently announced a partnership with Google to construct 1.8 gigawatts of new nuclear capacity in the US. The discussion covers aspects like offtake agreements, supplier landscape, regulatory environment, and the role of utilities in advancing new nuclear projects.",
    "transcript": " Mark your calendar for June 12, 2025. Latitude Media is holding its fourth transition AI conference in Boston. This year's theme, energy infrastructure in the era of AI-driven load growth. We're going to bring together investors, developers, researchers, and tech companies to talk about the creative ways to meet data center demand. And companies include FERVO Energy, Form Energy, Scale Microgrids, Spark Fund, KKR, Generate Capital, Orenia, FlexGen, National Grid Partners, and more. Plus, we're going to have a live open circuit episode featuring Caroline Golan from Google, and a live green blueprint episode featuring Rick Needham from Commonwealth Fusion Systems. Get your ticket at latitudemedia.com slash events, podcast listeners, get 10% off their ticket, use the code latitudepods10 at checkout latitudemedia.com slash events. We will see you at Transition AI. Latitude Media, Podcast at the Frontier of Climate Technology. I'm Shail Khan, and this is Catalyst. If you ever went to IKEA and bought like four pieces of furniture the same type and constructed them yourself, the first one, you probably break it and have to go back and find a few things that you're missing. The second, third, and fourth ones, you're just knocking them out of the park in terms of how long it takes you to do it. And the same is true for nuclear, and that's just been proven over and over and over again. Coming up, new nuclear has come into the US, right? Do you want instant access to energy storage supplier pricing that's project-specific, or the ability to compare domestically-made battery and PCS options across the market? Anza now offers the industry's first battery energy storage data and analytics platform to make better development and procurement decisions. Anza provides in-depth commercial, technical, and risk data and analytics to help developers choose the best equipment for any project. Improve your returns and save months of evaluation time with Anza. Learn more about Anza's energy storage subscriptions at go.anzarenewables.com slash latitude, or click the link in the show notes. Imagine a world where connected devices like EVs, home batteries, and smart thermostats work together to support a more efficient and reliable power grid. Well, you don't have to imagine it anymore. This vision is a reality today, thanks to Energy Hub. With Energy Hub's Edge Derm's platform, utilities can create virtual power plants through customer-centric flexibility programs, making it easy to manage distributed energy resources and balance the grid. Unlock grid flexibility and reliability through cross-DER management with Energy Hub, the trusted Edge Derm's leader. Visit energyhub.com to learn more. I'm Shail Khan. I lead the Frontier Strategy at Energy Impact Partners. Welcome. All right, so I've been thinking about this. And here's the word that I would use to encapsulate what's happening in the US nuclear power market. It's a groundswell. I don't think anyone would deny that there's something happening here, driven by a combination of political support and load growth, off-taker interest, capital formation, possible regulatory reform. But let's be clear, it is still true that the US has built one, count of one new nuclear project in the past X number of decades. And that's why a groundswell feels like the right word to me, because sometimes a groundswell leads to a massive wave. But sometimes it doesn't. So in my mind, the operative question is in which direction we are headed here. We at EIP for disclosure do believe that there's a wave coming as evidenced by the fact that we helped to stand up and invested in elemental power, the peer play nuclear developer who's CEO Chris Colbert, you're going to hear from in a few moments. But there is still a lot of work to do to translate all this momentum and excitement into actual capacity on the grid. Anyway, elemental came out of stealth this week and announced a big partnership with Google to develop a three-site portfolio of at least 1.8 gigawatts of new nuclear in the US. See, groundswell. Anyway, there's a lot to talk about though in translating that to real action. And so we brought on Chris, who is the co-founder and CEO of Elemental. Prior to that, he was the CFO at NewScale, which many of you will know is the first SMR company to actually achieve design certification from the Nuclear Regulatory Commission. And again, for disclosure, as I mentioned, we at EIP are investors and elemental and I'm on the board. Anyway, here's Chris. Chris, welcome. Thanks for having me. Let's start by, I guess, getting your overall take on the state of the market, such as it is for new nuclear in the US. You've been in it for a while. What does it feel like? Like, where are we today? Yeah, so, you know, I have been in a while. I first was recruited over the nuclear in 2007 at the first nuclear renaissance. But it's been through its ups and downs since that time. But now I think that there's the right confluence of both market demand, investor sentiment, and regulatory and government policy to really make it happen this time. And we feel pretty well situated to make that happen in this marketplace. So I'm pretty comfortable with where it is and really excited about where we are given the journey I've been through with nuclear. Yeah, you said the first nuclear renaissance in 2007 or so. That one was a mirage, right? So the question is, is this one going to be different? Yeah, so, you know, there's a couple of reasons why I think it's different this time around is that the, you know, all the things that we've learned from that first renaissance and keep in mind, like the Vogel three and four project came out of that first renaissance. That's not a total mirage. Just a project. Just a project. Just a project, you know, and it had issues, but all the things that we learned from that first time around in terms of the policy, the offtake, the execution stuff, I think is now all available to us with people who are involved in that to make this, you know, next round be successful. But really the advent of the demand side where, you know, back in the 2000s, there was not really any demand growth. Now we're seeing phenomenal demand growth, which was strong to begin with, but just, I mean, really taken off with artificial intelligence driving it. And, you know, there's trillion dollar balance sheet from those hyperscaler companies that can really allow nuclear to flourish and happen this time around. That wasn't prevalent last time. Right. So I wanted to talk through this sort of where we are now through four lenses, which I think are the key lenses, and you've already alluded to a couple of them. But so one is offtake and customers. Second is suppliers, OEMs, like who's actually making reactors and of what kind and so on. Third is the role of the utilities, who obviously have a big role to play here. And then the fourth, maybe the big one at the end is the regulatory state of regulatory environment for nuclear projects and nuclear reactors. So the one you talked about the most already, we can just go through relatively cookie, which is the offtake side. What difference does it make? I mean, what I think historically, correct me if I'm wrong, anybody who's considering new nuclear in the United States wasn't really doing a corporate PPA type offtake prior to this new, this new wave right now, where obviously you guys just announced this big deal with Google. All the hyperscalers have made some kind of announcement or another on nuclear. So it feels like one big change there is of course there was low growth in general. But also you've got this class of corporate buyers that are generally universally leaning into nuclear and interested in doing something creative with their balance sheets, right? Going above and beyond just saying, okay, I'll sign up PPA when you get the price down sufficiently. Yeah, absolutely. The first time around it was all based upon regulated utilities getting the rate pairs to underwrite it. And at the time they were trying to underwrite $17 billion, $20 billion projects and their balance sheet or their market capitalization may be $20 to $30 billion. And the growth didn't show up and their expectation for high gas prices at the time didn't come to fruition. We had cheap gas. And so those two things really conspired against the demand side of it, where we have kind of the opposite, where we have pretty much all-time low gas prices but still a huge demand and requirement from the hyperscalers out there as corporate buyers that want reliable base load power and increasingly want to see it be clean and build for long duration so that they're going to have it available to them for a long period of time. So that has really changed from the first time around both in terms of what's driving the demand and the rest of the environment around it from a market perspective, really much better for nuclear this time than the first time. Can you talk a little bit more about what is the market or what should the market be asking of those hyperscalers of the buyers? Again, above and beyond, yes, we will sign a PPA if you get the price down low enough because there's a lot of risk to retire along the way in project development. And then there's also this question of how do we get the cost down in nuclear, which is at least in part a function of building multiple projects, not a single project and then driving down a cost curve. So I know the hyperscalers have been thinking about, okay, what can we do beyond the obvious PPA? How do you think about that suite of possibilities? That's been the biggest change from the hyperscalers probably in the last two or three years, Shell, is that, you know, when I was before I came to Elemental, I was at NewScale, and we talked a lot to the hyperscalers and really said in order for projects to go on, they needed to have some, you know, skin in the game or some exposure to the development cost because, you know, unlike renewables where the development cost might be in the tens of millions of dollars at most, it's hundreds of millions of dollars for nuclear and you can't just have a power purchase agreement to make that kind of investment as a developer. And, you know, it took a while for people to realize that that was what needed to happen. And, you know, necessities, the motherhood and invention is that once people realize that I need clean and large amounts of base-load megawatts, nuclear needs to be part of that. How are we doing before isn't going to work. That kind of moment really solidified over the last, you know, year and a half with the hyperscalers are saying, okay, I need to do more than just say, I'll write you a power purchase agreement. We're going to make some investment. They've made investment, you know, mostly in the technology, but increasingly, as a steal we're doing now with Google is in the upfront development, which is really the key part that needs to be re-rressed. Okay, so that's the customer slash off-take side. Let's talk about the supplier universe. Obviously, it used to be at NewScale, which was one of the suppliers OEMs in the space. But it's an interesting landscape there of like lots of activity, but also very few proven and or approved from a regulatory perspective products, I suppose, that you can buy as a developer. So, how do you think about that landscape? So, you know, we approach it in that there's been billions of dollars invested by these technology developers and either, you know, traditional light water reactors, which you call Gen 3 or Gen 4 reactors, which might be high temperature gas or sodium cooled. And they're all kind of nearing the end of their development process, where they're not quite ready yet. They're all kind of trying to solve for something, whether it's a supply chain or licensing or whatnot. So, we're technology agnostic and the belief that or the knowledge that we can go out and find sites that are amenable to the hyperscalers, what they need for off-take and location, that we can develop in a way that in a year from now or a year and a half now, we can pick the technologies that have made it through. They're sort of crucible of licensing and development and cost estimation that we can pick with confidence that we know what we're going to get, when we're going to get it, and what it's going to cost. They're almost there and, you know, I can't tell you which one of them is going to be successful, but there's so many of them out there that have invested so much. I'm very comfortable that there's going to be, you know, probably three or four at least that are going to make it through that part of it that will be successful in the long term. Just hard to pick now, but that's how we really see it. And if you look at the two different kinds of broad types of the fission reactors between light water and non-light water, the light water is 50 to 60 year old technology. They're just doing it with better designs that are safer and simpler and bringing the cost down. Sometimes smaller so they do more work in a factory versus doing it in the field. And then you have the non-light water types which, you know, have better safety characters and whatnot, but it may not be, you know, really quite ready from a supply chain or the fuel supply or some aspect of it, which probably will take a little bit longer to get confidence around that part of the OEM's equation. But certainly what we're looking for in the early 30s, in the late 30s, we think that that's the early 30s is the light water reactors and the late 30s is when we'll see commercially more of the non-light water reactors coming before. You mentioned briefly the question of scale. This has obviously been another hotly debated topic in nuclear world, which is, you know, historically we've built large mega projects pretty much exclusively. There are technology companies who are developing everything from micro reactors that are a megawatt or five megawatts or something like that up to, you know, gigawatt scale type reactors. The deal that you just announced with Google is for three projects of 1.8 plus gigawatts total. So 600 megawatts plus per project. Is that scale born out of sort of what you view as the sweet spot given the technology landscape or is that more a function of, well, this is the scale that a hyperscaler needs to fulfill the capacity of a data center or both. It's really both because we're solved for two things, right? One is they have huge needs, but they want to see us get down the cost curve, which means you need to have multiples. And when you look at the sort of intersection of doing multiples, the size of the need they have, the capital they can deploy, and what it costs for various, whether it's micro, small or large reactors, the small light water reactors fit more generally into that category, as well as some of the smaller Gen 4 reactors as well. So this is kind of anything from 75 megawatts to 300 megawatts electric. That fits pretty well because again, you get more swings at bad. So if you have one not work out, the other two will carry you through, which is how you want to see a portfolio work. And when you have multiples at a site and multiples in a deployment, you can get down those cost curves both in the factory and in the field more readily than you could with a large reactor. So that's really how we saw it playing out in real time. And the hyperscalers looked at all of them. And as our goal as elemental was to find the right solution that kind of threads in the needle between the OEMs, utilities, and the customers in terms of what makes the most sense. And that's where we landed up in our conversations with Google. Okay. So to sort of encapsulate what you're saying overall on the supplier side, your bet is that currently nobody's quite crusted over the commercial readiness hump yet. But you think there will be multiple vendors OEMs who will get there over the next year or two. And so you're basically positioning yourself to wait and see who gets through the crucible or over the crucible around the crucible, whatever the metaphor is meant to be. And then and then pick the winners there. But that's obviously contingent on anybody sort of like getting through and getting commercially ready, which maybe is a good segue to the next category here, which is the regulatory, the state of regulatory and permitting. Talk to me about where you see that. Yeah. So I mean, number of designs have gone through design certification process, which gets your license for your technology. Think about like Boeing gets their 787 jetliner approved. Some folks have gone out and gotten construction permits or their applying form. So that's getting the permission to start constructing it. Nobody's gotten yet to the point of an operating license where you get the ability to load the fuel into these new designs. So that's kind of like the remaining one. But for the light water reactors, this is really 50 year old technology being run by the Navy successfully for, you know, since the 50s and then commercial nuclear fleet since the 50s. It hasn't changed dramatically in terms of the fuel type or what you do. Basically, you know, you split atoms, create heat, make steam, turn a turbine, make electricity. It's that simple. So all these technologies are going to work. And I would point out that, you know, all the technologies that have been deployed just most recently, whether it's an EPR, an APR 1400 or an AP 1000, they may have had challenges getting to the finish line. But once they got to the finish line, they are all working and an AP 1000s working very well. So for light water reactor technology, there really isn't a technology risk. It's just pulling together the right pieces to, you know, de-risk it in the front end to get to a final investment decision and then start construction and have a solid plan to be successful when you get into the field. Because that's where the challenges have been traditionally. Do you see any evidence? There's obviously been a lot of talk about having the NRC reformed in some fashion or another to speed up permitting. Do you see any momentum there from the NRC? Has anything changed? Do you need anything to change there? So, you know, there's been a lot of legislation over the last several years really driving the NRC to revise his policies, become more balancing its approach for, you know, making sure they'll maintain the safety to the public and the environment. But, you know, recognizing that there is a public benefit for nuclear power given its clean base load attributes. That has been demonstrated by reduced timelines for them to review various applications that I've observed just in the 15 years I've been in the nuclear space where, you know, what once took four years is now being done in two years. The hope is that we'll get down to maybe a year, year and a half. But, you know, what you'd like to see is that for the base load technology, which is what it is, to be sort of in the same timeframe of development of traditional combined cycle gas plant, which might be, you know, two years of development and licensing and then two years construction and then, you know, four years or five years, you're operational. We're not there yet, but I do see a path by which you get down to from the seven to eight years we're looking at the first ones. They're getting down to five or six years, which to me really makes a game changer when people have their planning horizons. That brings it all forward to be a real equal discussion. And, you know, I think we're going to get there. And we haven't been getting there clearly. All right. So then the final lens through which to look at the current state of affairs, I think, is utilities who operate basically all of the existing nuclear in the United States. Georgia Power is the one company that has actually built a new nuclear generating facility in the past, I don't know, three decades, four decades, whatever it's been. And now they, many of them, are also exploring new nuclear. But I think, you know, coming into it, maybe a little bit more caution, at least than the hyperscalers seem to be. What's your perspective on what you're hearing from utilities? Yeah. So, you know, what I hear from utilities now is what I heard from utilities back in the past, right, is that, you know, they fundamentally can't take development risk. And, you know, that's a having done fossil plant development. I did that for 15 years of coal and gas plants. That's a business where you expect to make two or three times return on your investment, on the development of the FID. And that doesn't happen for utilities. They're stuck at 10%. Right. So they're taking three X risk for 10% return. It just doesn't work out for them. And, you know, we're seeing with a, with the many of them, not all of them, but many of them, is a desire to have a developer like elemental come in, align with the hyperscaler, take care of the commercial risk, take care of the development and the construction risk, and then transfer the asset at commercial operation when, you know, you can just look at what consolation trades that in terms of what their cost of capital is. Pretty easy from the do that, very huge markups and value to them to do so. Or they can operate the plant as the operator for in their territory. And we're looking at all those models with them. But, you know, what we really see is that the recognition that somebody needs to come in to take that development and construction risk, the government's taking a piece of it, but there's going to be a slice left over from the private sector. And utilities just aren't the right investor for that, because they're just a fundamentally different risk profile from what a developer does traditionally. I think the other thing we're seeing from utilities is interesting is like, that the subset of utilities that already have operating nuclear that either has retired already, I'm sorry, was operating and has retired, or is scheduled to retire, or that they were thinking about building, but then stopped building. I mean, they're all kind of re-examining all that and saying, oh, there's maybe there is a nuclear renaissance coming here. How do I take advantage of the fact that I do actually have experience in nuclear to get that capacity back online or online in the first place? And that seems kind of universal, right? Like, I feel like every utility in their boardroom, if there's nuclear somewhere in their fleet, or there was supposed to be nuclear somewhere in their fleet, they're taking a fresh look at it. Yeah, I mean, I think that most of these utilities that are operating utilities of nuclear plants, if they had the opportunity to pick up an existing operating asset or one that was largely complete and de-risked, they'd be very inclined to do it, because you just look at what constellation stock price has done. I mean, that's the example I look at since it floated. It's just been phenomenal returns because of the preponderance of nuclear in its base. And that's a purely merchant generator. It's not even a regulated utility constellation. It's phenomenal in terms of what it's done. But that just proves the value of nuclear to all these folks. It's how do you get the assets on there? And interestingly, through the investment that EIP made and elemental were exposed to a large number of those operating nuclear utilities. So we have that capability of working with them and they're familiar with what we're doing. And in part, validate what we're claiming to do, which is to really span the void between the billions of dollars that have been invested by OEMs doing new designs and the gigawatts of demand required by hyperscalers. How do you meet those two things and us coming in the middle and making that happen is really what elemental is about. Catalyst is brought to you by ANSA. ANSA offers a one-of-a-kind data and analytics platform and advisory services to support better project development and procurement decisions. For energy storage developers, ANSA's platform provides crucial information that you never had easy access to before. Now at your fingertips is real-time pricing for a long list of system configurations to suit any project. ANSA provides a 360-degree view of the market with lifecycle cost analytics and commercial technical and risk data. With ANSA, developers can easily determine which products to use in their designs, finance models, and RFPs. Learn more about how ANSA helps save time and maximize profit at go.ansarunuables.com.com. latitude. Catalyst is brought to you by Energy Hub. Energy Hub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. The Energy Hub platform takes the guesswork at a balancing energy supply and demand. It uses machine learning to control customer-owned distributed energy resources, like EVs, home batteries, and smart thermostats, to precisely shape load profiles for grid flexibility and reliability. As the industry leader, Energy Hub helps more than 80 utilities manage 1.6 million devices. That's more than any other edge derms on the market. Click the link in the show notes to learn more or go to energyhub.com. All right. I want to talk about project development for nuclear because I think it's actually something that people certainly we hadn't thought enough about before we started chatting with you folks and getting involved with Elemental. It's different and distinct from project development of a wind or solar project, for example, or a battery project, or even a gas or coal project. So you just give me a quick snapshot of end-to-end. What does project development look like for a new nuclear? We start off with, and this is the first thing we did, was we went out, find a customer, somebody who's willing to say, I want 20 to 30 years of power at this price range and willing to put in a portion of the development capital. That was probably the first 12 months of our existence was doing that with all the hyperscalers. Just Google happens to be the first one across the line on it. And then working with them saying, where do you need these assets and working cooperatively with them and their host utility? Because many times they're building data centers where they have existing data centers and they know the existing utilities. We're coming in saying, we don't want to get between you and your customer. We just want to give you what your customer wants in a way that works for you as a utility. That's a very different model from what you saw in the late stages of fossil, which I participated in, which was basically if you build it, they will come. Also with renewables, we'll go out and get a plot of land, connect it, and then go hunt for a PPA from somebody. We've reversed that process by putting the customer in the demand forest, then finding a site, working with utility, go through the red flags analysis of it, do it in a technology agnostic manner, which you can do in the NRC process under an early site permit application. And then once that's in, and you've gotten the site proven up from that perspective, and that's really the environmental characteristics of it, you then select the technology and do a construction permit that's particular to that technology. And that brings us to say 25, 26, we're doing that first part, 26 to 28, we're doing a construction permit, 29, we start construction by 32, 33, we're operating the plant. There's a lot more in there than what I just said, obviously, but there's a lot of pieces to it that's more akin to a fossil plant development, but just much more expensive because the amount of work you have to do with the regulator, any amount of design you have to have done. And the fact that unlike a two-on-one CCGT, which you can go out and talk to Siemens or GE or, you know, Alistomor, whoever's out there doing those now, they have proven designs. We're still getting through that end of the development cycle for the new technologies in nuclear. You talk a little bit more about the site selection bit. Like what are the, just at the high level, what are the characteristics, what are the checkboxes you have to check for a site to be suitable for new nuclear? So, you know, it comes down to what's the technologies by size you're looking at, because generally size dictates how much fuel you have on the plant, and the amount of fuel tells you how much danger or risk you have. So, the smaller plant size is the small modular act you're looking at for Google. It can probably fit about 100 acres or so or less, and you have no other consequences beyond that. But the sites have to be seismically, you know, qualified for the design you're building, and some designs are more seismically robust than others. So, you kind of have to envelope that part of it. You want to be sure you have access to transmission, because I'll tell you that, you know, it's going to be easier to permit and get a nuclear plant built than it is to get new transmission lines. And that's just historically how it's been, you know, everywhere I've been, whether it's in the US, the UK, Australia, over in Taiwan, Philippines, people think that somehow transmission is a uniquely American problem. It's not, it's a challenge wherever you go, because transmission lines are infrastructure that don't provide a lot of spin-off economic development for the people whose property it crosses. That's just the fact of life. So, you want to be close to that. But fortunately in the US, we have a pre-robot system where any former coal plant or any former large industrial site will typically have the transmission infrastructure necessary for it. So, that's the key piece of it. And then beyond that, it's pretty much, you can be in a lot of places. And we have a proprietary system that we've developed through a number of different databases and vendors that rapidly just select down those sites that meet those criteria, and then layering over it, where is it that our customer wants to be in the utility they want to work with. And that's probably the interesting thing, because people, started a lot of investors asking, like, well, what's the right place to be? And the answer is, the right place to be is where our customer wants to be. Well, where do they want to be? And what we found is that there is some geography to it, but they are more focused on who the utility is they're working with, because they feel they have a better relationship with some utilities than others. And given that they're going to be making these investments for assets that will provide benefit, not only to the hyperscaler, but also to the rest of the grid, because frankly, once you add a very robust nuclear plant to the system, it benefits everybody that's connected to it because of the reliability and the stability it brings to the grid. They want to make sure that they're getting proper benefit for that recognized and what they're doing. And, you know, some utilities are more evolved than others in doing that, or the discussions between the hyperscaler and utility are more evolved in that regard. So, you know, that's kind of the process that we've been going through in the site selection. And, you know, I would say that finding sites hasn't been the challenge quite honestly. It's making sure we know where the people want them. Once they tell us where they need to be, we can find sites. All right. I want to get to the, I guess, the last key questions about nuclear in the US, which are how much when and at what cost? Maybe we'll start with at what cost. You know, the knock on nuclear in the US has been to the extent that we've done any of it. It's been ended up being very expensive, cost overruns, et cetera, et cetera. And there's lots of different theories on how you drive down costs and lots of different examples from other countries, whether it's Korea or China or whatever it might be. Given your strategy, what is your thesis on how we get nuclear in the United States to be cheap enough to be economic for whoever the customer is? Obviously, it's a different answer if you're Google or meta or whatever versus somebody else. But like, clearly, we need to drive costs down. It's not entirely clear. The first project anybody builds is going to be the cheapest. So, what does it take? Is it just repeatability? Do the same reactor over and over again? Is it at a site level? Like, what's your thesis on cost? Yeah, there's probably two levels to it. One is repeatability, right? So, just doing a one-off design isn't going to work. And so, that's why it led us to the three projects with Google. Is three a good number? Yes. Would five be better? Absolutely. Does it need to be five? It would be a bigger check for people to write to do that. So, you have to be constrained by what that part is. And to put it mildly, you can't do enough large reactors in order and raise the capital to do it. It's just too much of a check to write to make it happen. So, you need that repeatability because Google and everybody we've talked to recognizes that, okay, the first one is going to be more expensive than the second one than the third one. And if I have a project that has two units on the site, the first unit on that site is going to be more expensive than the second unit on the site. That was true for Vogel. That was true for Baraka. That's true for any single, anytime you've looked at a construction that multiplied the same units in the same site. Units two, three, and four, you're amazed at how much less they are. But it shouldn't be surprising because if you ever went to IKEA and bought like four pieces of furniture, the same type and constructed them yourself, the first one, you probably break it and have to go back and find a few things that you're missing. The second, third, and fourth ones, you're just knocking them out of the park in terms of how long it takes you to do it. And the same is true for nuclear. And that's just been proven over and over and over again. So I think the key thing is that the repeatability in going in there with the mindset of you're doing multiples on a site and multiple sites really allows you to have the confidence because it's been demonstrated even at Vogel. Unit four, I think was 40% less than unit three. I mean, just think about that part of it. So if you start off at unit four, instead of unit three years example, you probably would have been OK. But that's not the way it played out. And then there's the site specific stuff, which, you know, again, lessons learned is just make sure you have a good plan going in. And we all know what a good project looks like. You have to go through and have the design complete, have the supply chain lined up, and more importantly, have a plan for attracting the labor you need when you start and keeping the labor there for the three years you need it. And that's, you know, not that hard. You just going to be able to, as an owner, admit that if I have to pay a person $5 extra an hour to keep working my project as opposed to going down to the data center project down the road, then you pay that because if you don't, the cost for delay is not $5 an hour. It ends up being five times that. So it's really kind of having a plan and sticking to it and working with labor, because that's the most uncontrollable aspect of this because, you know, we're a free country. And labor can go where it chooses to go. You're not going to prevent that. So your best goal is to make sure you incentivize them properly and treat them well. And you should have a successful project. All right. So that gets to our final question, which is how much and when, not specific to elemental, but what's your view? I mean, you did mention some timelines for projects you guys are working on where you expect commercial operation in the early 2030s. Realistically, given what you see out in the landscape in general, how soon do you think we could or will have new nuclear operating in the United States? And how much can we get in like the timeframe that that matters to today's customers? Yeah. So, you know, our goal was to have a gigawatt under construction by 2030, 10 by 35 and 100 gigawatts by 2040. We're now looking at 4.2 gigawatts by 2030. So you've already quadrupled that or halfway there to our 2035 goal. You know, I think realistically for commercial deployment, it's going to be the early 30s. OPG is just in Canada. So it's not part of the United States yet. It's not Tario Power Generation. Yet that Ontario Power Generation up in Canada, they're talking about their first plant being a G E H B W X 300 starting construction, nuclear safety related construction. This month or next is what they had announced to have an announced it yet. Then being operational by 2029 2030. So North America, that's the timeframe. You have others like Dominion, Duke, TVA, AEP, a whole tech with their plant out of Palisades, all talking about a light water reactor, small ones in the early 2030s timeframe. So I think that's still a pretty good prognostication on it in terms of when we'd expect to see it. Arguably some are further ahead than others. But again, whoever starts first doesn't mean they always finish first. But I think for a number of reasons, we can see these folks being available and working those projects in the early 30s. In terms of the cost, the first ones are going to be expensive. But overall, we're looking at once you get down the curve of probably $10,000 a kilowatt. So if you have a 600 megawatt plant that be about $6 billion, the first one might be 15, 20% more than that. The follow on it's going to be less and less and less. So we expect these to come down fairly dramatically over time as we get through it. But getting through the first one is key. And we have a plan for doing that to be successful. And we have great support from folks like Google who recognize that, OK, I'm willing to accept the first one is going to be more expensive. But I'm sure as heck, not going to accept it the second and the third one costs the same. And they won't. We're comfortable with that. All right, Chris, great to finally be able to talk about this publicly excited to go on this new nuclear journey with you for the next hopefully decade and not decades. Well, I've already been at it for 15. So it's another 20 or so, right? That's right. Yeah, I'm with you. I expect to have 10 gigawatts by 2035. And you can hold me to it. I plan to. All right. Thanks, Chris. This is great. Chris Colbert is the CEO of Elemental Power. This shows a production of latitude media. You can head over latitude media.com for links to today's topics. Latitude is supported by Prelude Ventures. Prelude backs visionaries accelerating climate innovation that will reshape the global economy for the betterment of people and planet. Learn more at PreludeVentures.com. This episode is produced by Daniel Waldorf, mixing and theme song by Sean Markwan. Stephen Lacey is our executive editor. I'm Shale Khan, and this is Catalyst.",
    "release_date": "2025-05-09",
    "duration_ms": 2427000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI2246629710.mp3?updated=1746760439",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-29T01:57:57.501755"
  },
  {
    "title": "Frontier Forum: Unlocking next-generation VPPs",
    "description": "In the mid-2000s, Ben Brown started his career designing demand response programs that relied on pagers and telephones. Today, as Renew Home's CEO, he's leveraging AI and tens of millions of connected smart devices to help households save energy and create an entirely new approach to grid management.\n\nRenew Home is building a new kind of virtual power plant that moves beyond occasional emergency events toward continuous, subtle energy shifts across millions of connected households.\n\n\"The biggest evolution is connected devices,\" explains Brown, who previously led energy product development at Google after its acquisition of Nest.\n\nDuring his time at Google Labs working on large language models, Brown also witnessed firsthand the massive energy demands that AI would place on our grid.\n\nThis realization, combined with his work on smart home technology, led Brown to envision a new approach to virtual power plants – one built on subtle, personalized adjustments across millions of homes rather than occasional disruptive events.\n\n“There's actually a lot more value continuously throughout the year, over hundreds of hours where customers can save more money by helping support the grid.\"\n\nWith DOE projections showing a 200 gigawatt peak on the US grid by 2030, Renew Home's approach offers a compelling alternative to building new power plants. By focusing on customer control and personalization, they've achieved 75% opt-in rates, while creating a resource that is far cheaper than gas peakers.\n\nIn this episode, recorded as part of a live Frontier Forum, Stephen Lacey talks with Ben Brown about the next generation of virtual power plants. \n\nHow does Renew Home’s approach differ from demand response or battery-based VPPs? And what role can it play in addressing the grid’s urgent needs?\n\nThis is a partner episode, brought to you by Renew Home. It was recorded live as part of Latitude Media's Frontier Forum series. Watch the full video to hear more details about next-generation VPPs.",
    "summary": "Ben Brown, CEO of Renew Home, discusses the evolution of demand response programs from the mid-2000s to now, emphasizing the shift towards connected devices like smart thermostats. He highlights the importance of personalized continuous demand response and customer control in achieving higher engagement rates. Ben explains the significance of leveraging existing HVAC systems as grid interactive resources, alongside other devices like batteries and EVs, to build virtual power plants cost-effectively and quickly. He also shares insights on scaling up VPP capacity in Texas and the changing perspectives of utilities towards distributed resources.",
    "transcript": " This is a frontier forum brought to you by Lattitude Studios. In the mid-2000s, Ben Brown worked at Constellation designing efficiency and demand response programs. DR was gaining traction in the residential and commercial markets, but the resource and the technology behind it looked a lot different than today. Well, I think one of the biggest changes is we don't use pagers anymore. I understand there are red phones still occasionally though. Yeah, that part I don't work on as much anymore. But yeah, I think that the biggest evolution for sure is now more and more that we have connected devices as part of what homes and households have been adopting to help kind of reduce energy costs and have more control over comfort in their homes. And using this as a great way to engage and positively build a trust with customers I think has been one of the biggest changes of the last 15 years. There are now tens of millions of smart thermostats and smart water heaters across the US and they've opened up a vast opportunity for managing demand that wasn't available in those early days. In 2012, Ben went to Google where he worked on the company's smart home and Wi-Fi platforms. And later after Google acquired the smart thermostat maker Nest, he led the development of new energy offerings. There, he saw the potential of another emerging tool, machine learning. You could see the power of these tools used towards a consumer product experience that was just really unique. The original Nest thermostat used machine learning to predict heating and cooling needs and respond to some dynamic factors like weather, which set the foundation for Google's demand response offering. And the technology has radically improved since then. And that has evolved a lot, obviously over the last 15 years where now the capability is anticipating when electricity prices are going to be going up or down, having unique insight into in terms of like the thermal model of your home, having unique insight into like all the complexity around the grid and grid congestion and how that's going to evolve over time. That is exactly the type of things that AI is really, you know, kind of really helps it sing. That work brought Ben to Google Labs where he worked on large language models for energy and finance applications. And that's when he saw the other side of AI, the energy demands. And you could absolutely see just how energy intensive these new LLMs were going to be, right? Like if you think about the idea that maybe as each individual having kind of an AI co-pilot, that's the equivalent of like having hundreds of millions of new HVAC systems all of a sudden being put onto the grid. I mean, obviously we'll find efficiency, but it is an interesting kind of like analog to think about from just the infrastructural perspective and what it needs to do, what we would need to do as a system to support all these new really compelling use cases. Today, Ben is the CEO of Renew Home, a company building a new kind of virtual power plant that helps households save money while offering reliable grid capacity at scale. And he says we're now at a moment with all these converging forces. Ubiquitous smart devices, powerful AI, and spiking utility demand are setting the stage for a new generation of VPPs. There is going to continue to be, you know, more and more of a challenge to our system, tries to struggle to grow to meet that demand, not just on the aggregate basis, but really on the distribution and location basis. And I think that's also what's very unique about things like virtual power plants or DR versus just citing large central power plants. I'm Stephen Lacey. This week, a conversation with Renew Home's Ben Brown. It was recorded live as part of our Frontier Forum series. AI and electrification are driving load growth at levels we haven't seen in decades. The Department of Energy projects will see a 200 gigawatt peak on the US grid by 2030. So I caught up with Ben to talk about designing VPPs in this new era. What role can they play in addressing the grid's urgent needs? I deeply believe that we're in the infancy of how impressive and how powerful these use cases can get. You talked a little bit about the limits of demand response. Can you talk about why you think it offers diminishing returns as a one-size-fits-all solution? Yeah, so I think when we think about traditional DR as what was originally constituted maybe 20 years ago, plus where in which we had like direct load control, the canonical example that like folks think back on is those old AC compressor switches, where kind of essentially you would have something sent out to a system to turn off the compressor. And so household would be like turning up, turning down the thermostat to get cooler and nothing would be happening and it would just lead towards frustration. And so when we first launched Rush Hour Awards 12 years ago, a lot of the intent there was to say, hey, if we could prove out that customers with more control, the idea that they can always change the thermostat, adjust, always get to a different comfort set point in their homes. With more control, you'd have a much higher opt-in rate and you would be able to get more folks enrolled while still providing similar incentives for peak shifting and peak reduction, that we could achieve much larger rates of folks and through larger numbers, we would actually be able to deal with smaller opt-out rates across the entire population. And that was proven out, I think, really well over the last 12 years with kind of the evolution of DR in terms of what we thought for Rush Hour Awards and DR2.0 type of concepts. I think where we're at now though is that those were really targeted towards peak hours of the year, maybe 40 to 60 hours a year, where we were really just dealing with a really heatwave. Now, obviously, we're seeing one more variable weather throughout shoulder seasons, like the last couple of weeks, we've seen a lot of kind of heat waves or cold waves and that all of a sudden stresses the grid in unique ways. And so it's a lot more hours of the year where you're dealing with these kind of mini peaks on the system that the system really wasn't built for. And so how do we kind of leverage more of an ongoing continuous resource to support that? But then I also think that the idea when we start to incorporate in some of the distribution and location value of these things where in which there's actually a lot more value continuously throughout the year, hundreds of hours of the year, where in which customers can save more money by helping support the grid in unique ways that would be different from traditional infrastructure is also really compelling. And I think a really good direction for us to be going in. Okay, so tell me about how continuous demand response works. These subtle personalized continuous shifts. How does it actually work? Yeah, so I think a huge part of it comes down to this idea of control and personalization. At the end of the day, like as part of its core specifically for a smart thermostat, it wants to do its job, its job and its promise to a household is to optimize comfort while minimizing costs. And so when we think about kind of extending that more holistically, traditionally that was just really around efficiency, because we didn't have time varying pricing. In the world we're moving to where in which we have more now time of use rates. And we also have more stress on the system on a continuous basis where in which households can benefit from reducing that stress and getting rewards for that, it makes sense for us to lean much more into this idea of personalization. And really going deeper around, hey, we understand the unique rhythms and habits of your household, like kind of the flow of your day and where you're going and kind of what your preferences for temperature are during a given day. And we also have anticipation, because you have to remember like specifically heating and cooling is an asynchronous optimization. Right, it's something that like we want to get the house to the right temperature in 30 minutes or an hour, and so kind of have to be able to project what the next couple of hours of cost and great congestion, and your time to temp or time to heating or cooling your home based on the thermal envelope, all of those things are really well incorporated into something that, you know, through deeper personalization and optimization that we can do that's really targeted to households in terms of their preferences and minimizing their costs. And so back to this idea of continuousness. The only way to do that well is by really getting these things right and being highly personalized for households, so that we can incorporate all these benefits to be able to deliver the core promise, which is you're comfortable all the time. And we are minimizing your cost and helping supporting deeper aspirations that you may have around minimizing your consumption of carbon rich energy or minimizing the stress on the grid and these other things that you might also care about as well. And what are you looking at for opt-in rates so far? Yeah, so I think that's one of the biggest things that like at its core we can talk about these things, right? Like it's a really it's a cool concept to talk about it in the abstract and I think a lot of the industry has for a long time. And what has been really unique I think across the industry is what we've been able to prove out through opt-in rates. And so we have actually seen both opt-in and engagement that we're getting nearly 75% of all new Nest thermostat customers that install a device are opting into energy shifting. And what's great about that is that it's not only that happening in terms of engagement and opt-in, we're also seeing nearly all of those folks years later still engaged and still leveraging it and having really high satisfaction around it. And so to me, you know, kind of proves out the central point that we've been trying to articulate for a decade, which is with users having more control and a better experience in their home, you actually can get to an order of magnitude higher engagement and opt-in rate than what we have seen traditionally. Right, if we think about like the traditional demand response programs from 15 years ago, you know, the industry was probably seeing 10 to 20% opt-in rates. And so if we think about a world where in which we can engage a much larger population and then be able to have personalization, like there still might only be 20 to 30 or 40% that want to kind of maybe trade off more comfort for higher rewards or cost savings. And that's great. And we can segment out that population, but it means we can, it would be great to still have the other 40 or 50% engaged even if the optimizations are more subtle. So there's this very, sometimes very intense debate in the industry about utility control or customer control, you know, along the spectrum of distributed resources. And you firmly believe that customer control can bring better outcomes. Why? I think it's important for us to not look at that choice through a singular lens, which I also think can be somewhat flawed sometimes. So to me, customer control is a feature, not a bug. And the reason I say that is because the more customers feel empowered, the more they feel engaged in this overall part of supporting the energy system, dealing with kind of rising challenges to the system that have been increasing costs for a lot of folks in terms of, you know, the increased demand that we've been seeing across holistically, but also some of the climate oriented challenges that we've been seeing. And so having customers engaged in part of this is a really important feature because they now feel more empowered and the collective part of the solution going forward. And so I think that's just a one fundamental thing that I think sometimes gets kind of overlooked. The second important thing to my mind is if we're trying to build a resource when we think about like the power plant side of the virtual power plant analogy, a lot of it is actually you're trying to build a resource that can perform for 15 years plus, right? If that's kind of us trying to say that a residential aggregated resource is as good as a natural gas power plant. And I think if we're trying to push in that direction, in order for folks to want to engage and be supportive of the system longer term, they have to feel like they're in control. If they don't, and we kind of, if we kind of don't have trust in that system, and we don't kind of in continuously engage and reward customers around that, then it's one of those things that we could see folks Peter out of that over time. And then it does not have the same kind of benefits that you would think about from a power plant in terms of longevity. And then I think the last part about it is the whole benefit of a distributed system, you know, from like, you know, kind of all of our, you know, backgrounds and statistics and whatnot is like the power of large numbers, which is the reality is, when you give individuals control or a long system and you have hundreds of thousands of customers or a million customers, you know, stochastically, we can predict, you know, how these things will perform in aggregate. And so actually having control the entire time leads towards less of these kind of asymmetric outcomes where all of a sudden something happens because people are in control and it's more stochastically predictable versus another outcome, which we'd go the other direction. So there are many models that are approaching batteries as core to virtual power plants. And you really think that HVAC systems represent a really important resource. So you talked about why you're focusing on HVAC. First, that you're expanding to all these other connected devices in the home. How do you see these grid interactive devices evolving over the next five to 10 years as part of the foundation of the VPPs you're developing? You know, we tend to sometimes get really excited by the, you know, kind of silver bullet technologies, or we get excited about something that feels like is a new, a new evolution that is not actually has not had a massive adoption yet, but feels like if it did have adoption would have a bunch of, you know, beneficial characteristics in terms of supporting the needs we have going forward. This is a all hands on deck moment. We have, you know, we'd very different than where we've been for the last couple decades, as you mentioned, we have mostly had flat demand. And so now as demand is increasing substantially, and you're just going to increase substantially for the coming decade, you know, we really do need to look at all of the solutions that are in front of us. And so to me, the idea of not incorporating what is by far kind of the largest existing set of resources in infrastructure we have in the country, which is the 80 million plus central HVAC systems and 80 million plus hot water heating systems that is existing thermal storage infrastructure that exists across our country would just be kind of insanity to me, given the size and scope of the problem. It doesn't mean that as we are adopting EVs at scale, and as we are adopting more and more battery storage at scale on the resi side, that we shouldn't of course incorporate those are, those are going to be critical resources. They have a lot of different benefits and characteristics that does kind of thermal storage from HVAC or from hot water heating. But we need to leverage all of those, because you know, from the benefits of both the scale that we need, and the adoption curves that we have to ride, it is important that we're having a solution that is, you know, benefiting from the fabric of those things working together in concert. I presume a VPP is a lot more cost effective than a natural gas speaker, and a lot faster to deploy. You're looking at a moment when it's really impossible to get equipment. Goodness knows what's going to happen with tariffs to make build out more expensive. So tell me about comparing a VPP to like say, an alternative gas speaker option for a utility. How should they be evaluating these things against each other? Yeah, so I think that there's three things. So one is time to market, which we've talked about. So like if you're, you know, if you're still waiting on a turbine for until 2032, that's one. Two is definitely cost effectiveness. You know, if you look at the Brattle Report, it's a good example of that. We believe that VPP similar capacity resource would be 60% of the cost of a natural gas speaker investment. And honestly, that's probably outdated because now we know that natural building natural gas, um, peakers are even more expensive over the last few years, just because of the wait times, uh, and some of the, uh, the additional costs that are going into it. And it would be, and then VPP would also be 40% of the cost of a utility scale, uh, battery, um, investment. So we believe those, you know, for the first two timeliness, cost effectiveness, and honestly, the third thing, which I think also just gets overlooked a lot, is the distributed nature of the resource. We've talked about that, and that's actually something that is not getting incorporated nearly enough, but we all know a huge part of our challenge going forward is updating the distribution infrastructure that we'll need on an ongoing basis, especially with new use cases coming online with more, um, you know, EV charging on the edge, um, more home electrification. These are challenges that are definitely going to be, um, a key part of our distribution challenge going forward. And so I think that the, um, the decentralized nature of a VPP represents when engaged properly and incentivized properly with homeowners, uh, represents a huge benefit. Um, that honestly will be dependent on, uh, you know, going forward. So you've got a plan to build out a gigawatt of capacity in Texas. What, what are the phases of scale for building that much capacity? You know, what's beneficial about the partnership we have with NRG, um, in Texas, which we announced earlier this year is that, uh, one, we have large existing customer base of, um, nest thermostat customers as well as other, uh, platform partners that we have in addition to, you know, obviously a large, uh, huge, large, base of NRG, uh, retail customers, uh, in Texas. And so what's nice about it is that when fully engaged and brought together, um, that already represents a fairly large resource, um, of the, uh, where we're starting from in terms of, you know, getting towards that one gigawatt goal. Uh, but a huge part of getting to the one gigawatt goal will also be, you know, starting to give access to low costs and no cost thermostats, smart thermostats across, you know, NRG's existing user base and growing user base, also deploying other, uh, targeted technologies, whether that's batteries, EV chargers, really thinking through how we support folks on the home electrification journey. And so, you know, we, we definitely have a great scale of households and engaged households across Texas. And so a large part of what we're going to be pushing as quickly as we can on, uh, with a great partner in NRG is really just distributing these technologies to folks. So what has changed the most since you've been working on this in terms of how utilities and grid operators view these resources? So I mean, I think, you know, the last 15 years has been first space, which we talked about was proving when we think about when we launch rush hour awards, then it was about proving to utility partners that if we gave more control to users, we would actually build a much larger population of folks that were enrolled, that would be a much more reliable resource. I think we approved that out very effectively, getting to over 1.5 million thermostats enrolled in programs over 100 plus utilities. I think that was a really important phase of like moving the model from non controlled resources to a place where customers had control. So I think that was the first model. I think the next step of where we've been proving out why we launched for new was proving out that small subtle energy shifts with deep personalization across, you know, millions and millions and millions of households would actually have a even bigger benefit, both from a peak perspective, but also from a continuous perspective. And to me, like that is a huge part of what we've been engaging with partners on over the last two years, which is, hey, let's prove out that this resource has huge benefits that are not necessarily what we had thought about before, that if we think about an even larger population, the 75% of folks that are getting into these, you know, now that are enrolling in energy shift, how do we think about kind of a more deeply personalized continuous way of engaging with those folks that prevent that provides a much larger resource across the country. So like a good example on that one, and we've talked about this, the reason we've been really public about the numbers is to try to help with this, you know, kind of this chicken and egg question. And we've been really clear that saying, hey, we have over 5 million households that have enrolled, which represents capacity resource that is shiftable across the country. So, you know, not just in Texas, not just across the programs that we've already enrolled folks in, but there's capacity sitting across on the sidelines across the country. And I think the reason we've been public about that is just saying, hey, we want to let you know that most likely in your market, there are probably 50 to 300 megawatts of resource ready to go. We'd love to engage with you on it. And I think that that to me is really important because a lot of what we've been talking about in the industry is if we support incentives for programs and we build certain capability sets with technology, then eventually we can bootstrap our way to a meaningful resource. And as we all know, unless we're talking, you know, in the 25 to 50 plus megawatts in terms of actual resource, it's harder for energy partners to see it as meaningful. And so the scale is really critical to speak to. And that's kind of why right out the gate, we've just been like, no, we already have a lot of scale. And now we want to scale it even more so that it is meaningful enough for energy partners to engage with. All right. So as we wind this down, I want to get your thoughts on either the tech or adoption trends that you think are going to shape the industry going forward. So you've been at this for a couple of decades now. What do you think is going to drive growth or change over the next half decade or decade? So I think thematically, we've talked about, I've talked about control, could a good bit around like user needs for more control over our energy costs, more control over homes. And actually, I think control is a good theme. Control and empowerment is a good thing to think about when it comes to like technology over the next decade, because when we think about generative AI, my view having worked on this stuff is that most everyone is developing tools that are meant to augment our capabilities and give us actually more control as people doing work, people building businesses, people trying to operate their, you know, manage their costs in their homes that like generative AI is a massive augmentation to skills. It's a great, very powerful tool that actually gives us more control and more empowerment than somehow trying to take it away from us. And so I think that is really critical because I think generative AI could, you know, I think people worry that we'll go the other direction. I actually think a lot of folks are investing in it. I actually think it's the same thing when it comes to its potential effects on costs for customers and costs for the grid, that we have to think about how we drive empowerment and control around giving households more control over their energy costs because of the effects of growing demand. That is another key thing that I think that if we don't push in that direction over the next decade of giving more control, more empowerment with solutions to customers, folks will get more and more unhappy with rising energy costs. And so I think there's like a really good trend there around giving more control, more empowerment with more demand side resources to households to help them navigate kind of a growing demand environment that we just haven't had to design for historically. And then I would say just lastly, I really believe because of the growing demand environment that the partnerships between, I actually feel like energy companies, utilities are going to have better, deeper relationships with customers. I actually think it will go in the other direction that we've seen trend wise historically where actually there's a huge opportunity to build really positive reaffirming relationships between energy companies and customers because of this more control over costs, more empowerment to customers with how they're leveraging technology in their home to mitigate costs and to have more control over the experience in their home like comfort. So all these things to me is like these are me looking at these challenges through an optimistic lens because I feel like that's what we're in the business of is trying to build solutions here. Obviously, if we don't go in that direction, the other side of that coin can be very pessimistic. And so I'd prefer not to focus on that one. But I do think that these trends are coming. Like I think there's a lot of folks who are maybe don't aren't as aspirational about how much AI will grow in terms of its use cases. I haven't worked on this stuff. I deeply believe that we're in the infancy of how impressive and how powerful these use cases can get in terms of tools and customer empowerment and use cases. So I just think that's like that is going to happen. I also believe that like the benefits of home electrification technology around safety, around costs mitigation, around things like a better driving experience, which a lot of EVs just provide. These things are also going to be adopted. And so these things are coming. And I think it's a great opportunity for all of us in the industry to be a huge part of that solution. Ben Brown, CEO of Renew Home. Thank you so much. I really enjoyed this. Likewise, Steven, thank you so much for having me. This conversation was recorded live as part of Latitude Media's Frontier Forum with Renew Home. And there is so much more. This is an edited version of the conversation. If you want to watch the full video with lots of listener questions about the design and operation of VPPs, head on over to latitudemedia.com slash events and click watch recording. There's a lot more technical conversation there. And if you want to learn more about partnering with Renew Home, visit renewhome.com. Thanks so much for listening.",
    "release_date": "2025-05-06",
    "duration_ms": 1576000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI3769855352.mp3?updated=1746574419",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-29T02:01:02.854882"
  }
]