[
  {
    "title": "How Base Power plans to use its fresh $1B",
    "description": "Yesterday, Base Power announced a $1 billion series C, giving the residential battery company an eye-popping $4 billion post-money valuation. Base manufactures, installs, owns, and operates residential batteries — a vertical integration strategy that CEO Zach Dell says is the “magic” to beating utility-scale batteries on CapEx. The company also acts as an electricity retailer and sells generation capacity.\n\nSo how does Base’s business model work? And what will it do with its new fundraise? \n\nIn this episode, Shayle talks to Zach about Base’s business model, the vertical integration strategy, and the challenges ahead. They cover topics like:\n\n\n\nThe customer value proposition: how customers pay for backup power and Base uses the batteries for grid services\n\nBases’s “gentailer” business model in ERCOT, earning revenue from monthly customer fees, retail electricity sales, and battery arbitrage\n\nThe regulated market approach, where Base sells capacity directly to utilities\n\nBase’s vertical integration strategy: from ground-mounted designs to decoupled installation processes\n\nChallenges like managing a fixed workforce amid fluctuating demand and the declining price volatility in ERCOT\n\nResources:\n\nNew York Times: Base Power, a Battery-Focused Power Company, Raises $1 Billion\n\nOpen Circuit: Is this moment for distributed energy different?  \n\nCatalyst: Is now the time for DERs to scale?  \n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is our executive editor. \n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.\n\nCatalyst is brought to you by Bloom Energy. AI data centers can’t wait years for grid power—and with Bloom Energy’s fuel cells, they don’t have to. Bloom Energy delivers affordable, always-on, ultra-reliable onsite power, built for chipmakers, hyperscalers, and data center leaders looking to power their operations at AI speed. Learn more by visiting BloomEnergy.com.",
    "summary": "The podcast discusses the energy transition focusing on utility-scale battery deployment, home batteries, and retail energy. Base Power, an energy technology company, offers affordable home batteries for backup power and operates batteries for grid support. The company aims to vertically integrate to reduce costs and compete with utility-scale batteries. By owning the installation, designing and manufacturing their own batteries, and focusing on cost and reliability, Base Power believes they can deliver cheaper, more performant residential batteries. The discussion also touches on challenges and strategies related to customer value proposition, system design, and entering regulated markets. Other companies like Bloom Energy and Energy Hub are highlighted for their contributions to the energy industry.",
    "transcript": " Latitude media covering the new frontiers of the energy transition. I'm Shane O'Connor and this is Catalyst. If you look at a utility-scale battery deployment, you have to buy or lease the land that the battery sits on. You have to pay for the interconnection to the grid. You then wait in the interconnection queue which adds additional cost. You then do what most firms consider project development, which is some level of construction to level the site and prepare it for the system. So there's a bunch of kind of line items in the model that add to a cost that we think is higher than where we can get by vertically integrating. Coming up, home batteries and retail energy with ZAC-DEL. The AI boom is here, but the grid wasn't built for it. Bloom energy is helping the AI industry take charge. Bloom energy delivers affordable, always on ultra reliable on-site power. That's why chip makers, hyperscalers and data center leaders are already using Bloom to power their operations with electricity that scales from megawatts to gigawatts. This isn't yesterday's fuel cell. This is on-site power built to deliver at AI speed. To learn more about how fuel cells are powering the AI era, visit bloomenergy.com or click the link in the show notes. Fuel electricity demand is testing the limits of the grid, but Energy Hub is helping utilities stay ahead. Energy Hub's platform transforms millions of connected devices, like thermostats, EVs, batteries and more into flexible energy resources. That means more reliability, lower costs and cleaner power without new infrastructure. Energy Hub partners with over 120 utilities nationwide to build virtual power plants that scale. And how the industry's leading flexibility provider is shaping the future of the grid, visit energyhub.com. I'm Shail Khan. I invest in early stage companies and energy impact partners. Welcome. So, base power is the talk of the town, or at least the talk of my town, which is comprised of a mix of venture capital investors, founders and wonky energy people. This is a relatively young company, but they're moving very fast. And just yesterday, actually announced possibly the largest series C in history, certainly the largest in the energy space. They raised a billion dollars with a B at a four billion dollar post money valuation. The basic model of the company is you'll soon hear Zach Dell, the founder and CEO describe, will actually be kind of familiar to people who've been around deregulated electricity markets for a while. Base acts as an energy retailer, as well as offering customers a cheap home battery that they can use as backup. You've probably heard various shades of that concept over the years from other companies, including Tesla. But base has been taking off of late. And as I've dug in more and more and gotten to know Zach, I do think they're doing things differently in ways that are interesting and ways that tell us some lessons about the future of distributed energy resources or virtual power plants or whatever acronym you want to use. But base story is also just interesting in the context of scaling a startup this quickly in the notoriously tricky energy world and everything that comes along with that. One of my normal rules on this pod is that I don't really like to talk to founders about their companies, at least not directly. First of all, that's what I do all day long in my day job. But also, I'd rather focus on the markets that they're in and the technologies they're unlocking and so on. But base is especially interesting and I'm in the business of exceptions. So let's make one. Here's Zach Dell. Zach, welcome. Thanks for having me, Cheryl. All right, let's start by having you do the base power elevator pitch because I know what you're up to. I suspect a lot of our listeners have heard about base, but I'm interested in how you describe it when you describe it briefly. Yeah, I think of us as an energy technology company. When I describe the product to consumers, what we talk about is saving money on power bills, keeping your bills low and your lights on, bringing reliability and resiliency to the homeowner. But literally what we are is an electricity provider. So we are your power company. You buy electricity from us every month. We install a battery on your home that we own and operate when the grid's up and running. We use that battery to support the power grid. When the grid goes down, you get that battery to back up your home. But to folks in the industry and listeners of this podcast, I would think of us as a gen tailor. So we own and operate battery storage on the grid and we sell retail power to homeowners. And so our business looks a lot like some of the gen tailors that folks are familiar with. But our generation fleet doesn't include gas plants and coal plants, but is made up entirely of battery storage. Okay, that's a great segue to one of my first questions, which is, okay, so I think of you as a gen tailor too, but obviously a historical traditional gen tailors, the generation side of the business, they're big fleets of thermal generation or now increasingly batteries, maybe two, but the utility scale things. So as you think about the pluses and minuses of your version of a gen tailor, where in the physical asset base is all residential scale, what is it about that that is better than the NRG version of being a gen tailor? And what is it that is more of a challenge? Yeah. Well, there's the customer answer and then there's the system answer. And the customer answer is when you're selling power to homeowners, all that matters is price and reliability. So we are able to provide a level of resiliency to the home that the competition can't at a price that they can't compete with. So when you sign up with base, you get a 25 or 50 if you offer to kill a watt hour system on your home. That is all yours to use when the good goes out for $19 a month for the $25 kill a lot of our system and $29 a month for the 50 kill a lot of our system. So in terms of home backup, it's the most affordable option on the market. At the system level though, why our gen tailor model I think is more attractive than others is strictly cost oriented. What matters is fully landed cost of the megawatt. And our view is that we can land a megawatt gigawatt of storage on the grid faster and more cost effectively than the centralized utility scale developers. And for what it's worth faster and more cost effectively than a gas plant or a coal plant. So we use this strategy that we define as compounding cost advantage to vertical integration or kind of vertically integrate vertical integration plus technology to land assets on the grid starting with batteries and eventually we'll do other stuff faster and more cost effectively than the alternatives. And that's what matters. And I want to really double underline this point. It's like everyone listening to this podcast knows that electricity is a commodity. When you're competing in a commodity industry, you need a cost structure advantage if you want to win. And so we've designed the business, the mission, the vision, the strategy around engineering, technology, and vertical integration to achieve a cost structure advantage so that we can sell the lowest price electron in the market. That's really what matters to our customers and that's really what matters at the system level is how fast and how cost effectively can you land megawatts on the grid. And so that's really what the business is designed to do. All right. So you said two things there that I want to dive into a little bit deeper. The first one is just on the consumer value proposition. So I think let's pause on this for a second. So part of your innovation here is you're deploying big batteries. You said 25 kilowatt hour or 50 kilowatt hour. So this is bigger than your typical residential battery deployment. There are others who will stack a few power walls and get to the same place, but it's not been common. You know, I think folks can probably intuit that part of the reason to do that for you is that your soft costs, most of your soft costs scale with the number of systems you're going to deploy. So if you could deploy a bigger system, that's just better for you overall from a levelized cost perspective. But the mechanics of what you actually do with that battery, I think are interesting because you said the pitch to the homeowner is you have 25, 50 kilowatt hour battery that's fully yours and available to use in the event of an outage. But presumably you're operating that battery, you base are operating that battery all the time doing arbitrage or whatever else you're going to do in the meantime. So are you guaranteeing some level availability to the customer or how do you square the circle between like you're going to be charging and discharging the battery every day, but you want there to be some reserve available to the customer when there's an outage. So the short answer is yes. We guarantee 20% of the capacity of the battery to the customer no matter what. The reality is that the discharge window of the system is not very long. It's one to two hours a day. As you know, and listeners of the pod know, power prices are spiky and unpredictable, but like reasonably predictable in terms of kind of the pattern throughout most of the days and it's different in the summers in the winters, et cetera. But the windows in which you are discharging, they're reasonably predictable and outages and high prices are actually not as correlated as one might think. So what I'm saying is that the likelihood that an outage happens at the bottom of the discharge window is statistically not improbable, but reasonably low probability given the fact that there are 24 hours in a day and only one or two of those 24 hours, the battery is kind of low state of charge. So most of the day the battery spends its time at a higher state of charge. It depends on where the battery is and what the optimization function is. But the reality is, it is very unlikely that an outage happens at the bottom of the discharge window. Even if that does happen, we do maintain 20% state of charge for that situation. And as a benefit of having really large systems, our next generation product, which we can talk about, is a 40 kilowatt hour system that we also will install in parallel, getting to 80 kilowatt hours. So 20% of an 80 kilowatt hour system is like a full power wall. So once you have, there's a bunch of benefits that come from having a really big battery on the house, one of which is even if you have an outage to the bottom of the discharge window, you're still going to have a lot of backup there for the home. We really have two businesses here and we started talking about the gin-tailored business, but there's a second business, which is we are a technology provider to the utilities. And two thirds of the country, as you know, is a regulated market where there are incumbent utilities that have kind of service territories and monopolies. And we are starting to partner with them to deploy fast, affordable, flexible capacity in their service territory. So this looks different than the gin-tailored model. It's the same technology stack, hardware, software, et cetera. But we give them a fleet of storage that they go deploy alongside us or we go deploy kind of alongside them, I should say, in their service territory. And then those customers, those homeowners are getting really affordable home backup, but they're still buying that electricity from the utility. So it's same tech stack, different business model, and we could talk more about that. Yeah, yeah. I want to come back to what does this look like in regulated markets a bit in a little bit later, but before we do sort of staying on the, so you're starting in Urcot, so staying on the what does it look like when it's the gin-tailored model in a deregulated market. The other thing I wanted to talk about from what you said before, which is I think is like a bold statement in general is that you think you will be able to get a landed megawatt of energy storage at the residential scale that is cheaper on a CAPEX basis. I presume you're saying than a landed megawatt of utility scale battery. So that's like a very bold statement and certainly flies in the face of where costs have been historically on a relative basis for batteries, but also you could say the same thing for solar, right? Like it turns out that economies of scale for solar are huge and we get utility scale solar, sub-a-dollar watt and residential solar for four bucks a watt in the US, cheaper in Australia and other places. But anyway, give me the mechanics of like, how do you get a, just from a pure, you have, you know, you have customer acquisition costs and you have labor costs and truck rolls and smaller batteries and all of that. So like, how do you overcome all of that to deliver a cheaper megawatt? Yeah. So this is kind of the heart of the issue here. I think the shortest version of the answer is that vertical integration is the magic and we'll talk about what that actually means tactically. And it can kind of start by saying, if you look at a utility scale battery deployment, you have to buy or lease the land that the battery sits on. You have to pay for the interconnection to the grid. You then wait in the interconnection queue, which adds additional cost. You then do what most firms consider project development, which is some level of construction to level the site and prepare it for the system. You have a big EPC firm come in and plug in all the hardware that you buy from an OEM that adds a bunch of margin on top of the cells that are reasonably commoditized. And so there's a bunch of kind of line items in the model that add to a cost that we think is higher than where we can get by vertically integrating. So compared to our system, we do have CAC that they don't have. They have installed cost. We have installed cost too. We'll come back to that when we talk about design, but we don't buy or lease the land that the battery sits on. We don't pay for interconnection to the grid because it's already there. We don't wait in the interconnection queue, obviously, because this is behind the meter. On the hardware side, we're designing and manufacturing our own batteries. We think there's actually a lot of margin to capture there. Everything above the cell, basically. The cells are commoditized. Everything above the cell, the power electronics, the module, the kind of the design of the pack. We think there's a bunch of margin to go after there. And then in the install, the way that you actually design the system for install, if you own the installation, you design the battery in a very different way. And you can take a bunch of cost out of the install. And then the CAC piece I think is really interesting. We could go on a tangent here. We could talk about the last decade of home energy companies and why all these companies in the space have positioned their products as premium products with this premium product valence. And these products look like iPhones strapped to the wall and they're made of glass and they charge $20,000 for them. We take a very different view here. Our view is that what matters to homeowners is cost and reliability. And we position our product as a kind of financial no-brainer. And as we bring our next version of the product to market, the vertical integration leads to higher return, lower cost, higher returns to the asset level. And then we pass those returns on to the customer in the form of lower prices. So as you drop price, as you drop upfront price, monthly price, and then volumetric energy price, your CACs go down to. Right. So the idea here is that through vertically integrating, our costs to install come down, our CACs go down because we're able to drop price. We're able to take costs out of the OEM part of the equation and the margin capturing and everything above the self. And then we don't have the land and product development costs. And so on a fully landed basis, we can beat utility scale by a pretty significant margin. You heard the phrase speed to power a lot lately, but here's what it really means. AI data centers are being told that it will take years to get grid power. They can't afford to wait, so they're turning to on-site power solutions like Bloom Energy. Bloom can deliver clean, ultra reliable, affordable power that's always on in as little as 90 days. Bloom's fuel cells offer data centers other important advantages. They adapt to volatile AI workloads. They have an ultra low emissions profile that usually allows for faster and simpler permitting and their cost effective too. That's why leaders from across the industry trust Bloom to power their data centers. Ready to power your AI future? Visit bloomenergy.com to learn more. The grid wasn't built for what's coming next. Electricity demand is surging from data centers to EVs and utilities. They need reliable, affordable solutions that don't require building expensive new infrastructure. Energy Hub helps by turning everyday devices like smart thermostats, EVs, home batteries, and more into virtual power plants. These flexible energy resources respond in near real time to grid needs, balancing supply and demand. Plus, they can be deployed in under a year and at 40 to 60 percent lower cost than traditional infrastructure. That means more reliability, lower costs, cleaner energy, you can't get much better than that. And that is why over 120 utilities across North America trust Energy Hub to manage more than 1.8 million devices. Learn more at energyhub.com or click the link in the show notes. It strikes me that if I think about the total cost stack of utility scale battery, land matters, interconnection matters, but they're de minimis compared to the cost of, I guess the combination, I mean, certainly compared to the cost of the battery itself, the hardware or battery plus controls and all that kind of stuff. And also probably the labor, EPC cost as well. So like what you have to do, you do have the benefit of you don't have the interconnection, you don't have the land and so on. But really what you need to do is make a dirt cheap battery, a dirt cheap residential battery. If you could do that and you can get it somewhere close to the total cost from a hardware basis that a utility scale battery is, then you can sort of picture how that is possible. But that seems like the challenge, right? Yes, but I will say it's not just cost, right? Reliability, safety, useful life, like useful life matters, right? So if you model the asset to 15 years and it only, you know, degrades in seven years and your model breaks, right? So it is, you are correct and we are going to land the lowest cost home home battery on the market and you should hold it and the industry should hold us to that. But it will also be the most performant for the use case, right? If you want to use the battery as a grid asset, it needs to be able to discharge effectively at high temperatures, low temperatures, high humidity, low humidity. That is not a trivial problem to solve, right? And the home batteries on the market today, they're not designed to do that, right? The engineers that are designing these products be paired with, you know, home solar and solar upfront gross margin, they don't really care about, you know, participation in capacity markets and energy markets, right? Like that's not what they're designing around. And so it is a novel design requirement and we look at the whole performance, both the landed cost, but also the useful life and your ability to actually perform grid services effectively. When we start thinking about design requirements and we plan to bring to market the most performant battery out there on kind of those measures. Okay, so let's talk about design for a second then. Because I guess as I think about, okay, you said this sort of magic here is vertical integration. I could think about two heuristics for vertical integration. One is just your margin stacking. So you don't need to earn as much margin and to give in step in the value chain. And, you know, so I think you know this, I spent a lot of time paying close attention to like the first residential solar boom back in the day and the late 2000s. And so I was watching various versions of vertical integration play out and not play out over that period. And it's not exactly the same thing with batteries, but it's not entirely different either. And, you know, there were some, so there's lots of attempts at vertical integration in the sense that the same company that owns the customer relationship does the install, does the financing, does that whole thing, right? That was lots of companies did that. I think really only solar city at one point took the step to go vertically integrate upstream. They bought a company called Salavo and they were going to start making their own modules, which is what you're doing. You're trying to make your own batteries a degree upstream there. So the other heuristic for vertical integration is that it allows you to do something differently in addition to just margin stacking, which it seems like is what you're saying. So that must manifest in the design of the battery that you're going to roll out. At the high level, you just talk me through like what batteries seem pretty straightforward. What can one different, what can one do differently if one is vertically integrated? Yeah, I don't want to give all the secret sauce away, but I'll certainly, I definitely err on the side of oversharing and my team will give me a hard time for that. But I think that a lot of this, you know, comes back to the vertical integration and I'm not trying to sound like a burger record, but there's a real point here, which is like, take, for example, the way that the battery is installed, right? So most basically all batteries on the market today are wall mounted. Why? Because it looks better, right? And this is a premium product and you want it to look nice. Well, most people don't actually feel strongly about this particular wall on the ground. I mean, your AC units, it's on the ground. This thing sits right next to your AC unit. We think it looks a lot better than an AC unit. So people are pretty happy with ground mounted batteries. So when you decide to ground mount it versus wall mount it, that gives you a bunch more freedom. It released some constraints in the way that you actually designed the pack. And then you think about the fact that we do the installation. So, you know, I won't name any names, but like other battery OEMs, you know, they sell the product and then Bob's electric or Sunrun or, you know, freedom solar or any of those great installers go and install the product and those guys charge time and materials. And so they actually want the install to take as long as possible so they can make as much margin, you know, as much money as possible from it. And so the OEM doesn't really care all that much about how it's installed and how fast it's installed. Well, if we're doing it ourselves, it really matters to us. And so again, I want to give everything away, but you can do some really creative things around how the battery is installed, when and by who. For example, most of installing a battery is actually like heavy lifting, racking, stacking, mounting. There's a little bit of electrical work that needs to be done by a licensed electrician, but that can be decoupled from the racking, stacking, mounting. And so if you own the whole system, the logistics, the warehouse, you know, the last mile, the installation, the design of the hardware, you can build the whole system to be more efficient. You can break apart the installation. You can have a truck driver show up, do the racking, stacking, and mounting. Mounted box to the wall where the hotwork happens, and then electrician shows up the next day and does the hotwork in 30 minutes. And then you can have that electrician hitting 20 homes in a day, and you can have the truck driver hitting 20 homes in a day. You don't have to couple these things into a six to eight-hour install. Now it takes an hour or two. And that's actually a massive, massive cost efficiency. So that's one example. And there's others I could give, but I think that's the most salient one. Okay. So you're getting to the other thing that I think was the challenge that a lot of companies in solar, as it was starting to, residential solar, I should say, as it was starting to scale, were facing, which, you know, was not existential to anybody. Sunrun solved this problem, presumably as of today. But that's like labor workforce optimization, right? Because you've got, you're going to have all these truck drivers and electricians on staff, right? Because back in the early days of solar, Sunrun did not do that, right? They were first to financing providers. Sanjavity was this sort of like subcontracting model. And Solar City was actually the only one that was like really truly vertically integrated. And it clearly has benefits, but it also clearly has costs or maybe more risks if you have like a cyclical business where the sales cycle changes. For example, in your context, I can imagine, you know, if you're selling an haircut, like after a hurricane and an outage, I imagine you have a spike in interest, right? And so like, how do you marry a flat level consistent workforce who you are paying, who's fixed up X for you with a demand cycle that might not be exactly suited to that? Yeah, it's a good old fashioned hard problem. I think there's a couple ways to answer the question. You know, one is that if you're a demand constrained business and demand is very spiky, then this hard problem is like really, really hard to solve. If you're a supply-constrained business, like businesses are fundamentally constrained by something, right? And, you know, supply-demand and capital are really kind of the three core constraints. And if you're a supply contrarian business and you have more demand than you can serve, which is the position that we're in today, this problem is a lot easier to solve, right? Because you're just like installing these things as fast as you can make them. And, you know, your installers are running at, you know, near 100% efficiency. Obviously, it's never quite that good. But you have this problem less so. I think we're in the phase of the company right now where we are deeply supply-constrained. We have incredible amounts of demand because our product is really good and customers really like it. And so we have had to solve this problem kind of, but it certainly will get more difficult and more complicated as we scale. And I think the way to get ahead of this is, again, you know, not to keep going back to this vertically integrated thing, but, you know, our North Star as a business is land a battery on the grid faster and cheaper than anyone. And then widen that lead, right? And that will allow us to drop price, drop price, drop price, whether you're talking about our upfront fee, our monthly fee, our volumetric energy price, to the point where it becomes an IQ test, right? If you're not signing it for base, it's like you can't do math because you're obviously going to save money. And that puts you in a position where you're not demand-constrained for a very long time. I think the horror stories you hear about the solar coaster and, you know, the sun run and the Tesla stuff and have talked to all kinds of people who have worked there previously and now and whatever, like they faced these kind of supply-demand challenges because demand was very spiky and oftentimes not there and they were kind of reaching for demand and then, you know, sprinting hard when they found it because the product is really hard to sell. It's very expensive. And not a lot of people have $20,000 lying around to go buy a solar ray and a power wall and that kind of thing. So I think if you're not demand-constrained, this problem gets easier, but it's just a good old-fashioned horror problem. And there's, you know, things you can do that we're doing like build internal software have really well-trained crews to make it better, but it's so hard. The last thing I'll say, and I apologize for rambling a little bit on this one, is that we really value the relationship with the homeowner. Our installers are the front lines and they are incentivized to surprise and delight our homers. So they get there, they do their job, they're very respectful, they're very communicative, they clean up after themselves, you know, they are the first impression on a face-to-face basis of our brand in the field. And we really value that and we really invest in that. And I think to a degree that is quite differentiated in the space and our members seem to really love. All right. I have two sort of additional questions for you that are, I guess, specific to the Urkot deregulated market thing. And then we can talk about the regulated market version of it. One of which is related to what you're just talking about in the relationship with the homeowner. So the other thing that is notoriously a challenge for anyone who's a rep in Texas in particular is churn, right? Like customers churn off of reps a lot. Now, I think there's good evidence, and you probably know the details of this more than me, historically that if you're installing something, you know, others have done a version of what you're describing, installing something physical in the home in the hopes that that maintains a stronger, longer customer relationship. But what do you need to be true about customer churn in order for your model to work? So I love this question. You know, the best way to limit churn is to have a killer product, right? Like reps have high churn because the product is a commodity and it is really easy to compete with them. And there are lots of players in the space who are willing to do on economic things with a short-term time horizon to capture arbitrage for lack of a better word. Our product is really good. It's the most affordable home backup on the planet, and it is a reliable low electricity rate, and customers really love that. So I'm proud to say we are looking at a couple of dashboards in the office. We've got on the order of 5,000 of these batteries in the ground, actually 5,000 homes. And so it's more batteries because a lot of them have two. We have had in our direct business, we have had one customer churn ever. I remember her name. I remember the day it happened. I won't say it on the pod, but it is then that low because the product is really good. So yes, we think we will have structurally lower churn because there's an upfront cost and because there's an asset on the home. But most importantly, because we think we're bringing a ton of value to the homeowner and they really want the product. I mean, we've had a number of customers email us and say, hey, so you didn't ask the question, but I'll frame it up. So what happens when someone moves? Well, what happens when someone moves is that the new home buyer wants base, nothing happens. The home buyer just, we become their power company and the battery is already on their home. And then the customer can sign up for base on their new home if they want. We've had a number of customers email us and say, hey, I'm moving and I really want base on my new home. Like, how do I make sure that base is there when I'm there? Like, I just want to make sure that I don't lose base. And it's super easy to solve. We set them up. We get them all ready to go. We make sure the new home buyer is set up with us. But it's just a testament to the quality of the product. And I think that is the only way to limit churn at the limit is to have a really killer product. Okay, final, deregulated market question. So you're making money in two ways in in our COT, right? You're trading the battery, you're charging and just charging the battery in the market. Actually, maybe three ways, right? Because the homeowners paying you a fixed monthly amount for the battery, then you're operating the battery in our COT, making money on that. And then you're a retailer and you're making money as a as a retailer. Now, the interesting question in our COT is, where is volatility headed, right? Or historically, our COT had high volatility. It's been down a fair bit this year. People are talking about whether that is because we've installed so many batteries, last couple of years, right? Is that because we've got so many batteries and we're only going to install more until volatility goes down in general, you have to some degree a hedge there, right? Because volatility is good for your business on the battery side, but bad for your business on the rep side and vice versa. Do you consider it a full hedge and you are totally agnostic to volatility in our COT or do you like lean a direction? Generally, yes, I will again, I won't give away all the secret sauce on how we think about risk management and asset optimization, but generally speaking, yes. Because we have this fleet of storage said differently because we have a long position, we can be more creative with our short position, with our loadbook, right? So there are things that most reps do to hedge their exposure that we don't have to do because of our long position and that becomes a profitable undertaking for us. That said, the batteries are more profitable at times of high volatility full stop. Let's talk about volatility for a second. I don't have a crystal ball, I don't know what's going to happen in a haircut, but what I do know is that markets generally work pretty well. When volatility is high, people want to build a lot of batteries and a lot of batteries presumably dampened volatility and when volatility is low, people don't want to build a lot of batteries. And having, as the March of New Editions solar wind, more so solar probably going forward, increased intermittency on the grid and then you just have continued load growth and batteries, let's say we have five more years of low volatility, presumably the rate of batteries coming online is going to be lower than it would be if you had five years of high volatility. Well, low growth is likely to still march up, solar additions are likely to still march up. And so eventually the market snaps back. So what I would tell you and I tell our team and our investors, and the way we talk about this and the way we think about it is that there will be great years for batteries, there will be not great years for batteries, there will be great years for the retail book, there will be not great years for the retail book. Our job is to build best technology in the world to scale grid infrastructure and put more capacity on the grid, maintain a really strong balance sheet and make sure our risk posture is one that will be here to stay. We are building a business for duration, we want to be able to absorb the bad years and take advantage of the good years. And so we think about it in this kind of balanced way, we don't try to predict where the market's going to go. Now I will say over time, I think our ability to see what's kind of happening based on the data that we have coming off our fleet of storage all across the grid as the volume of nodes in that network grows, I think that will be a real advantage to us. But we can talk more about that in the future when Ravel actually able to flex that muscle. All right, let's switch over to regulated markets, which as you said before is kind of the next big move. So it's a very different, it's sort of a different value proposition there, right? You're no longer a retailer, you're not selling electricity to homeowners. What's the basic contour of how that business model works for you? Yeah, so we sell megawatts. And the idea here is that we want to offer our technology as a utility asset. So our hardware, our software, and our deployment operations can be used to bring capacity online very fast and very cost-effectively. And our view is that utilities across the country are now more than ever looking for alternatives to get capacity. Whether that's because they're seeing massive load growth from data centers coming into their territory, or they're seeing the electrification of transportation or heavy industry or just population growth, whatever it might be. If a utility is looking for megawatts, we can deliver them faster and cheaper than anyone. And we think we have proven in Texas, and we'll hopefully prove across the country soon, that our assets are just as capable, and we can talk about what that means as a not-for-gasp speaker plant, or coal plant, or some kind of traditional utility infrastructure that the utilities are very used to underwriting and building and operating. So we want to bring to market the most attractive utility asset there is in the form of batteries and software, and eventually some other products that we're not ready to talk about yet, but we will be soon. The consumer value proposition in that construct is a little different too, so you go to the utility and you say, I sell you capacity, you're going to pay me in megawatt days or whatever, just like you pay for utility-scale capacity. Now you go to the homeowner to go get that stuff installed. What is the value proposition of the homeowner look like? I think it depends. I think in certain parts of the country, reliability is really a concern, and so we can say, hey, we're the lowest cost home backup option out there. And that part will be similar to why you need in Texas. It's like a fixed monthly fee for the battery. It's just you remember the retail part. Low monthly fee, you get a close. Exactly. Low monthly fee, you get home backup, and that's really valuable to people, obviously. There are parts of the country where reliability is extremely high, but there's a really strong capacity need from the utility, and so they're willing to pay us a large amount in a tolling agreement or whatever the structure is, and then we can turn around and we can just, because we don't need to reserve maybe 20% of that battery for backup because they have really no reliability concerns, we can turn around and we can actually compensate the homeowner for allowing us to put a battery on their home. And whether that means lowering their bill through the utility or buying down their bill ourselves or literally mailing them a check, those are the things we still have to go figure out, and it's really market to market. But the concept here is we can create value with these assets, and we can share that value with the homeowner if our cost structure is attractive enough, which is kind of back to this like vertically integrated compounding cost advantage idea. So it'll vary market by market. In the lower liability markets, we think it's lean on the home backup value proposition and the high reliability markets, it's lean on the cost savings. The mechanism by which we deliver that is still to be determined because it depends on the utility in the market. As you've been starting to have those conversations with utilities where it's a capacity product, what are you learning about how they think about a fleet of distributed batteries as a capacity product as compared to centralized storage? I'm cautiously optimistic. I think that utilities around the country are coming around to the idea that a fleet of distributed batteries is as capable in air quotes as a utility scale power plant, whatever you want to, whatever kind of technology you want to use as the example. I think that many of these utilities have kind of bad taste in their mouth from DR 1.0, whether it's smart thermostats or other kind of technologies that maybe promised a lot and didn't deliver much. Our asset is reliable, responsive, high uptime. We own the asset, we control it, there's no like, oh, well, it turns out that the homeowner actually just shut off their AC or decided to override or their car was plugged in and it's no longer plugged in. This asset is owned by us, it's controlled by us. We have triple lines uptime and sub-second telemetry knowing what's happening at the asset level. I think we're starting to see the utilities wrap their heads around the idea that these are high quality assets and they can actually use them in their power supply planning. And that's really encouraging. I guess final question for you on the regulated side. There's this existing universe of these utility DURMs programs and things like that. There's some existing programs and then there's NVP programs that are kind of starting to emerge in a few places. And then there's a separate thing you could do which is just selling capacity, right? You just like bid into a capacity RFO or whatever. Is one of those more attractive to you than the others? Would you like to see this just like as a capacity product and not treat it as a separate whole universe? Short answer, yes, I think so. I think that's the path to a large scale. The longer answer is that we will experiment with different versions of this in different parts of the country with different utilities that have different kinds of priorities and obviously not all utilities are the same and those investment utilities and mutis and co-ops and they have different incentive structures. And so that will guide some of this. But yes, we think that shooted storage, software-enabled distributed storage like what we build should be considered a grid resource in the same way that a gaspeaker or coal plant is. And we think it can be just as performance significantly cheaper and orders of magnitude faster to deploy at scale, which is really what matters, right? Like we are deploying megawatts in Texas very quickly, like on the order of 20 megawatts a month. We think by this time next year, we'll be deploying on the order of 100 megawatts a month. You can't find that kind of deployment speed really anywhere in the country. And of course, if you extrapolate that growth rate, there will be a time in the not too distant future where we will hopefully be deploying gigawatts a month. And in the situation we find ourselves in with the demand that's coming in the electricity sector, we need solutions to deploy capacity quickly and cost effectively. And that's where we are positioning ourselves. All right. I think that's as good a place as I need to end it. Zach, thank you for doing this. This is a lot of fun. Thanks a lot, Cheryl. Really enjoyed it. Zach Dell is the co-founder and CEO of BasePower. This show is a production of latitude media. You can head over to latitudemedia.com for links to today's topics. Latitude is supported by Prelude Ventures. This episode is produced by Daniel Waldorf, mixing in theme song by Sean Markwand. Stephen Lacey is our executive editor. I'm Shale Khan, and this is Catalyst.",
    "release_date": "2025-10-09",
    "duration_ms": 2391000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI9858485217.mp3?updated=1759982047",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-10-12T01:35:16.656704"
  },
  {
    "title": "Frontier Forum: A new playbook for clean energy growth",
    "description": "After the failure of federal climate legislation in 2010, clean energy advocates realized they had to look elsewhere for momentum. The result was a shift toward states and regional markets — and the creation of Advanced Energy United, a trade group built to make policy progress outside of Washington.\n\nToday, that strategy is more important than ever. With the federal government rolling out new regulatory hurdles, load growth accelerating, and an affordability crisis growing, states have become critical for industry growth.\n\nIn this episode, Heather O’Neill, the CEO of Advanced Energy United, talks about a new playbook for scaling clean energy in this environment. The framework: build it, make it flexible, and make it affordable.\n\nThat means removing red tape for new projects, unlocking more value from existing infrastructure through tools like virtual power plants and advanced transmission technologies, and ensuring affordability as utilities make massive investment decisions.\n\n“States are where some of our most forward-looking and politically resilient clean energy policies have been developed,” said O’Neill. “And that’s where the opportunities are today.”\n\nThis week, we feature an edited version of our recent Frontier Forum with Heather about how states are shaping the clean energy transition, and how companies can use United’s new playbook to grow the market.\n\nYou can download United’s new playbook guide here, and watch the full Frontier Forum conversation with live audience Q&amp;A at Latitude Media.",
    "summary": "In this podcast, Heather O'Neill discusses the history of bipartisan support for climate change action in the US, the shift to state-level clean energy initiatives following federal inaction, and the importance of building flexible and affordable energy solutions. With a focus on states and regions, the conversation highlights the urgency for clean energy expansion, affordability concerns, and the need for regulatory reforms like permitting reform, VPP acceleration, and advanced transmission technologies. The discussion emphasizes the role of states in driving clean energy progress amidst federal challenges, promoting a new policy playbook centered on speed, flexibility, and affordability.",
    "transcript": " This is a frontier forum brought to you by Latitude Studios. There was this brief period in the mid-2000s when it looked like it bipartisan climate law was actually possible in the US. The science had become clear. Al Gore's documentary and inconvenient truth had attracted big audiences to theaters. Hurricane Katrina had jolted the country and renewables were starting to make gains in the heartland. And so, during the 2007 presidential campaign, nearly all the GOP candidates were aligned toward action. There's not a doubt in my mind that climate change is written. And we have neglected our obligation again to this generation of Americans because we make a hand in a very badly damaged planet. You had this moment over a period of years in the early 2000s where you had really genuine bipartisan interest in tackling climate change and in opening up markets for clean energy. At the time, Heather O'Neill was working for a foundation led by a lifelong Republican who cared deeply about climate change. One of its policy priorities was cap and trade, a market-based solution that was originally developed in the 1990s by Republicans to fight acid rain. And GOP front-runner John McCain was calling for a similar system for CO2 on the campaign trail. Even though McCain lost the 2008 election to Barack Obama, he continued to rally support for the policy in the Senate. But with Obama in office, oppositional politics took over. An industry seeing the real possibility of a climate law ramped up lobbying. The conversation took a dramatic turn. The jobs will go to China and the economy will go to hell. Wake up America, there hasn't been any global warming, which is what we heard over and over and over again. That's been any global warming for 10 years. So you had all of these years of effort and really what felt like forward momentum that came to a screeching halt, or at least that's what it felt like at the time. And that's really where United's story begins. By United, Heather Means Advanced Energy United, the trade association she now leads. The idea for building a new multi-technology trade group came in 2010 after the Waxman Marquis cap and trade bill failed. It was a big blow to industry and advocacy organizations that had put all their attention and resources on federal action. The failure was really a wake-up call for many of us in the industry, myself included. And if we couldn't get Washington DC to act, then we were looking and seeing states and regions were creating energy markets. You were shaping the rules of the road and you saw billions of dollars of energy investment decisions being made annually. States are often called the laboratories of democracy. And that is definitely true in clean energy, where so much of the momentum has come from states experimenting with policy to meet their unique needs. And so United was built from the start to go all in on states and regional markets. There's really no substitute for that sustained engagement. So you have to be on the ground. You have to walk the halls. You have to build the relationships. And you also have to really show up with credible information. You're a trusted resource before you're in the thick of any particular fight. And so that was incredibly powerful in terms of allowing us to kind of break through and elevate our issue and agenda. And so taking that to heart as we've moved forward in the years. I'm Stephen Lacey. This week, a conversation with Heather O'Neill, the CEO of Advanced Energy United, about a new playbook for scaling clean energy at the state level. It was recorded live as part of latitude media's Frontier Forum series. The Trump administration has declared war on clean energy. But state leaders are still looking for practical solutions to fast rising demand and affordability crisis. They talk with Heather about a new policy playbook that can help clean energy meet the moment. And it is very much about centering the conversation around three really simple principles. Build it, make it flexible and make it affordable. So let's fast forward to now. Post big beautiful bill. There's, you know, they've accelerated some phase outs. They've maintained some credits. There's, you know, new onerous regulations for manufacturers and developers. And it's very, it's very messy. And meanwhile, the federal government is sort of using systematic chaos to make it harder to build clean energy. And so so many people in the industry are just like asking, where do we go from here? So the blunt question for you is where do we go from here? And you probably have guessed the answer to this already from my answer so far. But to me, it's a no-brainer, right? It's states and regions. And so my call to action for our industry is that we have to invest heavily and aggressively now in states and regions. And again, the federal government is definitely making it harder, right? Whether it's HR1 or it's some of the new executive orders that keep bubbling up, right? They're putting real roadblocks, real regulatory hurdles in front of our industry, in particular segments of our industry. But this is where, again, I look to the states and regions. I hear from the teams on the ground daily that there are huge opportunities, right? Opportunities abound across the board and states and regions. And it's not just, you know, defending existing markets, but there are opportunities to really open up new markets and grow. And I don't think that's a surprise, right? States are where some of our most forward-looking and politically resilient clean energy policies have been developed. So states and regions is definitely the way to go. So I want to dig into some of the specific states and regions, and we're going to get there. But let's just set the stage for the urgency at the state level right now. I mean, there are a lot of governors who are looking at the affordability crisis and who are very, very concerned. There's a real desire to attract data centers, but a real concern for affordability as a result of the development of those data centers. I think there is continued support for a clean energy expansion and an all-of-the-above approach at the state level. So there's a lot of urgency right now and a lot of new economic forces coming together. How would you define what is, just describe what's causing that urgency at the state level and how are some of those policymakers reacting? Yeah, absolutely. And you've touched on a number of them, right? We're seeing electricity costs go through the roof for consumers. And we know that's just going to continue with the effects of HR1, right? HR1 and some of what the administration is doing are going to raise electricity costs for all. So that is both here now and also going to be worse. You've got, for the first time in a long time, load growth, right? So increasing electricity demand. And that's in part driven by data centers, as you note, that race around artificial intelligence and the coming wave of electrification, both building and transportation. And then last but not least, we're all living through extreme weather events of all types. And that puts additional stress on our grid, on an aging grid and infrastructure. And so those challenges are here, they're now, they're daunting, they're interconnected. And that's, you know, states need solutions to tackle those challenges together. And so that's what we've teed up in the new policy playbook, which I know we're going to get into. One point on this, because you mentioned governors, so I was just at a governor's association meeting last week. And energy is front and center for those folks, right? You've got America, particularly energy affordability. So you've got electricity bills going up. And as I said, right, that's going to get worse with what they've done at the federal government level. And so governors are going to feel that pressure, right? They're going to need to take really swift action. And I'll give one data point, one example in Maryland, right, in PJM's territory. Customers are seeing their monthly bills increased by up to $20 a month. And so that governors are going to have to act, right? They're going to feel that pressure, they're going to need to act now. Other state leaders will need to act. And so that's where, again, we absolutely have to get our solutions in the hands of state leaders now to meet that moment and address those challenges, because if we don't, the wrong solutions will win out. And how do you think that's opening up opportunities for the industry to message? So I think we're well beyond decarbonization. Certainly decarbonization is really important for many state leaders, but the affordability and economic growth issue is front and center, as you said. So how does that change the way companies go and talk to lawmakers? And how does that open up new opportunities in states where we're not just talking about the cleanliness of the technology, but all these other attributes? Yeah, this is where I'm excited where we've developed a new policy advocacy playbook. And it is very much about centering the conversation around three really simple principles, build it, make it flexible and make it affordable, right? We need state leaders to focus their energy agenda on speed, flexibility and affordability. And I know we're going to unpack it a little bit more, right? With speed, it's simply about how do we build, right? How do we build more energy projects and infrastructure now? Flexibility is very much about how can we get more out of existing infrastructure? I think there's a lot of untapped kind of juice we can squeeze from our existing system. And then affordability, as we've been talking about, we know that decision makers are going to have to make investment decisions, right? Our infrastructure is aging. They're going to need to make investment decisions to meet low growth, meet the demands. So let's make sure that those decisions are smart investment decisions, and there are not masting money on misaligned or backwards looking solutions. So I think for us and our industry, it's a pragmatic moment. We have a solution set that we know is directly responsive to these challenges. And we need to be in front of state decision makers articulating our solution set early, often over and over again. Yeah, so let's dig into each of those three. So with BuildIt, are we talking about permitting reform or a broader suite of policies? Yeah, we're talking about permitting reform and so much more. We're talking about including building transmission, transmission capacity, and speeding interconnection of large scale projects to the grid. And this comes out of, again, talking with our member companies who have low cost resources that they're ready to build, whether it's large scale wind, solar storage and the lake, and they're not able to deploy, right? They are tangled in red tape, they are stuck in line. And so BuildIt is all about removing roadblocks and the regulatory red tape across a set of issues. So certainly citing and permitting reform, right, so that we can build large scale projects. We're also talking about expanding transmission capacity, and that starts with putting advanced transmission technologies to work. And then speeding up interconnection by making smart reforms, including surplus interconnection. So there's a lot there and there are a lot of examples around the country that I can dive into. Yeah, well, I know that, so I know United is nonpartisan and you're really committed to working with lawmakers across the spectrum. If I just look at what's happening on the left, however, historically, Democrats and progressives have pushed a lot of the decarbonization policies, what we're seeing is a real reckoning around permitting itself. Like they're saying, well, actually, we rely too much on government for these strict set of rules. And we actually need to focus on targeted deregulation to accelerate building things faster. How are you seeing that conversation play out in some of these states where there is a real concerted effort to deregulate in areas in particular and energy? Yeah. I mean, I think for BuildIt, absolutely, right? It is about how do we clear the roadblocks, how to remove some of that red tape. So the coalitions are going to look different in different states. But there are some really great models out there around permitting and citing reform. So just a couple years back, Michigan, as one example, passed really proactive, positive citing reform legislation that's now moving into implementation. And Advance Energy United, we worked with our member companies to develop a set of citing principles that I think became part of the foundation of that legislation. And there are other states where we're seeing those conversations bubble up. So Virginia is one example, and Indiana is another one where we were able to have, I think, really constructive conversations about citing reform and made some incremental progress this year with legislation. Definitely more to do there, but that state focus on accelerating build is incredibly positive. And I think for, when you look at some of the principles we're articulating, they should appeal to folks of all political stripes first and foremost. Are you protecting landowner property rights, right? So making sure that state and local governmental processes are not kind of impeding local property rights. And so that, again, a very conservative principle. And so I think you're able to attract allies from across the political spectrum as you think about some of these crucial principles and reforms. So who's doing it best? And where are the potential winds coming up? What are the priorities for some of these reforms? So definitely keeping an eye on Indiana and Virginia as we go forward and thinking about Michigan, again, as an example of a really positive, citing reform. I think another place that's a hot spot that we are hopeful, hopeful that we can have really constructive engagement is actually around interconnection and the interconnection queue. And that's PJM. And I will not. I'm sure everyone who is listening understands very deeply some of the challenges around interconnection and the queue there. So I won't go into that. But when you look at some of those challenges, right, a lot of that needs to be addressed at the RTO level. So we're making sure that state leaders are getting more engaged with their RTOs, right, to make sure that that interconnection process is in line with what states are expecting and need to meet low demand. And so what we're seeing in PJM, right, is you have governors, again, both Republican and Democrat really engaging in PJM on necessary changes and asking good questions. How can we clear this backlog, right? And really making sure they have the information they need to make sure that PJM is working to reform what is clearly a broken process there. So when we talk about making it flexible, what are some other market reforms that we're targeting here? So when I think about making it flexible, and I think they're everyone persistently under values, just how much more we can get out of existing infrastructure. And in part, that's because the pace of innovation here is really dizzying. When we talk to decision makers, they're definitely not fully aware of the breadth of flexibility options that are out there and ready to scale. And so again, when I think about our companies creating innovative new products and product offerings, right, you've got virtual power plants of all stripes, sizes, shapes, and the like, you've got companies using EV fleet batteries as mobile grid assets, or on the transmission side, you've got advanced transmission technologies of many flavors. So so many flexible options out there that we need to put to work. And again, this is where states, I think, are experimenting, we're seeing them pick up a number of what I would call no regrets strategies and policies around making it flexible. So in Virginia, we passed legislation earlier this year that will accelerate VPP pilot programs. And in California, as everyone knows, that legislative session is ongoing. And so we have bills currently moving through the process that we're sponsoring that would help accelerate VPP development, and really again, get the most out of existing and new distributed resources in a state Texas. We were able to pass energy waste reduction legislation earlier this year. And that requires state agencies to really work together to get the most out of demand flexibility and demand response programs. And I really like this particular model because it recognizes the value that those solutions have for both grid reliability and affordability. And then last but not least on the transmission side, I think advanced transmission technologies are really having a moment, right? And we know we need to build new transmission, particularly in a regional transmission. And in the meantime, again, getting more out of our existing infrastructure, let's put advanced transmission technologies to work first. And so advanced energy united has worked in multiple states to pass legislation that does just that. So California, Massachusetts, Virginia, and then this year, New Mexico and Connecticut. So again, really having a moment, we see a lot of momentum on advanced transmission technologies as one example. And now we have a lot of utility comfort with VPPs. There have been a number of utilities who've really gotten their operations teams comfortable with operating these resources and they can provide valuable flexibility. And I've heard them describe multiple times as now they're considered pain killers. Instead of vitamin pills, they're pain killers. Jiggershott was talking to me last week and described them as such. And I've heard folks in the micro grid space to describe them as pain killers. And now that we just are desperate to open up more grid capacity, we have all these resources on the grid that like it is truly the perfect moment for VPPs. Talk about like how that is actually changing the way policymakers are considering these resources and utilities. And then maybe if there are any other specific market reforms that you want to go into that could help accelerate those resources. Absolutely. Right. I think VPPs are also having a moment right for the last couple of I feel like last year, you could not turn around without hearing something about VPPs. And they're incredibly powerful. And I think you're absolutely right. Utilities are seeing a real opportunity here as they think about as they're looking at the affordability crisis. There is concerned as anyone about rates going up. And everyone wants to meet the moment of low growth. Find me a state leader who doesn't want to attract new manufacturing, who doesn't want to attract a data center. So you want that economic growth. And so how do you meet the moment and VPPs play a key role in that, right? Because it enables you to help kind of shape and shift that load. So you're not having to build out more expensive fossil infrastructure, right? Where you can really take these low cost opportunities and really add to the flexibility of the grid. So we're just seeing, again, I think a real appetite. But we're also at the very beginning stages of the conversation in many ways, right? The fact that in Virginia, we're talking about a pilot program around VPPs, right? So I think we're at the kind of tip of a curve, if you will, on VPPs. And we're going to see them just, I think, really take off in terms of scaling up in the coming years as they're just a really good, no regrets answer to some of these really big challenges. And then broadly, in the flexibility category, are there any other rules or regulations that are in play right now that people should know about? I mean, I think there's always rate design issues, right? There are any number of regulatory decisions and conversations that are taking place. You've got New York, the PSC there, the grid of the future proceeding that's got a number of attributes, again, that'll really help on the making it flexible. You've got Colorado, who's in the last couple of years past some, I think, really important distribution system planning, VPP, all the rest, many kinds of rate design elements that are coming into play. So again, I think there are regulatory proceedings across the country in a number of different states where you're seeing regulators start to recognize the importance of whether it's rate design or putting VPPs to work, getting more out of the existing grid. So then those two feed really nicely into making it affordable. That means encouraging a lot of different kinds of resources. What are the crucial priorities, policy priorities for tackling affordability specifically that you're focused on? Yeah, I think the beauty of making it affordable is rates some of what I just touched on, as you said, right, really helps hit affordability as well. So if we're accelerating interconnection so we can get the lowest cost resources online quickly, that's going to tackle affordability. All of the grid flexibility targets, programs, rate design, right, manage charging of EVs, all of those save customers money. So again, I think there are a number of policy solutions that we've talked about and that are in play in states that are in that affordability camp. But we also know that right now, regulators and state leaders are considering big investments in fossil. And you've got affordability challenges. Those resources are the time frame for getting those resources built and online is pretty long. At this point, a lot of folks have pointed to that and the prices are going up. And so we're looking for decision makers to really focus on the solutions that are available now and can help customers manage costs. And so in the, we know they need to make investment decisions. So are they making smart investment decisions, right? Are we ensuring that utilities are planning and delivering the right types of investment? And that's, you know, how do we future proof utility spending? How do we help align incentives for utilities productively? And then how can we push states to really embrace, I think, integrated planning, right? That really gets at regulatory efficiency and achieving state energy goals and reliability standards at the lowest cost. So thinking about these efforts, not in silos, but working together. So again, very unsexy work, utility incentives, and business model reform, and certainly investment questions, but incredibly important as we think about the affordability and reliability of our energy system in the years ahead. So let's turn back to the state level and talk about how you actually build coalitions in states. How is it different from a national approach? Like when you go to a state house, who are the people you're talking to? How do you actually build the coalition compared to what you might do on Capitol Hill? So I think coalition building in state houses or Capitol Hill, it's probably no difference, it's just an essential part of the equation and policy advocacy. And it's certainly a core part of events, energy, United's values, right? The difference is right, each coalition is going to look different, right? It depends on the issue that you're pushing. It depends on the politics of the day. It depends on who's in leadership, right? All of those go into creating and forming a different coalition, but that process really looks the same. And certainly, again, everyone in the policy advocacy space knows this, that any win is not one organization's, right? You're winning as part of a coalition. You may be leading the coalition, you may be on the supporter's seat, but you absolutely are working hand in glove with other interests. And again, it just depends on what the issue is. I think one of the themes that we've learned, and again, whether it's Capitol Hill or it's a state house, there's just no substitute for sustained engagement. You can't parachute in, right? You have to walk the halls. You have to build the relationships and get to do the dynamics and the allies and the opposition in person. And that's why, United, we've got team members in state capitals across the country, right? That's just essential if you're going to create that coalition and move your agenda forward. Any advice for people who are operating clean energy companies right now who are thinking about, what do I do? Obviously, they're operating in certain states. They kind of understand the policy priorities, but when they are looking for how to get engaged, what are the ways they can do that? So you know what I have to say here, which is joint advanced energy. So states are a dynamic environment, right? You like DC, you have to know the players, you have to know the issues, you have to know the issue environment and the politics of the day. And you also can't just focus on one venue or lever. So you have the governor's office and their team. You also have what I refer to as agency alphabet soup. And that includes public utility commissions, right, that are making those billions of dollars of investment decisions annually. And of course, you have state legislators. And so all of that taken together is incredibly complicated. And then you multiply that by multiple states, really complicated. And so that's where we can help, right? We're on the ground. We have those relationships. We can introduce companies, innovations, technologies as part of the solution set to decision makers. And so I'd say help us help you. We're at such an interesting moment where governors, utilities, regulators, policymakers, developers, data center developers, they're like desperate for solutions, consumers. Like we are, this is a period of real desperation to try to get as many resources developed as we can for positive economic reasons. So we think about historically, we have led with decarbonization and cleanliness, as I talked about before. Is this a better framework now? Do you think this is ultimately that there are more tailwinds for this broad set of resources than ever before? I think it's an interesting moment because, yes, 100%, what you say, but I also think the moment is fraught, just given all of the attacks from this administration. And so it is one of those moments where I do think we have an opportunity because we are leading with a solution set that is directly responsive to those challenges, right? And when we're talking with governors, they're here on fire about energy affordability, right? And they need to be. And we're all concerned about grid reliability, right? Utilities, decision makers, everyone. And so you have really most states facing very similar challenges in the affordability crisis, reliability, and again, wanting to attract economic development and growth. And so I feel really good about us being able to show up and have a solution set, right? That is really directly responsive to those challenges. So yes, I think we have a moment where we can lean into our solution set and we're able to get decision makers' attention because it is this extremely urgent moment with these challenges in front of us. So I guess the best way to execute this playbook is for companies here to join United. But let's just say, you handed them this playbook, right? Whether they join United or not, you've got this playbook, what should a company do with it in hand? How do they think about implementing this messaging strategy into their state level engagements? We'd love to see folks pick it up, right? Whether they're part of United or not, I think this is just an effective way of speaking to decision makers, right? Making it clear and simple and cutting, meeting the moment. And not every company, not every solution in this playbook is going to fit every company, right? Different companies will gravitate towards different portions that are more relevant for them, for their business, for their business model. So we hope that folks pick it up and use it as they see fit. We're definitely seeing it already, I think, start to resonate, right? Because it is so clearly addressing the challenges that decision makers are facing. So I hope that folks pick it up and use it far and wide. Well, I mean, I couldn't agree more with the messaging. It is very much in line with what I am hearing when I talk to folks at the local level all the time. And when I talk to people in the clean energy industry, this is the stuff that is resonating. So Heather, thank you so much. We really appreciate it. This has been great. I really appreciate the opportunity. Thanks for taking the time with me. Heather O'Neill is the CEO of Advanced Energy United, the industry's only business association built to shape state and regional policy. If you want to download United's new policy playbook guide, you can find a link in the show notes or go to advancedenergiyunited.org slash playbook. This is an edited version of a frontier forum, which was recorded live in front of a virtual audience. We took lots of questions. And if you want to go deeper, you can watch the full video at latitudemedia.com slash events. Thank you so much for listening.",
    "release_date": "2025-10-06",
    "duration_ms": 1917000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI4935122204.mp3",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-10-12T01:38:25.203532"
  },
  {
    "title": "The new wave of DERs",
    "description": "Demand response was the original distributed energy resource. In its early days, it was surprisingly manual: a grid operator would call up a large load, like a factory, and request a few hours of reduced demand during peak times.\n\nFast forward to today and DERs look dramatically different. They’re automated, deployed frequently across the country, and include everything from EVs and thermostats to sophisticated management systems at paper mills and data centers. \n\nSo how did DERs evolve from phone calls to fully fledged virtual power plants? And what role do they play now as electricity demand surges?\n\nIn this episode, Shayle talks to Dana Guernsey, co-founder and CEO of DER and VPP developer Voltus. She is also the former director of energy markets at EnerNOC, a pioneer in demand response. Shayle and Dana cover topics like:\n\nThe changing mix of customers and resources, as well as the evolving use cases\n\nVoltus’ new “Bring Your Own Capacity” model, allowing large loads like data centers to fund regional VPPs\n\nThe barriers that hold DERs back, like access to data\n\nThe market forces shaping DER adoption, including load growth, declining system costs, and market structures\n\nHow DERs stack up against conventional power plants in meeting rising demand\n\n\n\nResources:\n\nOpen Circuit: The grid flexibility solutions staring us in the face\n\nCatalyst: Is now the time for DERs to scale?  \n\nCatalyst: Making DERs work for load growth  \n\nCatalyst: PJM and the capacity crunch  \n\nLatitude Media: Google expands demand response to target machine learning workloads\n\n\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is our executive editor. \n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.\n\nCatalyst is brought to you by Bloom Energy. AI data centers can’t wait years for grid power—and with Bloom Energy’s fuel cells, they don’t have to. Bloom Energy delivers affordable, always-on, ultra-reliable onsite power, built for chipmakers, hyperscalers, and data center leaders looking to power their operations at AI speed. Learn more by visiting BloomEnergy.com.",
    "summary": "The podcast discusses the evolution of demand response in the energy sector, highlighting how it has transitioned from emergency-only services to a more automated, technology-driven approach. The guest, Dana Guernsey, CEO of Voltus, shares insights on the historical context and current state of demand response, emphasizing the expansion of participants from large industrials to a wide range of customers and resources, including residential and commercial entities. The conversation delves into the geographical and pricing aspects of demand response, showcasing the shift towards a more diversified and steady revenue stream throughout the year. The focus is on the industry's ability to provide reliable grid services and adapt to changing market dynamics.",
    "transcript": " Latitude media covering the new frontiers of the energy transition. I'm Shail Khan and this is Catalyst. It's gone from this really kind of only extraordinary moment when the resources used to being super ordinary, in fact, quite dull sometimes. If you think about it that way, I don't even know why you're having me on this pod, if that's the case. Super boring. But in all seriousness, that's the evolution that I've watched. Coming up, the expansion of demand response with Dana Guernsey. The AI boom is here, but the grid wasn't built for it. Bloom energy is helping the AI industry take charge. Bloom energy delivers affordable, always on ultra reliable on-site power. That's why chip makers, hyperscalers, and data center leaders are already using Bloom to power their operations with electricity that scales from megawatts to gigawatts. This isn't yesterday's fuel cell. This is on-site power built to deliver at AI speed. To learn more about how fuel cells are powering the AI era, visit bloomenergy.com or click the link in the show notes. Surging electricity demand is testing the limits of the grid, but Energy Hub is helping utilities stay ahead. Energy Hub's platform transforms millions of connected devices, like thermostats, EVs, batteries, and more into flexible energy resources. That means more reliability, lower costs, and cleaner power without new infrastructure. Energy Hub partners with over 120 utilities nationwide to build virtual power plants that scale. And how the industry's leading flexibility provider is shaping the future of the grid, visit energyhub.com. I'm Shail Khan. I lead the early stage venture strategy at Energy Impact Partners. Welcome. You may have noticed that I'm on a bit of a distributed energy resource kick on this podcast of late. Well, it continues today, and honestly, next week as well. This week, we're talking demand response, which honestly is what most of these conversations have really been about. Flexibility, VPPs, et cetera. They're all new spins on or expansions of the OG form of distributed energy resource grid services, which is demand response. Demand response was demand flexibility before it was cool. Let me make another point here that will maybe feel a little bit like a tangent for a second, but stick with me. For all the talk that I often hear, I'm sure many of you hear from many of my peer venture capitalists about asset, light, low capital intensity startups in this space. The reality in my humble opinion is that there's actually very little historical evidence that that type of company, that profile of company can produce really big outcomes, or at least very few of them have. In fact, I think you can count those success stories on one hand, most likely. But one of those success stories, and one that I think has been somewhat forgotten in the annals of history, is Enronach, which was really the pioneer of demand response and went public in 2007 during the CleanTech 1.0 wave, kind of the early days of that wave. Ultimately, Enronach was acquired by NL, the big Italian energy company, as now known as NLX, which is part of why it's not as well known today to folks who are newer to the sector. My point is that demand response as a category can, I think, accurately claim to have actually produced a venture-backed IPO, not even a SPAC, which is not true of many other categories that you see in Vogue today. It's interesting from historical context, but it's also very interesting in today's context because a lot of what we are seeing happening in the market right now with the ability of distributed energy resources to start to provide grid services of one kind or another, is born out of basically an evolution of that DR market. Anyway, Dana Gernzi, who is the CEO of Voltus, and my guest today, started at Enronach in 2008, I believe, and then ultimately co-founded Voltus in 2016. So she's got almost 18 years in this space, which means that she has all of the right experience, the right battle scars, and the right current context to help us understand where we are now in this moment. Here's Dana. Dana, welcome. Hey, Cheryl. Thanks for having me. All right, so I want to start by having you walk me through your lens of a history on demand response in the US, at least, because you've been in it for the majority of the time that that market has existed, I would say, or at least at any meaningful scale. And it's going through some pretty interesting evolutions right now where there are macro factors that I think are driving it into a whole new category. But I think a lot of people are waking up to it now, and they're either using that term, demand response, or a variety of other terms, demand flexibility, VPPs, maybe, whatever. Forget the term for a second. You know, paint me the arc of the history of this market as you've seen it. Sure. And actually, I'm going to even go back a little prior to my time, not to date myself here too much, but even before we had aggregators, which was really my entry into the space, these had interruptible programs. And so the very, very early days of demand response and whatever we want to call it across the course of time began as this kind of blunt emergency only tool in those utility interruptible programs. So imagine like making manual phone calls to very large industrials, and then they would curtail their energy used typically during a crisis. And so it was this like almost like fire extinguisher used only in a crisis. A lot of times not used at all. And so that was the very, very beginning. And then my entry into the space came when I joined a company called Enronok, which was one of the first aggregators I joined back in 2007, eight timeframe. And that was when things started to evolve. So I would say we went from the 1.0 or the 0.0 when it was the utility programs into more of a 1.50 or 2.0, where the concept of aggregation became prevailing. The notion that a technology platform could do something started to emerge. And the folks that have been in the industry for a long time, you find a lot of people who used to work at Enronok or C-Power. And now of course, Enronok is an LX. So that was really where I quote unquote cut my teeth, I guess. I was there for a while. And I watched the market evolve and I used to just think, gosh, like, if only more things could be connected, if only more things had an on off button that could be used with technology. If only pricing signals were more obvious, this stuff would get used more. And so there's a bunch of stuff that happened along the way, including some pretty wonderful FERC orders that opened up markets. And we can go into any of those if we want to. I'm assuming many listeners are familiar with orders like 719 and 745. And it basically started to value the demand side the same way as a typical generation resource. So the signal started to be, yeah, if you could reduce a megawatt of demand, you should be paid the same as a megawatt of supply. And more and more aggregator and aggregation models came to be recognized that one plus one can be three sometimes and that the value of a portfolio was there. And so over time, fast forward to today. I think, I think, Shell, my favorite part about our business these days is that at any given moment we're being dispatched. If I opened up our platform right now, there would be one to 20 different dispatches going on. And so it's gone from this really kind of only extraordinary moment when the resource is used to being super ordinary, in fact, quite dull sometimes. If you think about it that way, I don't even know why you're having me on this pod. But like super boring. Yeah. So boring. But like in all seriousness, that's the evolution that I've watched. And so I posted on LinkedIn a couple of months back or a month back that, hey, you know, by the way, one thing you might not know about our business is we're dispatched every day, 365 of the last 365 days. And I got this really overwhelming response of, wow, I didn't really know that. And maybe that's the wake up call that you're talking about. But I'd lift on pack with you the reasons why that's true because it's a number of things. It's new use cases. It's market maturity. It's technology maturity. It's rising electricity prices. It's declining cost of the DERs themselves. It's like all of those things. But the market's having a real moment now. And so that evolution has been really cool to watch. It's been really cool to be part of. And I'm really grateful that more people are coming into the space and realizing that maybe we're at another inflection point now. Yeah. So I think of there being, you could tell me there might be more than this, but there are like three or four vectors through which the market has broadened over time since those early days of anoronoke or even before the aggregators, right? It started off as being a pull switch in case of emergency situation that was called upon almost never. So now being called upon often in many different contexts, that's one. Two is you said anywhere with an on off switch, but actually that's been a shift, right? Because initially, as you said, it wasn't even, I guess it was an on off switch, but it's super manual. It was like utility calls large industrial plant manager, large plant and plant manager says, okay, and goes over to, I imagine, some switch in their factory and pulls the dial and turns the thing down to it being much more automated now. The third is the demand side resources themselves, which as you said, started with just a small number of large industrials, manufacturing facilities, and now is much broader. And sort of relatedly, the resources that are at those sites. So it's not just straight demand reduction now, maybe it's dispatching storage or whatever. So there's at least multiple, and in each of those ways, it started from this kernel of a very, very specific thing and it's become this much broader thing. I guess I want to ask on those last two in particular, how have you seen the evolution of who participates in these programs on the demand side? What did it used to look like and what does it look like today? Okay. So to reframe, I think what you just asked me, there's both more stuff. So to your point, there's more things with the on off button. And importantly, we should say that are connected to the internet, right? Right. Automatic on off button. Yeah. So there's just more stuff. There's more technology enabled stuff and stuff. It's a very technical term. There's more things to do with that stuff. In other words, there are more use cases. So we've graduated from capacity emergency only to the vast majority of use cases, sometimes being economic or balancing of renewables and ancillaries and local congestion management and things like that. We even have carbon based use cases. And then there's more need for the stuff because of what pricing is doing today and the fact that we've entered a new paradigm where we are in a low growth environment. But to expand your question, I think you were asking, were you asking about the customers themselves and why they care more? I've heard you talk about, well, it's no longer a vitamin. It's a painkiller. So maybe this... Yeah. That too, but actually before that, who are the customers that participate? I mean, I think that the expansion from it's Jill Schmoe running a factory to a pretty wide array today is interesting. So if I were to look at the Vultas platform today and the customer set on the platform, how would that pie be split? So to give you a sense, there'd be over 50 different verticals just within commercial and industrial and then there'd also be residential. So going maybe smallest to largest, you'd see everything from an electric vehicle in a home to a smart thermostat to mom and pop kind of retail shops, big box stores, any kind of commercial load, school districts, wastewater treatment plants on up through larger industrials. The first larger real estate building in commercial real estate is huge in particular in areas like New York on up through industrials and on and on, steel manufacturing facilities, massive loads. Those are, as a sidebar, the original large loads in my mind were like the paper mills and the steel mills and then there was crypto and now we're seeing the... There was always data centers of the quote unquote traditional sort and then cloud compute. Now we're seeing the AI data centers kind of at the top. So that's the... It really runs the gamut and in many ways that's the strength of the portfolio. You can take things that maybe have operating parameters and constraints and pair them with other things or other customers that have similar but different constraints and now you can respond to what the grid needs by tetressing these things altogether. Maybe staying within the CNI world for a minute because I know this will be different for residential. Talk a little bit about the resources, like what is being dispatched generally speaking. Yeah, so it's still a lot of load control on top of things that are now what we would call behind the meter assets. So let's just talk load control for a second. The first thing we'll often do when we talk to a customer is take a look at their electricity bill with them and run through it and make sure that we're understanding, well, how much energy are they using? What are their demand charges which are sometimes a shockingly high portion of the bill? And so anything that's drawing energy is eligible to be something that can use less energy. And the more that things are connected to things like building management systems, the easier and more technology enabled this becomes. So there's still a lot of commercial condition space just load control as a DER itself, as part of the VPP and now we're starting to throw around the acronyms. But I fall into the like all inclusive category. And so there's a lot of that. And then there's behind the meter assets and that can be a generator behind the meter. It can be battery storage, increasingly, battery energy storage systems are one of our top growing verticals and that just relates to the basics of the cost curve coming down. So that's everything. It really runs the gamut. Can you talk a little bit about geographies today? It's sort of national to an extent now and thanks in parts of those first orders that you described that happened a few years ago. But is there a significant concentration in some regions over others? Is there a significant pricing differential in terms of the value capture in some regions over others or is it all pretty uniform? Let me answer volume first and we'll come back to pricing because there are slightly different answers. We very intentionally built the company thinking that we wanted to be in every wholesale market in every territory eligible across North America. So that is true today. We have some markets that have emerged as just larger than others but it's by and large owing to the size of those markets. So you'll have your PJMs and ERCROTS and New York and SPP being bigger than, for example, the Canadian markets. But that's because of percent penetration against the peak load, not because that we've really seen that one market is where we're going to concentrate. And that's a business choice for us. There's other aggregators you'd ask that say they're heavy in one market or another. But because of the second part of your question, pricing, pricing can get a little crazy out there. Anyone who's watched the PJM auction for years knows that, well, one year you think it's happening and then the next year it sits and it goes back and forth and you might find a trend line over time. But if you're trying to run a business, it's really, really, really hard. And so the best way is to adopt more of a portfolio. So we have a portfolio of portfolios. And that's how we've built the businesses approaching it through the lens of the actual risk management and the fact that we are exposed to the pricing and that things can change. And long ago I gave up the game of trying to predict where auctions would land. It's just not. Instead, we have a saying internally that we just would like to be happy with our participation in all outcomes. So whether it's up, down, left, right, certain things are outside our control, but the way we manage it is being everywhere. It's where everywhere, Shell. Yeah, you're everywhere. Point taken. Is this a market? This is going to vary by region two, but is this the type of thing where you earn most of your money on a few days out of the year? I mean, maybe this is yet true in Urquat, not true in somewhere else. But like, to what extent is this a you need to be there to dispatch on the hottest days or the peakiest load days versus a you're like the cash flow is steady daily over the course of the year or seasonal or something? Like what does the profile look like? Okay, so brace yourself. I'm going to answer with a lot of it depends. So it depends. Okay, I'm braced. It depends. It depends. So I'd say over time the trend is that this stuff is getting smoother for a couple of reasons. One, like this notion that like the summer hottest peakiest day is like the end, I'll be all that. That's gone. That was 1.0. So we have winter peaks. We have shoulder issues because of outages and things like that. And so just even like across the year seasonally, we are seeing a spreading, a smushing out of the value. And so when you're talking capacity or even reserves, and let's put energy aside for a second, when you're talking capacity or reserves, both of which are more or less call options on energy, you're getting paid for being there during the time of need and the option. Right. And that's like an annual auction. Right. So that annual buy annual. So seasonal, even talking reserves, if you just, let's go to operating reserves for a second, that's daily. It's a day ahead or a real time market in some markets. But you're still, and so there's an hourly price associated with providing reserves to a market. That is pretty spread out. Little bit ups and flows here and there. Reserve markets actually can sometimes be higher in those shoulder seasons because of shortages of other resources. So that spreads it out. And then when you're talking about like the energy payments themselves, we have a lot of customers who respond economically. And so it's only when pricing goes above X that they want to curtail because that's their threshold. That's their what we call strike price. And so for those, that's like you're clipping the peaks of pricing. And so you got to look at like, yes, if you're going to have a heat wave in the summer, there's going to be a lot of money made there if you have a polar vortex in the winter. But as a general trend, as a general observation, these things are getting spread out. Now layer on top of that, we're also seeing more of the what we would call quote unquote traditional capacity programs being dispatched regularly. I lost count. It used to be that that would be crazy to not know how many times PJM dispatched the LRP this summer or New York dispatched their SCR special case resources capacity program. But it's again and again and again and again. And so the payments associated with those, the exercising of the capacity, those also become a little more spread out. So that's that's the trend. And like, that's part of why I come back to like, I love that we're being dispatched all the time for a number of reasons. One, it spreads out the payments, which is good. But two, like think about exercising. This is a muscle that now becomes well used, well exercised. We want to keep it that way because the at the end of the day, the thing that's most important is that we deliver. So as an industry showing that not only does this stuff exist, not only can we build it, but when you call on it, it will show up is so incredibly important to us. We have these North Star principles internally and one of them is just deliver on our commitments to grid operators. It's very basic. And so the more we get used, the more of a well-oiled machine it can be. You heard the phrase speed to power a lot lately, but here's what it really means. AI data centers are being told that it will take years to get grid power. They can't afford to wait. So they're turning to on-site power solutions like Bloom Energy. Bloom can deliver clean ultra reliable, affordable power that's always on in as little as 90 days. Bloom's fuel cells offer data centers other important advantages. They adapt to volatile AI workloads. They have an ultra low emissions profile that usually allows for faster and simpler permitting in their cost effective too. That's why leaders from across the industry trust Bloom to power their data centers. Ready to power your AI future? Visit bloom energy.com to learn more. The grid wasn't built for what's coming next. Electricity demand is surging from data centers to EVs and utilities. They need reliable, affordable solutions that don't require building expensive new infrastructure. Energy Hub helps by turning everyday devices like smart thermostats, EVs, home batteries and more into virtual power plants. These flexible energy resources respond near real time to grid needs, balancing supply and demand. Plus, they can be deployed in under a year and at 40 to 60 percent lower cost than traditional infrastructure. That means more reliability, lower costs, cleaner energy, you can't get much better than that. That is why over 120 utilities across North America trust Energy Hub to manage more than 1.8 million devices. Learn more at energyhub.com or click the link in the show notes. You talked about PJM dispatching. I'm curious. I guess there's a broader question here, but it's sort of PJM specific. So PJM and the capacity auction that everybody started talking about a few months ago, prices spiked again. The total demand response or load side participation in that market was relatively flat year over year anyway. I guess my question is at the high level, what is the rate limiter on the growth of whatever modern version of demand response there is? I think what changed in PJM in part was the rules around capacity accreditation. You could probably tell me all the details there. But is the rate limiter achieving sufficient value from the grid operator? Is the rate limiter finding enough of the right customers on the demand side or what stops this from 10xing tomorrow? It's all the above. It's all the above. So some of it is, yes, the higher the pricing goes, the greater the addressable market because now things pencil out for nearly 100% of things. There's also just time. So how quickly, I get asked this all the time, like, well, if you just head endless resources, how quickly could you do things? But there's still just a limiting factor of the time to just go out and do it. There's the rules you alluded to the ELCC and all the accreditation changes. And so there was a lot behind the scenes more than meets the eye around, well, more total megawatts showed up, but because of the way they counted it, fine. I can't really speak for others. I mean, we grew year over year. So one of our takeaways was, OK, well, that's great. We have more space now. And so we're going to go out and have more to offer customers. And the last thing is I do think people don't always keep in mind that it's not like one. It's not a one bite at the apple moment. So PJM has the forward auction, which is one way in a procure capacity. And then they have their incremental auctions. So as you approach the delivery year, what will happen to pricing and our people kind of I don't want to use the word withholding. That's a bad word in the industry. But are people kind of just waiting to see and then go into the incremental auction? There's an initial come up as we get to the bring your own capacity concept. But there are other ways to procure capacity. And so I wouldn't like also over rotate on that one signal that DR was flat year to year for one auction because of all this other stuff in the mix. I think in general, the sentiment in the market is one of huge optimism and excitement. I just came from some time at climate week last week where folks who are adjacent to the industry asked me, oh, how was that? Like everyone OK? It's like everyone's great. Everyone's great. There's a ton of optimism. Like I said, the market's having its moment and people are just excited to get to work. Now, are there things we could do? Yes, if I had like a magic wand, I would have better data access and some basic stuff that I think is within our power to enable even more growth in the sector. Better data access on the customer side, like low data, better access on the utility side to know when it's going to be dispatched. What's the data that would unlock something for you? Yes. So when we think about like the residential portfolio, for example, so C&I, we go and we install either there's a way to tap in through APIs and get customer data through something the customer already has, leveraging our API platform or we go and we install what we lovingly call our vaultlet device, which sits on top of the utility meter and streams real-time data to our platform. But data is very important. When I think about the growth of our residential portfolio and what's, I think you use the term rate limiting there, it's the lack of access to, and I'm going to air quotes here for the listeners, smart meters, right? So we deployed all these smart meters, we rate these then, and then it's like, well, can we please use the data from them? But no, in a shocking amount of territories, it's actually quite hard to gain access to that, even if you are the consumer. And so there's some basic stuff around data access and unlocking some of the smaller assets that now pencil out. So it's now really worth it for smaller assets because of where pricing is. And so how do we make that happen? What's the rate limiters? There are still some regulatory tweaks, if you will, that I would like to see. So we've talked about this or versions of this a little bit before on the pod, but you made an announcement just this week of a new product, basically, this bringing your own capacity product. They are offering, which is suited, I think, to any large load, but presumably predominantly aimed at data centers where the problem is the most acute. Why don't you start by just describing what it is? And then I have a bunch of thoughts and questions about it. Sure. So yes, we've been really excited about this. We've been talking about it to many folks for a while, but we kind of officially launched the product today. We had everything all buttoned up. What it is said most simply is we are offering a way that increases time to power for large loads. And yes, in this case, we're really thinking about data centers, but nothing says it couldn't be other large loads by allowing them to pay for and fund and bring their own capacity to the table. How? Okay. So that's the next question. I took the words out of your mouth. But basically, the markets already have very mature, well-defined rules for what it means to be capacity. What is capacity in PJM? It's not the same as what is capacity in MISO or SPP or you name it. So we have an accreditation process and we have a way to evolve that over time. And at the end of the day, if the problem is generation capacity, let's define the problem. Let's say the problem is generation capacity. We don't have enough of it. Okay, great. Well, so let's build it and let's allow the markets to govern how we're building it and how we're operating it and what it means to be capacity to meet the needs of that market reliably. And let's let the load pay for it. So that's what it is. It's kind of taking like what would traditionally be a bilateral agreement where load-serving entities for a long time have purchased out of market. They've run procurements for capacity out of market and reduced what they need to go and buy in market. This is a trilateral award, but it's allowing the funding to come from the load itself. And so you're offloading the burden, the financial burden of the load coming to that area, but you're also offloading the risk because I hear a lot, well, like, what if it doesn't get built or you know, so the concerns are we don't have enough capacity. What if it doesn't get built and why should ratepayers pay for the large load coming to town? And so this allows it's a win-win in my mind because it allows the large load to come to town. The utility wants that and it gives the utility the capacity that it needs accredited by the market it's sitting in. Let's let's for a moment put on holds vertically integrated utilities and it's putting the funding on the part of the hyperscaler or data center developer. At the same time it's providing a signal to in this case VPP developers or Voltis to build exactly in the area of the problem. And so that's why I love it. It's really an innovation on top of the markets today, which the markets today which work for many, many things but are struggling to accomplish all of these things all at once with the new large loads everywhere. So like versions of this the bring your capacity thing have happened with data centers before, right? I think but it tends to be grid scale generation, right? So you'll have a data center and this has been going on for years. Data center will go. There isn't sufficient generating capacity. The data center will or the operator hyperscaler or whatever will will pay for new generation to get built, not necessarily on site. I think what's distinct in what we're starting to see now at what you're pursuing is a version wherein that's not like it's unlikely to be at least in your program a single CCGT natural gas plant that is that new capacity. It may instead actually be an aggregation of a bunch of demand side resources in that region, right? And that's what sort of distinct here from what we've seen historically. That's what's distinct. That's what's distinct. And so that would be bring your own new power plant and that would be subscribing to the notion that if you're going to be bringing a new 24 seven load that somehow you need to like build new 24 seven generation exactly on that land parcel. So the other thing I'm trying to do is a little bit like broaden our minds on the term co-location. So sometimes it might be that you need to build exactly on that land parcel because you need a substation upgrade or something like very physical. Put that aside for one minute because increasingly what I see is that it's more the constraint is a little broader than that geographically. So let's define the constraint. Let's just say it's at the balancing authority. So that's your constraint. So that's where you want to co-locate. So this notion of like on site versus off site can be a little bit more flexible if you're willing to take into account the fact that as long as you're co-locating at the constraint, not solving the problem. And now you have more tools in your toolkit inclusive of the PPs inclusive of deploying more storage in that entire area where you need it. And that's like the spark fund model of what they're trying to do. Right. So these concepts are all things that I think we're all talking about and we're all loosely agreeing that we need to solve these problems and and we're loosely agreeing that the burden and the risk should lie on the large load coming to town. Like what we're struggling with is how? And so rather than point fingers and say like, oh, it's, you know, this part, this that or the other entities faults, like I just wanted to, we wanted to introduce another solution that works today. And so that's why we that's why we finalized the product and launched it and our sites we're talking about it. How does it actually work mechanically, right? Like data center, operator developer going into a particular region, talking to the utility, trying to figure out what capacity there is there. At what point do you bring in the bring your own capacity concept? And then is it a, okay, we volt to say, all right, you need 100 megawatts of additional capacity in order to set your data center at the size you want in this location, utility or load serving entity, you tell me the aperture that matters is that the balancing authority is the deliverability window smaller than that. And we vult this will go originate 100 megawatts of capacity from a variety of types of resources in the region or is it some other process? The earlier the better. So sooner you can get in on the planning process, the better you want to be like past the point of understanding what the problem is. So to your point, like, let's just say for sake of a, for example, today the problem is some zone pick an ISO PJ M, my so. So let's just pick PJ M. So the problem is in some zone and we're talking to a data center who wants to develop something in zone A. Well, the utility there says, well, I just don't have enough capacity in this zone. And the alternative is that they'd have to go buy it in the auction and it's going to be very expensive for everybody. Okay, great. Well, what if we built an incremental VPP in that territory and transferred the accredited, the PJ M accredited market, market UCAP megawatts. So that was a mouthful. But like, after all the accreditation stuff, after the who's at Watson's of what type of resource it is, out pops a UCAP megawatt. And it's called something different in every territory, but that's, that's like the unit here. And so we go and we build those units and then we transfer it to the utility for, and there's no finite, there's no financial transaction there. The financial transaction is that the data center's paying for it. So the utility gets the capacity. The data center funds it. We go out and we build it and incidentally longer term price signals are great for building out VPPs, just like any other resource. If you can have a five to 10 year price signal, you can do a lot with that. You can start financing more energy storage. There's just a lot of creative things you can do with that signal. And then the utility also gets to say yes to that load being cited in their state or in their region. Is the expectation that your answer to this is going to be depends. I know. You don't even need to have me on that. I know. If I think about a resource stack, right, of like what the data center operator can do to generate sufficient capacity to get their thing built. VPPs be lower cost to them than new generation. In principle, I would think so, but there's a customer acquisition, a cost associated with it. I mean, there's there's infrastructure there that's non obvious. So I'm curious how it ends up stacking up for them. And is it and do you think of this as being a product as attractive largely because it is cheaper than whatever alternative they would have to get that capacity in that region? Or is it faster? Is it can you actually build it where realistically you're not going to build a new generation? Like what's the thing that makes this slot cleanly into the resource stack? Yeah. So it is faster. It should be more affordable. So the way we would price it is always looking at the alternative and being cheaper than that. It is cleaner. And at the end of the day, if you follow the money, the money goes back to the consumers and repairs themselves by participating in this program. So not only are they not there to go out. Not only are they not like kind of receiving it on their bill, but they're also optionally participating in something that then pays them. So the whole experience gets better if you are the consumer or the right pair. But it absolutely should be more affordable if the alternative is going out and building a new natural gas power plant. For one, not only are you going to like open up the catalog and see that it's backward till 2020 or sorry, not 2020, 2030, whatever, which is a problem. That's on hold for many years, but they're expensive. And so it should be more affordable, quicker, which is what everybody wants right now. And it's more sustainable, kind of better for the community. So it's just checking all those boxes. It is more complicated to talk about. So I think that that's the big challenge here. It's more complicated to talk about. It's more complicated to say, hey, why would we solve, even if you could, I don't think we should solve what's fundamentally a utilization problem by just adding more steel, more steel. I really think it's critical that we start thinking about like there are existing resources on this grid already that we should be using. And this goes back to the Tyler Norris paper and all the great work out of Duke. It's the same thing as it was years and years and years ago when to come full circle, I was first starting at Enernoc, which is we had these charts that showed, well, yeah, like 10, 20% of the capacity is built for less than 1% of the time. That just doesn't make sense. So from a macro market design society point of view, even if you could open the catalog and buy those power plants tomorrow, I still think that this would be a better outcome. All right, Dana, this was a lot of fun. Thank you for finally coming on. Of course. Thank you for having me. Dana Gernsey is the co-founder and CEO of Voltis. This shows production of latitude media. You can head over to latitudemedia.com for links to today's topics. Latitude is supported by Prelude Ventures. This episode was produced by Daniel Waldorf, mixing and theme song by Sean Markwand. Stephen Lacey is our executive editor. I'm Shale Khan, and this is Catalyst.",
    "release_date": "2025-10-02",
    "duration_ms": 2343000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI5588365533.mp3?updated=1759381835",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-10-12T01:42:04.865031"
  },
  {
    "title": "Ag residue and carbon removal",
    "description": "Agricultural byproducts like corn stover, wood chips, and soybean husks typically get left to decompose and release carbon dioxide. Don’t call them “waste” though; some farmers use these byproducts as field cover to improve soil health. And industry uses a fraction of this biomass as feedstock for valuable products like ethanol, electricity, and heat. Theoretically, it’s a vastly underutilized resource. \n\nThe problem is that agricultural residue is really hard to collect. The economics of gathering, sorting, processing, and refining are tough. On top of that, it makes for a crappy fuel. It’s low energy density and high carbon, compared to oil, for example.\n\nSo in what applications does agricultural residue make the most sense? And how do you economically collect the material at scale?\n\nIn this episode, Shayle talks to Peter Reinhardt, co-founder and CEO of Charm Industrial, a carbon removal startup that collects agricultural residue and refines it in the field into what it calls “bio-oil.” It then injects the bio-oil underground for sequestration. Together, Peter and Shayle discuss the use cases and collection of agricultural residue, covering topics like:\n\n\n  \nHow the difficult economics of collecting and transporting biomass have killed centralized biomass projects, except in a few niche examples\n\n\n\n  \nWhy Peter says the processing and densification are key to improving the economics\n\n\n\n  \nThe tradeoffs between big, centralized processing facilities and Charm’s on-field mobile pyrolysis units\n\n\n\n  \nThe case for using agricultural residue for applications where the carbon content matters, like iron-making, sustainable aviation fuel, and carbon removal\n\n\n\n  \nWhat’s driving carbon removal buyers and what it takes to build trust with them\n\n\n\n\nResources:\n\n\n  \nCatalyst: Fuzzy math and food competition: The pitfalls of sourcing biomass for carbon removal  \n\n\n\n  \nOpen Circuit: What we learned from the ethanol disaster  \n\n\n\n  \nCatalyst: Shopify’s head of sustainability on the realities of the carbon removal market  \n\n\n\n  \nCatalyst: From biowaste to ‘biogold’  \n\n\n\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is our executive editor. \n\nCatalyst is brought to you by Anza, a solar and energy storage development and procurement platform helping clients make optimal decisions, saving significant time, money, and reducing risk. Subscribers instantly access pricing, product, and supplier data. Learn more at ⁠go.anzarenewables.com/latitude⁠. \n\nCatalyst is supported by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform by visiting ⁠energyhub.com⁠. \n\nCatalyst is brought to you by Antenna Group, the public relations and strategic marketing agency of choice for climate and energy leaders. If you're a startup, investor, or global corporation that's looking to tell your climate story, demonstrate your impact, or accelerate your growth, Antenna Group's team of industry insiders is ready to help. Learn more at ⁠⁠antennagroup.com⁠⁠.",
    "summary": "The podcast discusses the challenges and opportunities in utilizing agricultural residue for carbon removal. The focus is on converting waste biomass into bio oil and biochar through pyrolysis to reduce greenhouse gas emissions. The conversation covers the complexities of biomass aggregation, transportation costs, and the trade-offs between centralized processing facilities and decentralized on-field processing. The potential for cost savings, scalability, and innovation in the pyrolysis market are highlighted, emphasizing the need for efficient and sustainable solutions in the energy transition.",
    "transcript": " Latitude media covering the new frontiers of the energy transition. I'm Shail Khan and this is Catalyst. If you looked at, for example, at our wood chips that we process in Colorado, where we're getting in these forest fire prevention thinning, if we were to stand there and look at it, you'd be like, this is pretty consistent material. Like visually, it's not like, oh, this is all over the place. But nonetheless, you can still get edge cases. You can get a rock that was like randomly stuck in a branch, or you can get people talk about like, baled ahead of handgun in it. Coming up, we're talking ag residue, wood chips, and carbon removal of Peter Reinhardt. The AI boom is here, but the grid wasn't built for it. Bloom energy is helping the AI industry take charge. Bloom energy delivers affordable, always on ultra reliable on-site power. That's why chip makers, hyperscalers, and data center leaders are already using Bloom to power their operations with electricity that scales from megawatts to gigawatts. This isn't yesterday's fuel cell. This is on-site power built to deliver at AI speed. To learn more about how fuel cells are powering the AI era, visit bloomenergy.com or click the link in the show notes. Surging electricity demand is testing the limits of the grid, but Energy Hub is helping utilities stay ahead. Energy Hub's platform transforms millions of connected devices, like thermostats, EVs, batteries, and more into flexible energy resources. That means more reliability, lower costs, and cleaner power without new infrastructure. Energy Hub partners with over 120 utilities nationwide to build virtual power plants that scale. And how the industry's leading flexibility provider is shaping the future of the grid, visit energyhub.com. I'm Shail Khan. I invest in early stage companies and energy impact partners. Welcome. So here's the cycle. We humans grow crops, a lot of them, because there are a lot of us. Those crops contain carbon that has been sucked up from the atmosphere. Mostly, they're either consumed or burned to produce energy, but along the way, a lot, like really a lot of them, parts of most of every plant that we grow actually are wasted, so to speak. There was a DOE study a couple of years ago that estimated the amount of ag residue alone, that's a subset of this category, at around 200 million dry tons per year. So those ones generally decompose, of course, releasing greenhouse gases back into the atmosphere. But what if they didn't? There's a whole class of ideas around utilizing that so-called waste biomass, either to displace something else that might generate greenhouse gases like fuels, or just locking it up so that the CO2 has never released into the atmosphere in the first place. The latter category is what charm industrial has focused on. Charm turns waste biomass into what they call bio oil, and then injects it back underground to be stored for thousands of years. Peter Reinhart, who is the founder and CEO of Charm, is a friend of mine. I've always thought came into this space with a refreshing perspective. Prior to Charm, he was a wildly successful software founder. He founded the company Segment, which was acquired for over $3 billion by Twilio in 2020. So he has this startup experience and actually carbon removal buyer's experience. But this was his first foray at Charm into hard tech, into carbon markets as a producer, into the realities of waste biomass. So that's what I wanted to talk to him about, what he's learned out there in the fields, what works, what's hard, and where we are in the carbon removal markets. Here's Peter. Peter, welcome. Thanks for having me. All right. Give me a tour of ag waste to start. Where is it? What is it? How much of it is there? Give me the quick high level. Yeah, I think many people would maybe push back first on the word waste there. For the most part, when you have ag residues, it's mostly things that are unutilized or very underutilized. And so in some sense, there's waste there. But really, I would think of it as sort of extremely underutilized and has a lot of value, maybe, that is going to waste or getting lost. But there's an enormous amount in the United States, which maybe is where we can focus for now, just cornstover, for example, obviously concentrated in the Midwest, particularly the northern part of the Midwest. There's about 90, 95 million acres of corn grown in the US every year. There's order of magnitude four dry tons of stover per year on each of those acres. And so you're just on cornstover. You're looking at 400 megatons of ag residues that don't really get used. They just rot on the field and return to the atmosphere. What is stover, actually, on this corn stock? What is the stover? And then I think you just answered this question, but in a default scenario, corn is harvested. The stover just continues to sit on the field and eventually decomposes. That's what happens to it. That's right. And there's some geographical diversity that so we can get further into the nuance here. The stover itself is the stocks, the leaves. Depending on the harvest method, you may actually have cobs in the mix too. So it's everything basically minus the kernels, because the kernels are really where they value lies, whether it's animal feedstock or human consumption or high fructose corn syrup or ethanol. The kernels is really what we grow corn for today. But the actual practices around what happens to that stover are very pretty widely. There are a few places where it's used for cellulosic ethanol production, but it's really tiny and it's never really taken off. And as you get farther north, you can have very moist soils that hold a lot of water. And as you get farther north, those will sometimes stay frozen deep into the spring when they actually need to plant it. So depending on the place, there can be quite different practices actually around whether you need to remove it so that you can actually plant in the spring and not be dealing with frozen soil or in other places where actually, say like the Great Plains in Western Kansas and Colorado where you actually want to keep it on because it's more of it on because it's going to help retain the soil moisture, which is a huge problem there. So there's geographic diversity to that. Yeah, I have a feeling a lot of this. Part of the conversation is going to be like, there is no uniformity in general, and that's one of the challenges with doing anything at scale with ag residue. I'll stop saying waste. So the end, because you're even just talking about specifically cornstover, right? And that's going to be different from almond shells in California, from whatever soybean husks or whatever else it is. From a practical standpoint, let's view ag residue as a resource. It should be a resource, right? It has value. It has various things you could do with it. And we're going to talk about highest and best use. But one of the things that you and I have talked about a little bit that I think you have insight into that people don't often appreciate is just the practical challenge of aggregation and utilization of that resource. Talk me through, what does it take? Say you want it to do something, forget what you're doing with it. Say you want to do something with it at scale. What does that actually entail? There is, again, some diversity depending on the residue. If we stick with cornstover for a second and say you want to use the cornstover somewhere, typically you're not going to be able to use it on the field, right? Typically if you're going to take some portion of it, whether that's 70% or 30%, depending on the agricultural zone that you're in, you need to get it off the field. And so there's actually a lot of steps to get the biomass off the field in a sort of usable format at a usable distance where typically people are building centralized plants. And so that actually dominates the cost of the biomass, which is something that we're trying to invert this at charm by eventually operating on field to cut it this all out. But let's say you have a field that's all laid flat, a forge harvester came through and cut it all down. Now you need to first windrow it into a pile. Then you're going to bail it. Then once you have bales, you're going to have a ring machine that's going to stack the bales and bring them over to the edge of the field where it put them in piles. And then you're going to need something like telehandler to load it onto a truck. And they need to drive the truck and they need to unload the truck. And so every one of those pieces of equipment is a big capex piece and op-ex to run. You need people to actually do every step of that labor. So it's a huge portion of the cost structure, right? So if you're looking at getting cornstover, say delivered to, you know, like, I'd been going to a huguitin was a huge cellulose that got some oil plant that failed in Western Kansas because they were transporting their biomass 50 to 100 miles. They expected to pay maybe $60 a ton. They found in fact that they were paying like north of $120 a ton. And you know, the actual dollars that were getting delivered to the farmer for the stover that they had was maybe in the low tens of dollars. And all the rest of it was bundled up in the consolidation and transport of the biomass. So it's quite an operation to do it and requires sort of like specialized equipment for each different type of feedstock as well. So it's quite complicated. And there's some companies that do an incredible job of this, like Pacific Ag has large operation in the panhandle kind of region. And but yeah, it's tough. Isn't it also when you talk about dollars per ton, like things in a delivered biomass world get priced in dollars per bone dry ton, right? But actually the part of the problem also is that what you're getting off the field is not like one ton is not one bone dry ton. And so there's more material. It gets priced both ways. Yeah, it gets priced both ways. But like there's no standard. But I guess isn't that well, the bigger point is part of the cost that's loaded in there is that either you're transporting something that has partial value, right? Some some piece of the stuff that you're transporting is actually valuable. And another piece of it is not. And so you're carrying dead weight along with you or you have to go process it before you transport it, in which case it was a different piece of capital equipment that you need at the site in order to avoid transporting this stuff that is waterlogged or has whatever other stuff in it. Yeah, that's true. The water content has to overstover dries on the field pretty effectively into the like 15 to 20% range. So you're not carrying that much water. I mean, there is water in there. The thing that kills you on the transport less than the more than the dead weight there is actually the volume. So when you're trying to transport stover, you cube out, meaning volumetrically you run out of space a lot faster than you than you weigh out. And I mean, that's why you see these like insane trailers where it's like coming out all over the place, trying to haul the biomass. It's like the volume just literally you can't fit it all in there because it's so fluffy. So from a cost perspective, at least for cornstover, that dominates. But for wood, it's quite different actually. Wood can easily be 50% water if it's young growth and hasn't aged for a year post-cutting. So when you look at like wildfire thinning, for example, oftentimes we get wood that's in the 50% range. And there, yeah, it sucks because half of what you're transporting is useless. Right. What about heterogeneity? I mean, I think also this probably depends what you want to do with it. There's probably some things that you can do with it that are going to be super sensitive to heterogeneity and the actual feedstock and other things that won't be. But how big an issue is that in general? It's an issue, but it's an issue because you encounter edge cases of volume as opposed to it being like, you know, if you looked at, for example, at our wood chips that we process in Colorado, where we're getting in these, taking this stuff from forest fire prevention and thinning that the Colorado State Forest Service and US Forest Service are running and we were the forestry contractors, they would power burn this stuff otherwise. They send this sort of thinning material to us, which nominally should have a lot of heterogeneity to it because it's effectively a waste product that they would have to burn. If we were to stand there and look at it, you'd be like, this is pretty consistent material. Like visually, it's not like, oh, this is all over the place. But nonetheless, you can still get edge cases. You can get a rock that was like randomly stuck in a branch or you can get people talk about like bail the head of handgun in it. It happens. And so if you're processing it at scale, you do have to have things in place to ensure that that doesn't happen, but it's the exception. Like the heterogeneity is problematic in its exceptions as opposed to like some sort of like continuous variability. Variability and moisture content is interesting. That can really affect processes. And so having strong controls around drying or measurement of moisture content or depending on your process, the form factor of the actual material going into a biomass processing system can matter a lot. Like aspect ratio, like a long twig often is way more problematic than the same amount of mass in like a well-rounded chip just because you can create bridges and other things like that in equipment. So okay, if we want to let's just assume that we as a society or as entrepreneurs who ever want to utilize this residue, let's focus on ag residue here that we could talk about wood chips or whatever else to. Let's assume that we want to use it. It has some use. What are the things that you think then need to be true to make it work? In other words, I assume that basically the trade-off here is you can either do what the ethanol plant you described failed was trying to do, which is aggregate centralized, build a big centralized processing facility to go make something with it. And that you get the economies of scale on the processing facility. So that's good because you want that, but you have to source from a wider aperture geographically. And so you end up paying these transport costs and logistics costs that kind of kill you. Or you do something at the edge, which I think is closer to what you're doing because you then don't have to deal with the transport costs, but you trade off the economies of scale on the processing side. So how do you think about that balance? In some sense, this is the fundamental thesis of charm, which is you can't bring biomass to market in its broadly heterogeneous, like highly distributed, fluffy, current existing capacity. You just can't do it. It doesn't work. People have tried it so many times and it just doesn't work. So the things that do work today are when people have large centralized sources of biomass that could be rice holes coming out of a plant, or it could be sawdust coming out of plant. Like those are the places where it works. And so, but that's a tiny fraction. It's a tiny, tiny fraction of the total biomass. And so to your point, if you want to get it to scale, you do have to be able to go out into the field and convert it into some kind of format that actually is more homogeneous and transportable. And so that is basically the thesis of charm, which is can we take that material and instead of people have tried palating, people have tried all these things. But the problem is your density, your starting density is maybe like 100 to 200 kilograms per meter cubed. And even if you get that up via palating to like 400, 500, 600, it's still really, really hard. And so our fundamental thesis is can we go out into the field with pyrolysis equipment and consolidate that biomass by removing a bunch of stuff that isn't useful. So sort of reducing the total mass to what is the useful component in bio oil and biochar. And can we increase the density dramatically? So like the density of bio oil is 1200 kilograms per meter cubed. So almost more than a 10x in terms of consolidation. And so now actually you're weighing out your tanker and you have a pumpable fluid instead of having to deal with moving around bales that are super fluffy. And so the sort of fundamental thesis there is like, can you make it transportable and can you densify it such that the economics fundamentally change around your ability to centralize it for further processing or for consumption. So that's our fundamental thesis with pyrolysis. And people have tried a lot of other ways to do it. But we think this won't work. How much do a condiments of scale matter on pyrolysis? Like would it be just the trade you're making is you're saying I'll do a small pyrolysis unit. But in exchange for that, I will get this identity. I will drive down logistics, costs and transportation costs and all these things that blow up the economics of every other use of waste biomass. Or I'm sorry, ag residue or whatever it is. Presumably you believe that to be the right trade to make. But how much of a trade off is it really? Like if you were doing pyrolysis at a 10x scale relative to what you are doing it at, would it be notably cheaper? It can get notably cheaper up to a point. So we today operate two ton per day systems. It is significantly cheaper to operate like a 20 ton per day system. And that's what we're working towards. You'll have basically the same amount of labor operating something with 10 times the throughput, maybe 15 times the throughput. And you get a lot of leverage out of that. You start to see some diseconomies on top of that. When you go beyond, we think that sort of equipment, farm equipment, form factor. When you start moving away from a mobile piece of equipment into a fixed facility, you do get some economies of the construction. But you actually take on a lot more risk in every facility that you build. You have all the balance of plant. You have permitting. You have just more risk because you're going to build many fewer of them. And each one is going to be uniquely sized. And so there's actually, I think there's a, you actually break the unit economics in some sense break and jump beyond that mobile form factor. And that's part of our thesis is like how much throughput can we jam into a large combine kind of form factor is what we're ultimately going to be shooting for. And we think that there's great economics and continuing to push that throughput. But if we look at the CapEx, for example, of our system today on a per dollars CapEx per ton basis and compare it to say like state of the art paralysis facilities, we are already less than half of that cost on a dollar per CapEx basis. And that will decline drastically as we increase the throughput. So that's where you would expect to see the most economy there in labor. And we already are realizing an economy relative to where you would expect to see an economy and sort of through this concept of mass production. The other place where you'd expect to see economy is on the labor side and I think we won't beat that aside from sort of through automation and reliability that just requires fewer people over time per machine. But the CapEx thing is surprising to me actually. When I went around those numbers, I was surprised that we were already under the CapEx per ton. Is that a function of like the power else's market is not enormous and it's not like the most mature in the world? Like is it just in part there has been room for innovation because it's not like totally optimized? Yeah, it's also the case that there are some processes that benefit drastically from sort of a surface area to volume change, right? Like a lot of these world scale chemical plants have like massive volumes inside their reactors. And so as they scale up the sort of like metal cost, physical metal cost of the reactor vessel is declining because the surface area to volume ratio is declining. I think that there are some processes, I think pyrolysis in some senses is less influenced by that because you're sort of putting heat in and taking heat out. And so you almost have like a surface area to surface area scaling law. So maybe they also the pyrolysis is somewhat unique relative to other chemical processes. You heard the phrase speed to power a lot lately, but here's what it really means. AI data centers are being told that it will take years to get grid power. They can't afford to wait. So they're turning to on site power solutions like bloom energy. Bloom can deliver clean ultra reliable, affordable power that's always on in as little as 90 days. Bloom's fuel cells offer data centers other important advantages. They adapt to volatile AI workloads. They have an ultra low emissions profile that usually allows for faster and simpler permitting and their cost effective too. That's why leaders from across the industry trust bloom to power their data centers. Ready to power your AI future? Visit bloom energy.com to learn more. The grid wasn't built for what's coming next. Electricity demand is surging from data centers to EVs and utilities. They need reliable, affordable solutions that don't require building expensive new infrastructure. Energy Hub helps by turning everyday devices like smart thermostats, EVs, home batteries, and more into virtual power plants. These flexible energy resources respond in near real time to grid needs, balancing supply and demand. Plus they can be deployed in under a year and at 40 to 60 percent lower cost than traditional infrastructure. That means more reliability, lower costs, cleaner energy, you can't get much better than that. And that is why over 120 utilities across North America trust Energy Hub to manage more than 1.8 million devices. And more at energyhub.com or click the link in the show notes. All right. So let's assume you can get your Ag residue, you can get your biomass off the field, you can do it in a manner that is sufficiently dense and that is economic to do something with. And the next question then is, okay, so what should we do with it? Like what's the highest and best use? So I know you have opinions on this, but talk me through the, I guess to start the suite of options. What are the things you think of as being potential uses for that biomass once you get it off the field? Historically biomass has been primarily used for industrial heat, you know, sort of alongside an existing plant or for electricity production in some cases or for like car fuel production like ethanol. These are not actually very good uses for biomass. They don't really take advantage of the best properties that biomass has. What really distinguishes biomass is not necessarily its energy content, which is actually quite low, right? So like on a per kilogram basis, like the energy content of biomass is about one third that of crude oil. So it's pretty energy poor. What's interesting about it is that relative to almost everything else, it's very carbon rich. And so the use cases that rely either on the chemical availability of carbon or on the sort of physical availability of carbon, those or like in the case of carbon removal, like literally on the amount of carbon in there, those are the use cases actually that have the highest and best use over time. So carbon removal is obviously the market that we have gone into first where we can do bio oil sequestration and pump the carbon underground in a liquid form. That's actually a pretty high value use case for it because you're directly monetizing the carbon embedded in the biomass. There are other use cases where the carbon is really critical from a chemical perspective. So these are things like iron making. When you reduce iron oxide to iron, you need carbon monoxide and you can use hydrogen, but it's endothermic. So if you really, if you want to make it sort of work in a reliable basis, you probably need carbon monoxide. You need that carbon. Well, great. We have a carbon source. So iron making is a pretty compelling use case. Another one actually is SAF, is Jeff fuel. We don't have a lot of great dense energy carriers that can actually do long haul flights. And there it is. So we're going to need probably for a long time going to need carbon there. So those are some of the cases made like asphalt plastics. There's a bunch of these places where the carbon is an integral part either of being an energy carrier or being chemically involved in the process or structurally involved as an atomic element. Those are the places where and world resources and two would agree with this and their analysis, I think, which is like, that's where we need the carbon. And other use cases like car fuel are like pretty poor economic fits. As you're viewing why historically we've used biomass as an energy source rather than a carbon source predominantly just a function of like the market has been there for energy. The market has not really been there for the carbon stuff, certainly not for carbon removal historically. SAF is a relatively new thing. Is it just like a market maturity thing or is there some other reason why we've gone down the wrong road historically? Yeah, I think it's a market maturity thing. For the industrial heat and electricity use cases often that's when you have a concentrated flow of biomass. And you just want to co-fire with something else and you might as well, it's like buying down your total cost. Yes, a facility owner is like, well, I have this thing, why don't I use it? Whereas the sort of biomass that we're talking about maybe is like a different type of biomass, which is like, okay, but then there's like five gigatons of this stuff all over the world and it rots over and is today, which is a different term. Yeah, maybe the more. Right, probably the more accurate way to put it is that like a lot of the stuff has not been used actually historically. It's not that it's been used for this other stuff, the extent that it has, like if it's being used to produce ethanol, we've started to store it in a market of into existence for ethanol that is tax credit driven predominantly. And so there's an economic reason to do that that doesn't speak to the underlying rationality of like leveraging it for energy. Yeah, to be clear, there's like geopolitical reasons also to ensure that we have massive amounts of corn and food grown in the United States. So like, right, it's maybe gets more complicated than just what's the highest and best use of biomass. But yes. Okay, so I've seen the analyses too that basically suggest that like, look, the from a, okay, so let's just assume we care about CO2 emissions. Let's assume we care about greenhouse gas emissions and climate change in general. And then if you look at biomass, if you look at waste biomass, clearly, if you do it cheaply enough, the highest and best use of it is carbon removal. Like you just, you just get the most bang for your buck even over the other things that leverage the carbon, saff or whatever else, which is where you guys have started. The question then is like, it is less, I think in my mind, what, what is the highest and best use of the material and rather, what is the market for that, right? Which is the sort of underlying question in CDR. So I want to transfer to talking about that a little bit because you've been a kind of, I think you've delivered more tons of permanent CDR than anybody else in the world, or at least that was true at one point. And the other thing that I think you've done that has been interesting to me is that you found a more diverse set of buyers for CDR than most other folks. I think listeners to the podcast probably know that if you just look at like overall tons purchased in the CDR market, it's basically Microsoft followed by like an order of magnitude lower frontier, which is the Stripe Coalition, followed by a bunch of little minnows, you know, in relative terms. And so a lot of the CDR market, to the extent that they have actually generally presold tons, as opposed to selling tons, which is you've done, that's the buyer universe for them. Essentially, but you know, you have found some others on that list. So just give me your overall take on like how the CDR demand side has evolved and what your approach has been to finding those buyers. I think I have a little bit of a unique perspective here also as an X buyer. The reason that I'm in this market at all is because previously built a software company called Segment, which sold in 2020 and along the way, we were trying to figure out how to offset our carbon or remove our carbon. And I was really pissed off at the quality of what was there. And so I come from like a perspective of sitting in the buyer's seat, you know, beyond the folks that have gotten really excited and have driven forward the carbon removal industry, you know, the stripes and Shopify's and Microsoft's and Google's and Facebook, like, you know, sort of like core tech group. Beyond that, like, I feel a little bit of some of the pain that the broader market has encountered in trying to buy offsets historically because I went through it. And specifically, my experience was I went and bought some like offsets in Indian rain forest and the Amazon rainforest and it was like 20K or something. And then I came back a year later and I was like, wait a second, like, what happened? What happened when I bought those offsets? Like, is there any clarity of, you know, can I look up like which acres exactly did I protect? And like, did it, did it have an impact? Is it still there? You know, then you see in the news, like the Amazon is on fire and you're like, Oh, shoot, like, maybe I need to go re-buy something like, you know, did my protection totally fail here. And so the deeper that I got into that, the more I was like, this is bad. This is really bad. There's no clarity on it. There's no trail of evidence. There's no like FedEx-style delivery history of like what happened there. And so I think there's a few things that have differentiated charm and sort of appealing to a broader set of buyers. The first is extreme transparency. So like you can go to the website and this comes from that experience. So you can go to the website, www.tramadustral.com slash ledger and you can see a complete history of every delivery. You can click in and you can see where the biomass came from and so on. I still think it's a really crappy V zero. Like, I want to get to a point where you can like when the door dash deliver takes a picture of the food on your doorstep, like every picture, every step of the process, I want to have photo evidence of what happened and make that public. So that's one thing that still is extremely differentiated. We've made a big point of it over the years and I've like tried to push other suppliers to do that and for whatever reason it's still differentiated. And so from a risk perspective, right, if you're a buyer and you've been feeling all this risk of these like junkie offsets that you maybe got burned by, that's a pretty different feel in the sort of broader market. And the other is just all the co-benefits associated with charms process. There are many other processes that are sort of arbitragey of like, you know, delivering tons in a cheap fashion that are real but probably can't get to climate scale. What's different is not only can charm kind of get to a very large scale due to the feed stocks that we're going and getting access to, but the potential wildfire impact, the potential orphaned well clean up, you know, there's a bunch of things along the chain that I think are big benefits to human health and communities that buyers want to help support. So it's your view that there's like a significant volume of latent, I don't know whether this is the right way to put it, but latent demand for CDR that has not been unlocked largely because one is sort of lack of trust in the market, which I 100% agree with you. I lived, I worked in the carbon market world, the voluntary carbon market world like, geez, 15 years ago now and it's the legacy carbon offset world is a disaster in my opinion. So there's definitely some repair that needs to be done there. But so your view is that combination of trust and co-benefits deliver this like big wave of demand that we haven't seen fully show up yet outside of just that core group. You said the tech companies, et cetera. I think so. And like, and like why? What are they, what are they driving towards? Is it net zero commitments that they're trying to meet? Is it like, what's the underlying motivation for corporatilists? Do you think? Our underlying motivation for corporates is impact. And they want to trust that that impact is actually happening in like a measurable way. And climate impact is great. But they also, if they can double dip simultaneously into having climate impact as well as health impact because there isn't particulate coming out of a wildfire and into community impact because homes aren't getting burnt down and into community impact because it well is getting cleaned up and like it's not spewing radioactive brine at the surface anymore or methane. Like, you know, it's just, it's just there. If the goal is having a positive impact with, with these kinds of purchases, that's like, that's a lot more, right? There's just more there on the bone as opposed to, you know, some, some other approaches often have trade offs in this sense, whether that's like, you know, consuming a lot of power or other kinds of things, right? Where it's like that can be less appealing. Are there other categories of buyers that you think are likely to scale? I mean, I guess the way I think about it is right now, it's been the tech industry first and foremost, followed maybe by the financial sector, where there have been a few buyers who have stepped like some of the big banks have made some larger volume purchases. Is that the next big beachhead for CDR? Yeah, it's a certainly we started in high tech or technology, big software companies, AI hyper scalars. We see a lot of activity in banking, financial services. We see a lot of activity in consulting. Have a lot of consulting companies as customers. We're starting to see more activity and advanced manufacturing. And that's, you know, like aircraft, chips from suiticles, like, you know, if you look at a sort of chart of like profitability per ton or e-bit, dot per ton, like it's, it's the companies that have a lot of e-bit, dot per ton that are going to lead the way on helping things down. Per ton of emissions in this case. Not move, right? It's like, yeah, how much money do they make real? It's basically saying like, how hard is it for them to afford to purchase credits to offset a significant chunk of their emissions? Yeah. I will say though, that there are some companies that, you know, have done the analysis, right? Of like, they've reduced all their obvious emissions in terms of just buying clean electricity and so on. And they're getting down to the point where they're like, hold on, like, it's going to cost like $2,000 a ton for me to go like tear down a building and rebuild it with like a proper HVAC system that does like heat pumps, you know, it's like, and have clean concrete. And like, you know, at some point you get down to this like base load of like amortized embodied emissions and things that are like in the build structures. And it's really hard and really expensive. Um, and as they get down there, it's like, well, maybe this is just cheaper to remove. All right, Peter, this was fun. Thanks for talking through ag residue and carbon removal with me. But appreciate the time. Thanks for having me. Peter Reinhart is a co-founder and CEO of Charm Industrial. This shows a production of latitude media. You can head over to latitudemedia.com for links today's topics. Latitude is supported by Prelude Ventures. This episode was produced by Daniel Waldorf, mixing and theme song by Sean Mark wand. Steven Lacey is our executive editor. I'm Shale Khan and this is Catalyst.",
    "release_date": "2025-09-25",
    "duration_ms": 2116000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI5498570032.mp3?updated=1758772854",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-10-12T01:45:27.425219"
  },
  {
    "title": "Is now the time for DERs to scale?",
    "description": "A decade ago, DERs were hot. The hype was that things like batteries, smart devices, and other distributed energy technologies would offset the need for expanding traditional grid infrastructure.\n\nBut DERs never took off, at least not at the scale that many hoped for. They had high price tags and short track records compared to the existing substations, transmission lines, and generation options  that utilities were familiar with. In short, the market didn’t need them yet.\n\nFast forward 10 years, and things have changed. Load growth is increasing  while major grid bottlenecks — like in transmission, interconnection, and supply chains — may be opening up a new opportunity. \n\nSo is the time finally right for DERs?\n\nIn this episode, Shayle talks to his colleague Andy Lubershane, partner and head of research at Energy Impact Partners. Last week, Andy published a blog post making the case that DERs were a good idea that was just too early, but the market is ready now. Shayle and Andy cover topics like:\n\nWhat held DERs back a decade ago \n\nWhy now is different, including falling system costs and growing grid bottlenecks\n\nThe difference between demand response and virtual power plants\n\nThe potential hurdles to scale, like supply chain bottlenecks, foreign entity of concern regulations, and fire codes\n\nResources:\n\nLatitude Media: Can distributed energy answer AI’s power problem?  \n\nOpen Circuit: The grid flexibility solutions staring us in the face  \n\nCatalyst: Making DERs work for load growth  \n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is our executive editor. \n\nCatalyst is brought to you by Anza, a solar and energy storage development and procurement platform helping clients make optimal decisions, saving significant time, money, and reducing risk. Subscribers instantly access pricing, product, and supplier data. Learn more at ⁠go.anzarenewables.com/latitude⁠. \n\nCatalyst is supported by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform by visiting ⁠energyhub.com⁠. \n\nCatalyst is brought to you by Antenna Group, the public relations and strategic marketing agency of choice for climate and energy leaders. If you're a startup, investor, or global corporation that's looking to tell your climate story, demonstrate your impact, or accelerate your growth, Antenna Group's team of industry insiders is ready to help. Learn more at ⁠⁠antennagroup.com⁠⁠.",
    "summary": "The podcast discusses the evolution of Distributed Energy Resources (DERs) in the energy transition. Initially, the market didn't require DERs due to low demand and high costs. However, with the current surge in electricity demand and declining costs of resources like batteries, the podcast suggests that now is the opportune time for DERs. The conversation delves into different categories of DERs, such as distributed capacity resources like flexible loads and energy storage, highlighting their benefits and limitations. The hosts reflect on past enthusiasm for DERs, which didn't materialize due to market conditions. They speculate that the present scenario, with increased demand and lower costs, may finally pave the way for DERs to revolutionize the energy sector.",
    "transcript": " Latitude media covering the new frontiers of the energy transition. I'm Shell Kahn, and this is Catalyst. The power grid didn't need DERs that much in 2015. Now it desperately does, and every part of the system has major bottlenecks now. Coming up, this time might just be different for distributed energy resources. The AI boom is here, but the grid wasn't built for it. Bloom energy is helping the AI industry take charge. Bloom energy delivers affordable, always-on, ultra-reliable on-site power. That's why chip makers, hyperscalers, and data center leaders are already using Bloom to power their operations with electricity that scales from megawatts to gigawatts. This isn't yesterday's fuel cell. This is on-site power built to deliver at AI speed. To learn more about how fuel cells are powering the AI era, visit bloomenergy.com or click the link in the show notes. Surging electricity demand is testing the limits of the grid, but Energy Hub is helping utilities stay ahead. Energy Hub's platform transforms millions of connected devices, like thermostats, EVs, batteries, and more into flexible energy resources. That means more reliability, lower costs, and cleaner power without new infrastructure. Energy Hub partners with over 120 utilities nationwide to build virtual power plants that scale. Learn how the industry's leading flexibility provider is shaping the future of the grid. Visit Energy Hub.com. I'm Shale Khan. I invest in early-stage companies and Energy Impact partners. Welcome. Here's a headline from the Guardian in July 2014, quote, while the microgrid put major power companies out of business, end quote. If you were around energy circles at that time, which I was, you'll remember lots of these headlines as well as the general concept of the utility death spiral, which was a phrase that was thrown around a lot in those days. Long story short, surprise, surprise, it didn't happen. And I don't actually even think that is really worth talking about now because it's definitely not happening these days. But the backdrop to that line of thinking was the concept that we were going to see this wave of distributed energy resources that would decentralize the grid. They'd provide flexibility and resilience. They'd give customers more autonomy over their own power supply. Did that part happen? A little bit. But honestly, at the macro level, not that much. So the industry has a lot of battle scars around this whole concept. But times change. And there is good reason to revisit some priors here, which is exactly what I've been thinking about lately as I evaluate a whole host of new startups in the DER space. And as so often happens, while I'm thinking about a thing, my partner and head of research at EIP where I work, Andy Luberschain is writing about it. So he did. He published a great piece last week that's called, Finally the Time is Right for DERs. And let me just say he and I are both pretty bullish that the time is indeed right now for reasons we will discuss. But we do have plenty of learnings from watching this market largely fail to deliver its full promise over the last decade or so. If you were working on something truly novel and suited to the moment and the space get in touch with us, but in the meantime, let's get into it. Andy, welcome back as always. Excited to be back as always. Okay. Distributed energy resources. I don't want to spend a ton of time just laying out all of the different types of distributed energy resources to start, but I thought you had a useful categorization in this article that you put together. So start by categorizing how you separate out the different types of DERs. So in this article, I have a whole taxonomy, but we want to get into the details. I think there's really two key categories of DERs. And they're the things, basically the things that are distributed capacity resources, which I can define in a second, and then the things that are not. And maybe it's easier to start with the things that are not, which is energy efficiency and solar are sort of the two primary categories of DER that don't really provide you dispatchable capacity if you're a grid operator. And I don't want to throw shade on energy efficiency and distributed solar because I think those can both be extremely valuable resources, including for grid planners, not as much for grid operators because they don't give you real, they don't give you enough real time control, which is the real challenge here. But for grid planners, they can be extremely valuable. We should be considering them as a part of integrated resource plans for the power system. We should very much be counting on them, pushing the boundaries of them, et cetera. But the challenge is that what grid operators need increasingly today are resources where they give you a button and on-off button so that you can provide capacity to the grid when it's needed and ideally for however long it's needed. And the problem with energy efficiency and solar is that while you can take a typical profile that those resources give you on a planning basis, they don't give you an on-off button that operators can use in a real time basis, which is really increasingly valuable. And then the other category, the things that are dispatchable capacity, which you should just run through a quick list of, they do give you the on-off button, but they do not generally give you the on-off button as long as you want it. Bit, right? That is important to note. Of course, yeah. I mean, there's mostly no such thing as a perfect energy resource here. And I mean, the closest thing to a perfect resource from the perspective of a grid operator is a flexible, distributed gen set of some sort that can turn on and off really quickly, can ramp up and ramp down very quickly. And ideally, if it's a natural gas gen set and tied into a gas distribution line or a gas transmission line, it really can operate just like any other power generation resource and give you an on-off button and turn on for as long as needed, particularly if it's a really efficient, low emissions natural gas gen set. For example, one of our portfolio companies, the DIP, and ChantedRock has been deploying that type of resource for a long time now. And so it's not restricted by air permitting concerns. That's the closest thing to a perfect resource from a grid operator standpoint, because it's just like a centralized generation asset. It just happens to be spread out there at the edge of the grid. So that's one category is distributed generation, but some of the newer categories that I think are interesting, that's one category. There's kind of three other, really two other primary categories of distributed capacity resource that do give you some degree of on-off. The first is flexible loads. Basically, some piece of equipment out there on a customer premise that is capable of being turned on or off and ramped up and down quickly in response to some kind of signal from a grid operator. And one sort of name for flexible loads, the name we have known them by for most of the history of DERs is demand response, which is just a setup in which a grid operator utility comes to an agreement with a customer to operate those flexible loads in response to some kind of signal. And these demand response programs have taken a variety of forms for many years, sometimes bidding into energy markets in the wholesale supply side of the market, sometimes as utility resources. But in general, the idea is this is customer stuff that's turning on and off. The challenge there is that typically customers don't want you to be turning on and off their stuff all the time or for very long periods of time. So there are limits on what you can do with flexible loads as a grid operator. And then the third category is energy storage, batteries in particular, which are sort of in between. They're great from a customer standpoint, because to a certain extent, if a customer has a battery on their property, they don't necessarily care what that battery is doing most of the time. Depending on whether the customer is trying to use that battery in some way, like to do self consumption of solar, which they can sometimes earn a lot more or value their solar more highly by doing. Or if they're trying to reserve some of the capacity in that battery for backup power. But even in that case, there's still some portion of the energy stored in a battery system that a customer is probably fine with a grid operator using on a regular basis and they won't even know the difference. And so storage is a duration limited resource. You can't dispatch a battery forever because it has a limited amount of energy in it, but it can be used very frequently throughout the year. Okay, so good categorization of all the different kinds of DERs. You and I were both around a decade ago, decade plus ago, when there was a lot of hype around DERs. At that point, I don't know, it was mostly about, it was about thermostats. It was maybe a little bit about batteries, kind of early days of batteries. It was about EV chargers, maybe managed charging, stuff like that. It was different technologies, but the hype was very exciting. People talked about decentralizing the electricity system and things like that. And long story short, that's not what happened at this point. So how would you diagnose? Why didn't it take off? I think there were really two reasons why DER mania, DER enthusiasm, which I participated in. So again, I'm not trying to insult anyone out there. I think there was two primary reasons why it was too early in the early to mid 2010s, which is when all of that conversation about the utility death spiral and the New York reforming the energy vision proceeding and all these other, you know, extremely optimistic DER forecasts and plans were coming out. We're too early. The first is primarily that the power system just didn't need DERs very much. And, you know, I wrote about this in the article, but one experience for me stands out when I first started at Energy Impact Partners as an employee, which was back in 2017. We gathered together this group of folks from the utility sector from our LPs, many of whom were utility engineers working on distribution system problems and people that were specifically tasked with considering distributed energy resources. And I was super eager and excited to talk to this group at the time about all of the myriad ways that they were considering using distributed energy resources to reduce costs for customers and to solve problems on the grid. And, you know, I sort of set set out by asking them like, where are you, where are you all finding the non wires alternatives on your systems? Because if you were a DER fan at that point, non wires alternatives was this, this very exciting concept where utilities could use things like load flexibility or distributed batteries as an alternative to building out new substation capacity, upgrading, making significant distribution system upgrades that were otherwise very costly. So I asked the group, you know, where are you finding all these non wires alternatives? And I got this extremely disappointing answer, which was basically we're not finding them, like maybe one or two here and there, but they're outliers. And for the most part, you know, we're trying, we're looking around for where we might be able to use these alternative resources instead of upgrading the grid in a business as usual capacity. And we're just not finding them. And I really came to believe that these people were operating very much in good faith. Like they were looking and they just were not finding them. And that's in part just because, as we know, at a macro level, you know, the past 15, 20 years in the power system, we just haven't seen till very recently much load growth. So there just weren't that many places on the grid where there was tremendous amount of pressure to upgrade things quickly. It wasn't all that expensive to make the upgrades that were needed in most cases where they were needed. And so one reason we just didn't see that much interest in DERs is because we didn't need them for a long time. And by the way, that's not just true on the, at the level of the transmission and distribution system. That was true in the generation world as well, where, you know, for quite a long time, generation capacity markets, supply side capacity markets, had plenty of supply. There just wasn't an incremental need for new capacity in most places. And so why build DERs when you don't need them? Yeah, I think it was like, if it ain't broke, don't fix it kind of situation actually, which is like there was nothing broke. I think it was, you know, actually maybe the other way to put it is there's this trope in venture capital. You want to be selling painkillers, not vitamins, right? Yeah. And I think the early days of distributed energy resources, they were a vitamin. It was like, hey, isn't this cool? Couldn't you leverage a bunch of these distributed resources instead of building a new substation? But actually, like you could build a new substation. We could build a fast enough on the timeline that was needed. And so it was a vitamin. Hey, neat. Maybe this would be a better way. It wasn't a painkiller at that time. That's a great benefit. And actually to take that metaphor a little bit further, they were vitamins that were not fully FDA approved. Yeah. In the sense that. Over the counter, yeah. Yeah, exactly. Like something I saw on an Instagram ad. I don't have Instagram anymore, by the way. But theoretically, one might see it in an Instagram ad. Yeah. And that gets back to this partial challenge for DERs even today. We had a few short-term classes of DER, which we were just talking about, which is. Although there are a number of these DERs, which really can qualify as distributed capacity resources, they don't offer exactly the same kind of capacity as utility planners from the generation system to transmission to distribution are used to. If you need capacity on a particular feeder, distribution feeder, out at the edge of the grid, and you see load growing quickly there in your utility planner, you can upgrade the substation and the transformer and all the other equipment and maybe even the conductor going, going, you know, into that neighborhood. And you know that solves your problem because it gives you capacity, increased capacity, all the time. And you've designed sort of perfectly for the capacity you need. If you add a bunch of storage, you get a dispatchable resource with a limited amount of energy to work with. And so you have to be pretty darn sure you have to really sharpen your pencil and know that I need capacity for four hours a day or six hours a day at a maximum during these days per year. And I'm never going to have to dispatch the battery and recharge and not have enough time to recharge the battery and then have to dispatch it again right immediately afterwards. So yeah, it's kind of a, it's a vitamin you don't know very well. And unless you really need that vitamin, unless you're kind of like desperation is one of the reasons people try new things. And I think we were not, the system was not desperate enough back then. Right. And then the second point that you make in the article is the other relevant one, which is like not only was there not a ton of desperation in the market at the time, but actually a lot of those resources that you might use were also just expensive. I mean, this is particularly, I think that, you know, of the category of things that we've been talking about, batteries are the one where it's most different today from 10 years ago. But like it was also just an expensive resource. It was. And some of these resources still are expensive. And I think what the DER optimists or maximalists at the time got wrong was what we got right was that the cost of a lot of the hardware to enable distributed energy resources would fall precipitously. Everyone, I think listening to this podcast is probably familiar with that story for lithium ion battery cells and battery packs driven down by the EV industry. Everyone's familiar with that story in the last decade with solar photovoltaic solar panels. And it's also true, by the way, of all kinds of other distributed energy resources that were enabled by the so called Internet of Things, right? Like the cost of setting up a device making it connected and capable of reaching via the Internet became a lot lower. And there was lots of experimentation with different types of smart home and smart building devices during that period. So we got that right. What we didn't get right was that the soft costs of deploying DERs would not fall. And that's largely the cost of customer acquisition. It's like getting people, getting customers, whether they're homeowners or businesses to sign up to put something on their property or to sign up for a load flexibility program. That was pretty stubborn. That still is pretty stubborn, unfortunately. And then also the installation costs. And when you're shrinking down a large scale battery system and putting it into a box that has to be interconnected into a home owners circuit breaker and you put all the safety switches in place. And you get a skilled labor out on site to make that happen. It adds a lot of cost. And so even during this period as battery prices plummeted, we didn't really see the same thing happen with the cost of a fully installed residential battery system. And in fact, there's some evidence now just in the past few years that that's finally starting to budge. But it really has been like a past two to three years phenomenon where we've started to see, especially for batteries, and the cost of systems start to really come down a bit. You heard the phrase speed to power a lot lately. But here's what it really means. AI data centers are being told that it will take years to get grid power. They can't afford to wait. So they're turning to on-site power solutions like Bloom Energy. Bloom can deliver clean, ultra reliable, affordable power that's always on in as little as 90 days. Bloom's fuel cells offer data centers other important advantages. They adapt to volatile AI workloads. They have an ultra low emissions profile that usually allows for faster and simpler permitting and their cost effective too. That's why leaders from across the industry trust Bloom to power their data centers. Ready to power your AI future? Visit Bloom Energy dot com to learn more. The grid wasn't built for what's coming next. Electricity demand is surging from data centers to EVs, and utilities they need reliable, affordable solutions that don't require building expensive new infrastructure. Energy Hub helps by turning everyday devices like smart thermostats, EVs, home batteries, and more into virtual power plants. These flexible energy resources respond in near real time to grid needs, balancing supply and demand. Plus they can be deployed in under a year and at 40 to 60 percent lower cost than traditional infrastructure. That means more reliability, lower costs, cleaner energy, you can't get much better than that. And that is why over 120 utilities across North America trust Energy Hub to manage more than 1.8 million devices. Learn more at energyhub.com or click the link in the show notes. Okay, so this is getting to the, I guess the crux of the thing we want to speculate a little bit about here, which is I think people are smart enough to hear the two things that we said were holding the market back, which is that the market didn't really need these resources and that the resources were expensive. And they can extrapolate to today when the market definitely needs this and prices at least for some things, batteries especially are significantly lower. And so the thesis of your piece I think is maybe the time is right now. And actually this was a real thing, but it was 10 years too early or whatever it was. Is that, am I framing like sort of how you think about it right? I think that, yeah, that's exactly right. I'm pretty darn confident that the time is now. Of the two big blockers from 10 years ago, I think we've, like one of them is completely flipped on its head, which is the power grid didn't need DER that much in 2015. Now it desperately does. And you know, you and I have talked about all of the reasons for that on this podcast before. There's this electricity gauntlet metaphor that we've been using at EIP for the past few years to describe the state of the market. We don't have to be labor here, but like every part of the system has major bottlenecks now. So if I convened that group of, that same group of utility engineers from 2017, if I convened them again today and said like, are you seeing places, hotspots on your network where there's low growth that's going to be very difficult to meet and extremely expensive to build out, you know, an upgraded distribution feeder? Like I have zero doubts that the answer would be very different today. So that, that's changed a lot. I think it's still more of an open question. Whether and how much we can really move the cost of deploying various classes of DERs down. That's the piece that like I said, we're starting to see budge in certain in some ways, but it has been more stubborn over the years. And so, you know, the hope at this point is that there is a positive cycle of reinforcement in that the need for DERs will drive more programmatic deployment of DERs by various types of grid operators, which will start to reach economies of scale and drive down the cost. And I am encouraged that we're starting to see some significant use of DERs as capacity resources start to scale, which, you know, gets us to this other three-letter acronym of virtual power plant or VPP where like there are real VPPs now, hundreds of megawatts in scale that are being dispatched to actually make a difference on the grid in some places. And so I think and I hope that we see economies of scale starting to create a positive feedback loop for DER deployment. Just to play devil's advocate for a minute. Well, first let me say where I'm not going to play devil's advocate, which is actually, I think I'm, I don't care about the cost as much because whether or not the costs come down significantly from here, it's all about comparative cost and the cost of the comparison is going up, right? So if it's, if you're just thinking about this as capacity, well, the cost of capacity has clearly gone up. Securing any other type of capacity is more expensive than it was before. We've talked before on this podcast about the cost of natural gas turbines, which has been rising, but, you know, the cost of retail electricity, which is what a lot of these resources get compared against from a customer perspective is going up. So I actually don't worry that much about the cost. It matters, of course, but that to me is not the bigger question here. The bigger question for me actually is your first thing about like, well, it's proven that the market needs it. And so, and so it's going to happen. And where, where so many different technologies and categories have hit a brick wall in electricity historically is where people assume that just because the thing is better or even more expensive, is better or even needed, it will happen. But instead, everything moves too slowly and is driven by these esoteric state level regulations and utility programs that take forever to be introduced. And they're introduced, but they're too small or they have rules that are hard to meet or whatever. So, I mean, you just said the thing that like is the counterpoint in my mind, which is we have actual VPPs being dispatched now in the hundreds of megawatts. Hundreds of megawatts. That is very, it's great. I'm very excited about that. It is so little compared to the scale of the problem that we're talking about here, right? And so the question is, are we betting that those hundreds of megawatts, we've hit an inflection point and that now we're going to, the curve is going to bend upward and hundreds of megawatts turns into gigawatts and tens of gigawatts in the next few years, you know, two, three years. Is that a thing that can happen given the market construct? To your point, one of my weaknesses is that I have an economics training and I do tend to think like an economist, which means I tend to assume people make rational decisions and systems. Economic systems make rational decisions. And so it's a good point that like, there's a lot of friction in between where we are today and having really meaningful gigawatts of DER, distributed capacity resources deployed out there. And to a certain extent, my optimism today is more of a bet that the need is so great that the economic fundamentals will, in this case, finally, finally win out and be able to overcome those frictions. And we're starting to see, you know, again, more, this is sort of another data point of the need, but I think it also speaks to the increasing comfort of system operators using the system. And I think it's deterioration. And I think it's really important to see that the data is used using these resources. So one of the things that actually prompted me to write this article was seeing a post from Dana Guernsey and apologies, Dana, if I'm not pronouncing your last name correctly, but she's a CEO of Voltis, which is a big demand response aggregator. Which really caught my attention. We passed it around a bunch of SID IP. And it's basically showing how many times per year Voltis' demand response resources are actually dispatched by grid operators. So not the resources they have signed up to turn down when someone calls on them, but the number of times they actually do. And that in the last two years has been kind of escalating off the charts. I mean, it seems to be going exponential in 2025. And, you know, again, you could take that as just a signal, oh, crap, like grid operators really, truly need these resources now. And it is a signal of that. And so if you're finally actually using these resources, you're probably going to want to go find more of them. But I also think it speaks to the comfort that grid operators are having with DERs as an actual solution to their problems because it's not theoretical anymore. And so, you know, I'm not going to say I'm confident that we're getting to, you know, every utility has a GIGO-OT DER program. But could every utility, every major utility in the country within five years have a several hundred megawatt DER program instead of it just being a few that have a several hundred megawatt DER program? And in a few places where you're, you know, have a little bit more maturity in the market and more need, you could scale the GIGO-OT plus, like, that seems reasonable to me. So it's not, I don't think this is going to replace all the gas, all the gas power plants that we are building right now. This doesn't, you know, stave off the need for all the other types of resources that we're considering for addressing the GON-T-LIT. But I think it makes a dent and it makes a meaningful dent, hopefully, for the next five years. For what it's worth, I actually do agree with you. But I think it's important for us always to look the challenges of rapid evolution of the electricity market in the face, because it does happen, but it's pretty rare that it happens, like, rapidly. Because, again, like, something needs to happen in, again, in regulated markets, right? Like, it's different things in ERCOT are just going to happen. But in regulated markets, something needs to happen and then proliferate pretty quickly through lots of other territories and jurisdictions and so on. So, you know, that is a challenge. But as it starts to be, there is some tipping point that one can imagine we hit. I think that's right. Yeah, and it's going to happen at different paces for different types of resources. So, well, we've talked a bunch about batteries and I am, like, my long-term view on batteries is about as bullish as it gets in homes and businesses and vehicles and all kinds of other things. In the near term, like, in a three to five-year timeframe, I'm probably more optimistic about really expanding demand response. So, demand response across the country has kind of been flat to even declining slightly over the past decade, which is sad. And it really shouldn't be that way. Like, there's definitely more latent demand response potential out there. You know, it's around 20, 25 gigawatts now. Could we double that? Like, that seems completely doable. From commercial... Can you draw the distinction between... I'm not sure people always understand, like, what is the distinction between just expanding demand response versus this concept of a virtual power plant? Yeah, I mean, it's partially because many people, myself included, just casually used demand response as a stand-in for commercial, like, larger-scale facilities offering up flexible load. You know, in practice, you can have a virtual power plant, which is just an aggregation of resources that provides push-button control of some kind to the grid operator. You know, commercial and industrial facilities that have agreed to a demand response program can be a part of a virtual power plant. Usually, though, the connotation... This is all connotations, right? Because there's no strict definitions here. But the connotation of VPP, I find, tends to be smaller... Aggregations of more smaller resources. And oftentimes, including newer stuff like batteries, basically. But, you know, a big demand response program kind of is a virtual power plant of sorts. And I think partly the reason the demand response had a connotation as being sort of separate is because, historically, those resources have really not been called on very much. I mean, if you're a grid operator and you have a button that says demand response, but when you use this, you're probably going to frustrate some customers. And, yes, they signed up, but they signed up to be called on only 10 times a year for up to eight hours at a time or something along those lines. You're going to be pretty hesitant about pushing that button. And I think what really makes the demand response market grow is enrolling customers with more automation, a little bit more sophistication around how resources are dispatched so that they can, with less impact on customers, actually be dispatched more often. So, you know, in one of our portfolio companies at EIP is a company called Grid Beyond that's really sort of mastered doing that kind of next level of demand response with industrial consumers, where they really look at a facility holistically and think, how can we ring the most... The most megawatts out of that facility with the least impact on operations. I think there's definitely more of that to be done. Call it a VPP, call it demand response, but there's more of that resource out there. Okay, so I'm going to wrap up by asking you to describe two scenarios for me. Five years from now, first scenario, it goes right. And this DERs finally take off and start to reach the promised land. And they solve a meaningful portion of the gauntlet problem. What does that look like? Like, how do we get there? To your point, I think we need to start soon because these things take time. And they don't take time because of DER deployment, by the way. That can happen very quickly. That's one of the advantages of many classes of distributed energy resources, you know, whether it's a natural gas gen set. Or whether it's a residential battery. You can go out there and put a bunch of them out there very rapidly. And that can scale up to hundreds of megawatts very quickly, particularly compared to the bottlenecks in large-scale resources we're seeing today. But it's the programmatic side of things. Like, whatever entity is running the procurement or the program, let's start with the utilities, right, who sit in the middle of all of this. They need to start ramping up their programs today if we want to have, you know, meaningful, the kind of meaningful resources deployed within five years that you're talking about. So I think what we would need to see is lots of utilities saying, you know, look, we need capacity today. It really, truly is in all of the above strategy today. And we are going to set up a crack team to go figure out how we get distributed energy resource capacity most efficiently. And we're going to set a goal. And it's going to be, you know, a reasonable goal. But we're going to include that in our plan, in our integrated resource plan. So this is not some little program sitting aside that regulator has told us we have to do. This is something we're actually counting on to provide capacity when and where we need it. And I think we're, I, in my world, am starting to see signs of movement towards that, although these things do take time. But if you start doing that today, I can imagine a world where within two to three years, there's a bunch of those programs standing up. And like I said, once you have the signal, the DERs can be deployed very quickly. That's the bull case. Okay. So now on the flip side, right, that's the bull case on the flip side, then described to me the bear case. Why did what happens to lead this to just be another kind of like floundering effort to really scale up DERs? And I guess have it be something other than just the opposite of what I just said. This is the opposite. Yeah. Like what goes wrong here? Yeah. I mean, in addition to that, there's a bunch of kind of, there's a bunch of pretty, pretty kind of glaring risks. If we're talking about batteries, then supply chain is a pretty big risk and fiat restrictions on qualified to see. What's that? Fire code potentially? So far, that's not been a problem for residential batteries. It has been in larger commercial buildings and tent cities in some cases. I'm less worried about that. But batteries just not falling in price. Like batteries continuing to be really expensive is the real challenge. Like batteries do need to get cheaper. Not the cells, right? Those have gotten really cheap, but the full systems need to get cheaper if they're going to be really cost effective resources. That probably means some portion of the battery, like the cells, at least for a while longer, is coming from China. I guess the other one is like, this is somewhat related to programmatic approaches to deploy them, not moving fast enough, but continued hesitancy on using resources that do have some limitations, right? Because utility planners, they are inherently always going to prefer a 100% solution. That's how we've built the grid in the past, and nobody gets fired for putting in place a 100% solution that is going to work every day for all of the hours of the day, all the time. If you're going to put in a solution that's not 100% that has some capacity utilization limitations, like a battery, our most load flexibility, and even some gen sets, because for the most part, you're not going to run an actual utility. Most part, you're not going to run a natural gas gen set indefinitely, truly, for the entire year. You need to really plan for it much more carefully, because you need to make sure that if you have a four-hour battery or six-hour battery, you really have enough juice to get through the peaks when you need them. In addition, utilities really need to plan for these resources very carefully, and accept that they are not going to get a 100% solution for their actual problem, not for all problems that could potentially arise. That's tough. That's legitimately, I understand, fully, why that's not their go-to, and why that requires a mental shift. They're not historically, have not been incentivized to do it. All right, Andy, fun is always. Sure, we'll do it again as soon as you intuit what is already on my mind and write to the article, which will happen two weeks from now or something. Always a great time, and it's fun to be potting with another long-time DER believer. Andy Luberschain is a partner at EIP with me and our head of research. This show is a production of Latitude Media. You can head over to LatitudeMedia.com for links to today's topics. Latitude is supported by Prelude Ventures. This episode was produced by Daniel Waldorf, mixing and theme song by Sean Markwan. Steven Lacey is our executive editor. I'm Shale Kahn, and this is Catalyst.",
    "release_date": "2025-09-18",
    "duration_ms": 2461000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI4294556871.mp3?updated=1758168379",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-10-12T01:49:05.021702"
  }
]