[
  {
    "title": "The U.S. nuclear groundswell",
    "description": "The nuclear renaissance of the 2000s turned out to be something of a mirage. Buoyed by rising fossil gas prices, growing climate awareness, and steady load growth, nuclear seemed poised for a breakout moment. But that momentum stalled. Electricity demand flatlined. The fracking boom sent gas prices plummeting. And Fukushima rattled public confidence in nuclear power. Ultimately, only two new reactors, Vogtle units 3 and 4 in Georgia, reached completion over a decade later.\n\nSo is this latest wave of nuclear hype any different?\n\nIn this episode, Shayle talks to Chris Colbert, CEO of Elementl Power, which on Wednesday announced a deal with Google to develop three nuclear projects of at least 600-megawatts each. (Energy Impact Partners, where Shayle is a partner, is an investor in Elementl.) Chris, a former executive at NuScale Power, thinks last year may have marked the start of a nuclear revival: the recommissioning of Pennsylvania’s Three Mile Island and Michigan’s Holtec Palisades; Big Tech deals to support small modular reactor development; and the start of construction on TerraPower’s Wyoming reactor, the Western Hemisphere’s first advanced nuclear facility.\n\nBut until new reactors move beyond one-off projects to serial deployment, nuclear won’t achieve the cost reductions needed for widespread adoption. Chris and Shayle discuss what it will take to turn this groundswell of activity into widespread deployment, covering topics like:\n\n\n  \nCurrent tailwinds, like load growth and interest from corporate buyers\n\n\n\n  \nWhy corporate buyers may be better positioned than utilities to take on development risks\n\n\n\n  \nElementl’s technology-agnostic approach\n\n\n\n  \nDifferent nuclear technologies — light water, non-light water, and advanced designs — and Chris’s predictions for when they’ll reach commercialization\n\n\n\n  \nWhy iteration is essential to driving down costs (and why the Google deal involves three separate projects)\n\n\n\n  \nHow regulatory timelines are speeding up\n\n\n\n  \nThe steps of project development with a corporate buyer\n\n\n\n  \nChris’s criteria for site selection — and why attracting skilled labor ranks surprisingly high\n\n\n\n\nResources:\n\n\n  \nLatitude Media: Was 2024 really the year of nuclear resurgence?\n\n\n\n  \nLatitude Media: Is large-scale nuclear poised for a comeback?\n\n\n\n  \nCatalyst: The cost of nuclear\n\n\n\n  \nLatitude Media: Trump’s DOE is reupping Biden-era funding for small modular nuclear reactors\n\n\n\n  \nLatitude Media: Utah bets on a new developer to revive its small modular reactor ambitions\n\n\n\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.\n\nCatalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, and increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data plus tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.\n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "Latitude Media is hosting the Transition AI conference on June 12, 2025, focusing on energy infrastructure in the era of AI-driven load growth. The event will feature discussions on meeting data center demand with companies like FERVO Energy, Form Energy, and more. The podcast also delves into the nuclear power market in the US, discussing the current groundswell of support, the role of hyperscalers as buyers, the landscape of nuclear suppliers, regulatory challenges, and the involvement of utilities. Elemental Power's partnership with Google to develop new nuclear projects signals a shift towards smaller, more scalable reactor designs. The podcast emphasizes the need for regulatory reform and streamlined permitting processes to accelerate the growth of nuclear energy in the US.",
    "transcript": " Mark your calendar for June 12, 2025. Latitude Media is holding its fourth transition AI conference in Boston. This year's theme, energy infrastructure in the era of AI-driven load growth. We're going to bring together investors, developers, researchers, and tech companies to talk about the creative ways to meet data center demand. And companies include FERVO Energy, Form Energy, Scale Microgrids, Spark Fund, KKR, Generate Capital, Orenia, FlexGen, National Grid Partners, and more. Plus, we're going to have a live open circuit episode featuring Caroline Golan from Google, and a live green blueprint episode featuring Rick Needham from Commonwealth Fusion Systems. Get your ticket at latitudemedia.com slash events, podcast listeners, get 10% off their ticket, use the code latitudepods10 at checkout latitudemedia.com slash events. We will see you at Transition AI. Latitude Media, Podcast at the Frontier of Climate Technology. I'm Shail Khan, and this is Catalyst. If you ever went to IKEA and bought like four pieces of furniture the same type and constructed them yourself, the first one, you probably break it and have to go back and find a few things that you're missing. The second, third, and fourth ones, you're just knocking them out of the park in terms of how long it takes you to do it. And the same is true for nuclear, and that's just been proven over and over and over again. Coming up, new nuclear has come into the US, right? Imagine a world where connected devices like EVs, home batteries, and smart thermostats work together to support a more efficient and reliable power grid. Well, you don't have to imagine it anymore. This vision is a reality today, thanks to Energy Hub. With Energy Hub's Edge Derm's platform, utilities can create virtual power plants through customer-centric flexibility programs, making it easy to manage distributed energy resources and balance the grid. Unlock grid flexibility and reliability through cross-DER management with Energy Hub, the trusted Edge Derm's leader. Visit energyhub.com to learn more. Do you want instant access to energy storage supplier pricing that's project-specific? Or the ability to compare domestically-made battery and PCS options across the market? ANSA now offers the industry's first battery energy storage data and analytics platform to make better development and procurement decisions. ANSA provides in-depth commercial, technical, and risk data and analytics to help developers choose the best equipment for any project. Improve your returns and save months of evaluation time with ANSA. Learn more about ANSA's energy storage subscriptions at go.ansarunuables.com slash latitude or click the link in the show notes. I'm Shail Khan. I lead the Frontier Strategy at Energy Impact Partners. Welcome. All right, so I've been thinking about this. And here's the word that I would use to encapsulate what's happening in the US nuclear power market. It's a groundswell. I don't think anyone would deny that there's something happening here driven by a combination of political support and load growth, off-taker interest, capital formation, possible regulatory reform. But let's be clear, it is still true that the US has built one, count of one new nuclear project in the past X number of decades. And that's why a groundswell feels like the right word to me because sometimes a groundswell leads to a massive wave. But sometimes it doesn't. So in my mind, the operative question is in which direction we are headed here. We at EIP for disclosure do believe that there's a wave coming as evidenced by the fact that we helped to stand up and invested in elemental power, the pure play nuclear developer who's CEO Chris Colbert, you're going to hear from in a few moments. But there is still a lot of work to do to translate all this momentum and excitement into actual capacity on the grid. Anyway, elemental came out of stealth this week and announced a big partnership with Google to develop a three-site portfolio of at least 1.8 gigawatts of new nuclear in the US. See, groundswell. Anyway, there's a lot to talk about though in translating that to real action. And so we brought on Chris, who is the co-founder and CEO of Elemental. Prior to that, he was the CFO at NewScale, which many of you will know is the first SMR company to actually achieve design certification from the Nuclear Regulatory Commission. And again, for disclosure, as I mentioned, we at EIP are investors and elemental and I'm on the board. Anyway, here's Chris. Chris, welcome. Thanks for having me. Let's start by, I guess, getting your overall take on the state of the market, such as it is for new nuclear in the US. You've been in it for a while. What does it feel like? Where are we today? Yeah, so I have been in it a while. I first was recruited over the nuclear in 2007 at the first nuclear renaissance. But it's been through its ups and downs since that time. But now, I think that there's the right confluence of both market demand, investor sentiment, and regulatory and government policy to really make it happen this time. And we feel pretty well situated to make that happen in this marketplace. So I'm pretty comfortable with where it is and really excited about where we are, given the journey I've been through with nuclear. Yeah, you said the first nuclear renaissance in 2007 or so. That one was a mirage, right? So the question is, is this one going to be different? Yeah, so there's a couple of reasons why I think it's different. This time around is that all the things that we've learned from that first renaissance. And keep in mind, the Vogel 3 and 4 project came out of that first renaissance. That's your not at all a mirage. Just a project. Just a project. Just a project. And it had issues, but all the things that we learned from that first time around in terms of the policy, the off take, the execution stuff, I think is now all available to us with people who are involved in that to make this next round be successful. But really, the advent of the demand side where back in the 2000s, there was not really any demand growth. Now we're seeing phenomenal demand growth, which was strong to begin with, but just, I mean, really taken off with artificial intelligence driving it. And there's a trillion dollar balance sheet from those hyperscaler companies that can really allow nuclear to flourish and happen this time around. That wasn't prevalent last time. Right. So I wanted to talk through this sort of where we are now through four lenses, which I think are the key lenses, and you've already alluded to a couple of them. But so one is off take and customers. Second is suppliers, OEMs, like who's actually making reactors and of what kind and so on. Third is the role of the utilities, who obviously have a big role to play here. And then the fourth, maybe the big one at the end is the regulatory, state of regulatory environment for nuclear projects and nuclear reactors. So the one you talked about the most already, we can just go through relatively quickly, which is the off take side. What difference does it make? I mean, what I think historically, correct me if I'm wrong, anybody who's considering new nuclear in the United States wasn't really doing a corporate PPA type off take prior to this new wave right now, where obviously you guys just announced this big deal with Google. All the hyperscalers have made some kind of announcement or another on nuclear. So it feels like one big change there is of course there is low growth in general. But also you've got this class of corporate buyers that are general universally leaning into nuclear and interested in doing something creative with their balance sheets, right? Going above and beyond just saying, okay, I'll sign a PPA when you get the price down sufficiently. Yeah, absolutely. The first time around it was all based upon regulated utilities getting the rate pairs to underwrite it. And at the time they were trying to underwrite 17 billion, 20 billion dollar projects and their balance sheet or their market capitalization may be 20 to 30 billion dollars. And the growth didn't show up and their expectation for high gas prices at the time didn't come to fruition. We had cheap gas. And so those two things really conspired against the demand side of it, where we have the opposite, where we have pretty much all time low gas prices, but still a huge demand. And requirement from the hyperscalers out there as corporate buyers that want reliable base load power and increasingly want to see it be clean and build for long duration, so that they're going to have it available to them for a long period of time. So that has really changed from the first time around both in terms of what's driving the demand and the rest of the environment around it from a market perspective, really much better for nuclear this time than the first time. Can you talk a little bit more about like what is the market or what should the market be asking of those hyperscalers of the buyers? Again, above and beyond, yes, we will sign a PPA if you get the price down low enough, because there's a lot of risks to retire along the way in project development. And then there's also this question of how do we get the cost down in nuclear, which is at least in part a function of building multiple projects, not a single project, and then driving down a cost curve. So I know the hyperscalers have been thinking about, okay, what can we do beyond the obvious PPA? How do you think about that suite of possibilities? That's been the biggest change from the hyperscalers probably in the last two or three years, Shell, is that, you know, when I was before I came to Elemental, I was at NewScale, and we talked a lot to the hyperscalers and really said in order for projects to go on, they needed to have some, you know, skin in the game or some exposure to the development costs, because, you know, unlike renewables where the development cost might be in the tens of millions of dollars at most, it's hundreds of millions of dollars for nuclear, and you can't just have a power purchase agreement to make that kind of investment as a developer. And, you know, it took a while for people to realize that that was what needed to happen. And, you know, necessities, the mother and invention is that once people realize that I need clean and large amounts of base-load megawatts, nuclear needs to be part of that. How are we doing before isn't going to work. That kind of moment really solidified over the last, you know, year and a half with the hyperscalers of saying, okay, I need to do more than just say, I'll write you a power purchase agreement. We're going to make some investment. They made investment, you know, mostly in the technology, but increasingly, as a Steel, we're doing now with Google is in the upfront development, which is really the key part that needs to be dream-rest. Okay, so that's the customer slash off-take side. Let's talk about the supplier universe. Obviously, it used to be at NewScale, which was one of the suppliers OEMs in the space. But it's an interesting landscape there of like lots of activity, but also very few proven and or approved from a regulatory perspective, products, I suppose, that you can buy as a developer. So how do you think about that landscape? So, you know, we approach it in that there's been billions of dollars invested by these technology developers and either, you know, traditional light water reactors, which you call Gen 3 or Gen 4 reactors, which might be high temperature gas or sodium cooled. And they're all kind of nearing the end of their development process where they're not quite ready yet. They're all kind of trying to solve for something, whether it's a supply chain or licensing or whatnot. So we're technology agnostic and the belief that or the knowledge that we can go out and find sites that are amenable to the hyperscalers, what they need for off-taken location that we can develop in a way that in a year from now or year and a half now, we can pick the technologies that have made it through. They're sort of crucible of licensing and development and cost estimation that we can pick with confidence that we know what we're going to get when we're going to get it and what it's going to cost. They're almost there. And, you know, I can't tell you which one of them is going to be successful. But there's so many of them out there that have invested so much. I'm very comfortable that there's going to be, you know, probably three or four at least that are going to make it through that part of it that will be successful in the long term. Just hard to pick now, but that's how we really see it. And if you look at the two different kinds of broad types of the fission reactors between light water and non-light water, the light water is 50 to 60 year old technology. They're just doing it with better designs that are safer and simpler and bringing the cost down sometimes smaller so they do more work in a factory versus doing it in the field. And then you have the non-line light water types which, you know, have better safety characters and whatnot. But it may not be, you know, really quite ready from a supply chain or the fuel supply or some aspect of it, which probably will take a little bit longer to get confidence around that part of the OEM's equation. But certainly what we're looking for in the early 30s and the late 30s, we think that that's the early 30s is the light water reactors and the late 30s is when we'll see commercially more of the non-light water reactors coming before. You mentioned briefly the question of scale. This has obviously been another hotly debated topic in nuclear world, which is, you know, historically we've built large mega projects pretty much exclusively. There are technology companies who are developing everything from micro reactors that are a megawatt or five megawatts or something like that up to, you know, gigawatt scale type reactors. The deal that you just announced with Google is for three projects of 1.8 plus gigawatts total, so 600 megawatts plus per project. Is that scale born out of sort of what you view as the sweet spot given the technology landscape or is that more a function of, well, this is the scale that a hyperscaler needs to fulfill the capacity of a data center or both. It's really both because we're solved for two things, right? One is they have huge needs, but they want to see us get down the cost curve, which means you need to have multiples. And when you look at the sort of intersection of doing multiples, the size of the need they have, the capital they can deploy, and what it costs for various, whether it's micro, small or large reactors, the small light water reactors fit more generally into that category, as well as some of the smaller Gen 4 reactors as well. So this is kind of anything from 75 megawatts to 300 megawatts electric. That fits pretty well because, again, you get more swings at bad. So if you have one not work out, the other two will carry you through, which is how you want to see a portfolio work. And when you have multiples at a site and multiples in a deployment, you can get down those cost curves both in the factory and in the field more readily than you could with a large reactor. So that's really how we saw it playing out in real time. And the hyperscalers looked at all of them. And as our goal as elemental was to find the right solution that kind of threads in the needle between the OEMs, utilities, and the customers in terms of what makes the most sense. And that's where we landed up in our conversations with Google. Okay. So to sort of encapsulate what you're saying overall on the supplier side, your bet is that currently nobody's quite crusted over the commercial readiness hump yet. But you think there will be multiple vendors, OEMs who will get there over the next year or two. And so you're basically positioning yourself to wait and see who gets through the crucible or over the crucible around the crucible, whatever the metaphor is meant to be. And then pick the winners there. But that's obviously contingent on anybody sort of like getting through and getting commercially ready, which maybe is a good segue to the next category here, which is the regulatory, the state of regulatory and permitting. Talk to me about where you see that. Yeah. So I mean, number of designs have gone through design certification process, which gets your license for your technology. Think about like Boeing gets their 787 jetliner approved. Some folks have gone out and gotten construction permits or their applying form. So that's getting the permission to start constructing it. Nobody's gotten yet to the point of an operating license where you get the ability to load the fuel into these new designs. So that's kind of like the remaining one. But for the light water reactors, this is really 50 year old technology being run by the Navy successfully for, you know, since the 50s and then commercial nuclear fleet since the 50s. It hasn't changed dramatically in terms of the fuel type or what you do. Basically, you know, you split atoms, create heat, make steam, turn a turbine, make electricity. It's that simple. So all these technologies are going to work. And I would point out that, you know, all the technologies that have been deployed just most recently, whether it's an EPR, an APR 1400 or an AP 1000, they may have had challenges getting to the finish line. But once they got to the finish line, they are all working and an AP 1000s working very well. So for light water reactor technology, there really isn't a technology risk. It's just pulling together the right pieces to, you know, de-risk it in the front end to get to a final investment decision and then start construction and have a solid plan to be successful when you get into the field. Because that's where the challenges have been traditionally. Do you see any evidence? There's obviously been a lot of talk about having the NRC reformed in some fashion or another to speed up permitting. Do you see any momentum there from the NRC? Has anything changed? Do you need anything to change there? So, you know, there's been a lot of legislation over the last several years really driving the NRC to revise his policies, become more balancing its approach for, you know, making sure they'll maintain the safety to the public and the environment. But, you know, recognizing that there is a public benefit for nuclear power given its clean base load attributes. That has been demonstrated by reduced timelines for them to review various applications that I've observed just in the 15 years I've been in the nuclear space where, you know, what once took four years is now being done in two years. The hope is that we'll get down to maybe a year, year and a half. But, you know, what you'd like to see is that for the base load technology, which is what it is, to be sort of in the same timeframe of development of traditional combined cycle gas plant, which might be, you know, two years of development and licensing and then two years construction and then, you know, four years or five years, you're operational. We're not there yet, but I do see a path by which you get down to from the seven to eight years we're looking at the first ones. They're getting down to five or six years, which to me really makes a game changer when people have their planning horizons. That brings it all forward to be a real equal discussion. And, you know, I think we're going to get there. And we haven't been getting there clearly. All right. So then the final lens through which to look at the current state of affairs, I think, is utilities who operate basically all of the existing nuclear in the United States. Georgia Power is the one company that has actually built a new nuclear generating facility in the past, I don't know, three decades, four decades, whatever it's been. And now they, many of them, are also exploring new nuclear. But I think, you know, coming into it, maybe a little bit more caution, at least than the hyperscalers seem to be. What's your perspective on what you're hearing from utilities? Yeah. So, you know, what I hear from utilities now is what I heard from utilities back in the past, right, is that, you know, they fundamentally can't take development risk. And, you know, that's a having done fossil plant development. I did that for 15 years of coal and gas plants. That's a business where you expect to make two or three times return on your investment, on the development of the FID. And that doesn't happen for utilities. They're stuck at 10%. Right. So they're taking three X risk for 10% return. It just doesn't work out for them. And, you know, we're seeing with a, with the many of them, not all of them, but many of them, is a desire to have a developer like elemental come in, align with the hyperscaler, take care of the commercial risk, take care of the development and the construction risk, and then transfer the asset at commercial operation when, you know, you can just look at what consolation trades that in terms of what their cost of capital is. Pretty easy from the do that, very huge markups and value to them to do so. Or they can operate the plant as the operator for in their territory. And we're looking at all those models with them. But, you know, what we really see is that the recognition that somebody needs to come in to take that development and construction risk, the government's taking a piece of it, but there's going to be a slice left over from the private sector. And utilities just aren't the right investor for that, because they're just a fundamentally different risk profile from what a developer does traditionally. I think the other thing we're seeing from utilities is interesting is like, that the subset of utilities that already have operating nuclear that either has retired already, I'm sorry, was operating and has retired, or is scheduled to retire, or that they were thinking about building, but then stopped building. I mean, they're all kind of re-examining all that and saying, oh, there's maybe there is a nuclear renaissance coming here. How do I take advantage of the fact that I do actually have experience in nuclear to get that capacity back online or online in the first place? And that seems kind of universal, right? Like, I feel like every utility in their boardroom, if there's nuclear somewhere in their fleet, or there was supposed to be nuclear somewhere in their fleet, they're taking a fresh look at it. Yeah, I mean, I think that most of these utilities that are operating utilities of nuclear plants, if they had the opportunity to pick up an existing operating asset or one that was largely complete and de-risked, they'd be very inclined to do it, because you just look at what constellation stock price has done. I mean, that's the example I look at since it floated. It's just been phenomenal returns because of the preponderance of nuclear in its base. And that's a purely merchant generator. It's not even a regulated utility constellation. It's phenomenal in terms of what it's done. But that just proves the value of nuclear to all these folks. It's how do you get the assets on there? And interestingly, through the investment that EIP made and elemental were exposed to a large number of those operating nuclear utilities. So we have that capability of working with them and they're familiar with what we're doing. And in part, validate what we're claiming to do, which is to really span the void between the billions of dollars that have been invested by OEMs doing new designs and the gigawatts of demand required by hyperscalers. How do you meet those two things and us coming in the middle and making that happen is really what elemental is about. Catalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. The EnergyHub platform takes the guesswork at a balancing energy supply and demand. It uses machine learning to control customer-owned distributed energy resources, like EVs, home batteries, and smart thermostats, to precisely shape load profiles for grid flexibility and reliability. As the industry leader, EnergyHub helps more than 80 utilities manage 1.6 million devices. That's more than any other edge derms on the market. Click the link in the show notes to learn more or go to energyhub.com. Catalyst is brought to you by ANSA. ANSA offers a one-of-a-kind data and analytics platform and advisory services to support better project development and procurement decisions. For energy storage developers, ANSA's platform provides crucial information that you never had easy access to before. Now at your fingertips is real-time pricing for a long list of system configurations to suit any project. ANSA provides a 360-degree view of the market with a lifecycle cost analytics and commercial technical and risk data. With ANSA, developers can easily determine which products to use in their designs, finance models, and RFPs. Learn more about how ANSA helps save time and maximize profit at go.ansarunuables.com/.latitude. All right, so I want to talk about project development for nuclear because I think it's actually something that people certainly we hadn't thought enough about before we started chatting with you folks and getting involved with Elemental. It's different and distinct from project development of a wind or solar project, for example, or a battery project, or even a gas or coal project. So you just give me a quick snapshot of end-to-end. What does project development look like for a new nuclear? Yeah, so we start off with, and this is the first thing we did was we went out, find a customer, somebody who's willing to say, I want 20 to 30 years of power at this price range and willing to put in a portion of the development capital. That was probably the first 12 months of our existence was doing that with all the hyperscalers. Just Google happens to be the first one across the line on it and then working with them saying, where do you need these assets and working cooperatively with them and their host utility? Because many times they're building data centers where they have existing data centers and they know the existing utilities. We're coming in saying, we don't want to get between you and your customer. We just want to give you what your customer wants in a way that works for you as a utility. That's a very different model from what you saw in the late stages of fossil, which I participated in, which was basically if you build it, they will come. Also with renewables, we're going to get a plot of land connected and then go hunt for a PPA from somebody. We've reversed that process by putting the customer in the demand first, then finding a site, working with utility, go through the red flags analysis of it, do it in a technology agnostic manner, which he can do in the NRC process under an early site permit application. Then once that's in and you've gotten the site proven up from that perspective and that's really the environmental characteristics of it, you then select the technology and do a construction permit that's particular to that technology. That brings us to say 25, 26, we're doing that first part, 26 to 28, we're doing a construction permit, 29, we start construction and by 32, 33, we're operating the plant. There's a lot more in there than what I just said, obviously, but there's a lot of pieces to it that's more akin to a fossil plant development, but just much more expensive because the amount of work you have to do with the regulator, any amount of design you have to have done, and the fact that unlike a two-on-one CCGT, which you can go and talk to Siemens or GE or Alistair, whoever's out there doing those now, they have proven designs, we're still getting through that end of the development cycle for the new technologies and nuclear. You talk a little bit more about the site selection bit, just at the high level, what are the characteristics, what are the checkboxes you have to check for a site to be suitable for new nuclear? It comes down to what's the technologies by size you're looking at because generally size dictates how much fuel you have on the plant and the amount of fuel tells you how much danger or risk you have. The smaller plant sizes, the small modular acts you're looking at for Google can probably fit about 100 acres or so or less and you have no other consequences beyond that, but the sites have to be seismically qualified for the design you're building and some designs are more seismically robust than others, so you kind of have to envelope that part of it. You want to be sure you have access to transmission because I'll tell you that it's going to be easier to permit and get a nuclear plant built than it is to get new transmission lines, and that's just historically how it's been everywhere I've been, whether it's in the US, the UK, Australia, over in Taiwan, Philippines, people think that somehow transmission is a uniquely American problem. It's not, it's a challenge wherever you go because transmission lines are infrastructure that don't provide a lot of spin-off economic development for the people whose property it crosses, that's just the fact of life. So you want to be close to that, but fortunately in the US we have a pre-robus system where any former coal plant or any form or large industrial site will typically have the transmission infrastructure necessary for it, so that's the key piece of it, and then beyond that it's pretty much you can be in a lot of places and we have a proprietary system that we've developed through a number of different databases and vendors that rapidly just select down those sites that meet those criteria and then layering over it where is it that our customer wants to be and the utility they want to work with, and that's probably the interesting thing because people start a lot of investors asking like, well, what's the right place to be? And the answer is the right place to be is where our customer wants to be, well, where do they want to be? And what we found is that there is some geography to it, but they are more focused on who the utility is they're working with because they feel they have a better relationship with some utilities than others, and given that they're going to be making these investments for assets that will provide benefit not only to the hyperscaler but also to the rest of the grid, because frankly once you add a very robust nuclear plant to the system, it benefits everybody that's connected to it because of the reliability and the stability it brings to the grid. They want to make sure that they're getting proper benefit for that recognized and what they're doing. And some utilities are more evolved than others in doing that, or the discussions between the hyperscaler and utility are more evolved in that regard. So that's kind of the process that we've been going through in the site selection, and I would say that finding sites hasn't been the challenge quite honestly. It's making sure we know where the people want them. Once they tell us where they need to be, we can find sites. All right, I want to get to the last key questions about nuclear in the US, which are how much, when, and at what cost? Maybe we'll start with at what cost. The knock on nuclear in the US has been to the extent that we've done any of it. It's been ended up being very expensive, cost overruns, etc, etc. And there's lots of different theories on how you drive down costs, and lots of different examples from other countries, whether Korea or China or whatever it might be. Given your strategy, what is your thesis on how we get nuclear in the United States to be cheap enough to be economic for whoever the customer is? Obviously, it's a different answer if you're Google or meta or whatever versus somebody else. But clearly, we need to drive costs down at its not entirely clear. The first project anybody builds is going to be the cheapest. So what does it take? Is it just repeatability? Do the same reactor over and over again? Is it at a site level? What's your thesis on cost? Yeah, there's probably two levels to it. One is repeat ability, right? So just doing a one off design isn't going to work. And so that's why it led us to the three projects with Google. Is three a good number? Yes. Would five be better? Absolutely. Does it need to be five? It would be a bigger check for people to write to do that. So you have to be constrained by what that part is. And to put it mildly, you can't do enough large reactors in order and raise the capital to do it. It's just too much of a check to write to make it happen. So you need that repeatability because Google and everybody we've talked to recognizes that, okay, the first one is going to be more expensive than the second one than the third one. And if I have a project that has two units on the site, the first unit on that site is going to be more expensive than the second unit on the site. That was true for Vogel. That was true for Baraka. That's true for any single, anytime you've looked at a construction that had multiple of the same units in the same site. Units two, three, and four, you're amazed at how much less they are. But it shouldn't be surprising because if you ever went to IKEA and bought like four pieces of furniture the same type and constructed them yourself, the first one, you probably break it and have to go back and find a few things that you're missing. The second, third, and fourth ones, you're just knocking them out of the park in terms of how long it takes you to do it. And the same is true for nuclear. And that's just been proven over and over and over again. So I think the key thing is that the repeatability and going in there at the mindset of you're doing multiples on a site and multiple sites really allows you to have the confidence because it's been demonstrated. Even at Vogel, Unit 4, I think was 40% less than Unit 3. Just think about that part of it. So if you started off at Unit 4 and instead of Unit 3 as an example, you probably would have been okay. But that's not the way it played out. And then there's the site-specific stuff, which again, lessons learned is just make sure you have a good plan going in. And we all know what a good project looks like. You have to go through and have the design complete, have the supply chain lined up, and more importantly, have a plan for attracting the labor you need when you start and keeping the labor there for the three years you need it. And that's not that hard. You just got to be able to, as an owner, admit that if I have to pay a person $5 extra an hour to keep working my project as opposed to going down to the data center project down the road, then you pay that because if you don't, the cost for delay is not $5 an hour. It ends up being five times that. So it's really kind of having a plan and sticking to it and working with labor because that's the most uncontrollable aspect of this because we're a free country. And labor can go where it chooses to go. You're not going to prevent that. So your best goal is to make sure you incentivize them properly and treat them well. And you should have a successful project. All right. So that gets to our final question, which is how much and when? Not specific to elemental, but what's your view? I mean, you did mention some timelines for projects you guys are working on where you expect commercial operation in the early 2030s. Realistically, given what you see out in the landscape in general, how soon do you think we could or will have new nuclear operating in the United States and how much can we get in the timeframe that matters to today's customers? Yeah. So our goal was to have a gigawatt under construction by 2030, 10 by 35 and 100 gigawatts by 2040. We're now looking at 4.2 gigawatts by 2030. So you've already quadrupled that or halfway there to our 2035 goal. You know, I think realistically for commercial deployment, it's going to be the early 30s. OPG is just in Canada. So it's not part of the United States yet. It's not Terry O'Para generation yet that. The Ontario parallel generation up in Canada. They're talking about their first plant being a G.E.H. B.W.R.X. 300 starting construction, construction, nuclear safety related construction. This month or next is what they had announced, they haven't announced it yet. And then being operational by 2029 2030. So North America, that's the timeframe. You have others like Dominion, Duke, TVA, AEP, Holtec with their plant out of palisades, all talking about light water reactor small ones in the early 2030s timeframe. So I think that's still a pretty good prognostication on it in terms of when we'd expect to see it. Arguably some are further ahead than others. But again, whoever starts first doesn't mean they always finish first. But I think for a number of reasons, we can see these folks being available and working those projects in the early 30s. In terms of the cost, the first ones are going to be expensive, but overall we're looking at once you get down the curve, we're probably $10,000 a kilowatt. So if you have a 600 megawatt plant that'd be about $6 billion, the first one might be 15, 20% more than that. The follow on it's going to be less and less and less. So we expect these to come down fairly dramatically over time as we get through it. But getting through the first one is key. We have a plan for doing that to be successful. And we have great support from folks like Google, who recognize that, okay, I'm willing to accept the first one is going to be more expensive. But I'm sure as heck not going to accept it the second and the third one costs the same. And they won't. We're comfortable with that. All right, Chris, great to finally be able to talk about this publicly excited to go on this new nuclear journey with you for the next hopefully decade and not decades. Well, I've already been at it for 15. So it's another 20 or so, right? That's right. Yeah, I'm with you. I expect to have 10 gigawatts by 2035 and you can hold me to it. I plan to. All right, thanks, Chris. This is great. Chris Colbert is the CEO of Elemental Power. This shows a production of latitude media. You can head over latitude media.com for links to today's topics. Latitude is supported by Prelude Ventures. Prelude backs visionaries accelerating climate innovation that will reshape the global economy for the betterment of people and planet. Learn more at prelude ventures.com. This episode was produced by Daniel Waldorf, mixing and theme song by Sean Mark one. Stephen Lacey is our executive editor. I'm Shell Khan and this is Catalyst.",
    "release_date": "2025-05-09",
    "duration_ms": 2427000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI2246629710.mp3?updated=1746760439",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-13T01:46:38.366363"
  },
  {
    "title": "Frontier Forum: Unlocking next-generation VPPs",
    "description": "In the mid-2000s, Ben Brown started his career designing demand response programs that relied on pagers and telephones. Today, as Renew Home's CEO, he's leveraging AI and tens of millions of connected smart devices to help households save energy and create an entirely new approach to grid management.\n\nRenew Home is building a new kind of virtual power plant that moves beyond occasional emergency events toward continuous, subtle energy shifts across millions of connected households.\n\n\"The biggest evolution is connected devices,\" explains Brown, who previously led energy product development at Google after its acquisition of Nest.\n\nDuring his time at Google Labs working on large language models, Brown also witnessed firsthand the massive energy demands that AI would place on our grid.\n\nThis realization, combined with his work on smart home technology, led Brown to envision a new approach to virtual power plants – one built on subtle, personalized adjustments across millions of homes rather than occasional disruptive events.\n\n“There's actually a lot more value continuously throughout the year, over hundreds of hours where customers can save more money by helping support the grid.\"\n\nWith DOE projections showing a 200 gigawatt peak on the US grid by 2030, Renew Home's approach offers a compelling alternative to building new power plants. By focusing on customer control and personalization, they've achieved 75% opt-in rates, while creating a resource that is far cheaper than gas peakers.\n\nIn this episode, recorded as part of a live Frontier Forum, Stephen Lacey talks with Ben Brown about the next generation of virtual power plants. \n\nHow does Renew Home’s approach differ from demand response or battery-based VPPs? And what role can it play in addressing the grid’s urgent needs?\n\nThis is a partner episode, brought to you by Renew Home. It was recorded live as part of Latitude Media's Frontier Forum series. Watch the full video to hear more details about next-generation VPPs.",
    "summary": "Ben Brown, CEO of Renew Home, discusses the evolution of demand response programs, smart devices, and virtual power plants (VPPs) in the energy industry. He highlights the shift towards personalized continuous demand response, emphasizing customer empowerment and engagement for better outcomes. Brown stresses the importance of leveraging existing resources like HVAC systems in VPPs and compares the cost-effectiveness and scalability of VPPs versus traditional peaker plants. With a focus on expanding VPP capacity in Texas, he outlines the phases of scaling up and the benefits of partnerships with utilities. Brown emphasizes the need for utilities to adapt to new technologies and customer-centric approaches in managing energy demand.",
    "transcript": " This is a frontier forum brought to you by Lattitude Studios. In the mid-2000s, Ben Brown worked at Constellation designing efficiency and demand response programs. DR was gaining traction in the residential and commercial markets, but the resource and the technology behind it looked a lot different than today. Well, I think one of the biggest changes is we don't use pagers anymore. I understand there are red phones still occasionally though. Yeah, that part I don't work on as much anymore. But yeah, I think that the biggest evolution for sure is now more and more that we have connected devices as part of what homes and households have been adopting to help kind of reduce energy costs and have more control over comfort in their homes. And using this as a great way to engage and positively build a trust with customers I think has been one of the biggest changes of the last 15 years. There are now tens of millions of smart thermostats and smart water heaters across the US and they've opened up a vast opportunity for managing demand that wasn't available in those early days. In 2012, Ben went to Google where he worked on the company's smart home and Wi-Fi platforms. And later after Google acquired the smart thermostat maker Nest, he led the development of new energy offerings. There, he saw the potential of another emerging tool, machine learning. You could see the power of these tools used towards a consumer product experience that was just really unique. The original Nest thermostat used machine learning to predict heating and cooling needs and respond to some dynamic factors like weather, which set the foundation for Google's demand response offering. And the technology has radically improved since then. And that has evolved a lot, obviously over the last 15 years where now the capability is anticipating when electricity prices are going to be going up or down, having unique insight into in terms of like the thermal model of your home, having unique insight into like all the complexity around the grid and grid congestion and how that's going to evolve over time. That is exactly the type of things that AI is really, you know, kind of really helps it sing. That work brought Ben to Google Labs where he worked on large language models for energy and finance applications. And that's when he saw the other side of AI, the energy demands. And you could absolutely see just how energy intensive these new LLMs were going to be, right? Like if you think about the idea that maybe as each individual having kind of an AI co-pilot, that's the equivalent of like having hundreds of millions of new HVAC systems all of a sudden being put onto the grid. I mean, obviously we'll find efficiency, but it is an interesting kind of like analog to think about from just the infrastructural perspective and what it needs to do, what we would need to do as a system to support all these new really compelling use cases. Today, Ben is the CEO of Renew Home, a company building a new kind of virtual power plant that helps households save money while offering reliable grid capacity at scale. And he says we're now at a moment with all these converging forces. Ubiquitous smart devices, powerful AI, and spiking utility demand are setting the stage for a new generation of VPPs. There is going to continue to be, you know, more and more of a challenge to our system, tries to struggle to grow to meet that demand, not just on the aggregate basis, but really on the distribution and location basis. And I think that's also what's very unique about things like virtual power plants or DR versus just citing large central power plants. I'm Stephen Lacey. This week, a conversation with Renew Home's Ben Brown. It was recorded live as part of our Frontier Forum series. AI and electrification are driving load growth at levels we haven't seen in decades. The Department of Energy projects will see a 200 gigawatt peak on the US grid by 2030. So I caught up with Ben to talk about designing VPPs in this new era. What role can they play in addressing the grid's urgent needs? I deeply believe that we're in the infancy of how impressive and how powerful these use cases can get. You talked a little bit about the limits of demand response. Can you talk about why you think it offers diminishing returns as a one-size-fits-all solution? Yeah, so I think when we think about traditional DR as what was originally constituted maybe 20 years ago, plus where in which we had like direct load control, the canonical example that like folks think back on is those old AC compressor switches, where kind of essentially you would have something sent out to a system to turn off the compressor. And so household would be like turning up, turning down the thermostat to get cooler and nothing would be happening and it would just lead towards frustration. And so when we first launched Rush Hour Awards 12 years ago, a lot of the intent there was to say, hey, if we could prove out that customers with more control, the idea that they can always change the thermostat, adjust, always get to a different comfort set point in their homes. With more control, you'd have a much higher opt-in rate and you would be able to get more folks enrolled while still providing similar incentives for peak shifting and peak reduction, that we could achieve much larger rates of folks and through larger numbers, we would actually be able to deal with smaller opt-out rates across the entire population. And that was proven out, I think, really well over the last 12 years with kind of the evolution of DR in terms of what we thought for Rush Hour Awards and DR2.0 type of concepts. I think where we're at now though is that those were really targeted towards peak hours of the year, maybe 40 to 60 hours a year, where we were really just dealing with a really heatwave. Now, obviously, we're seeing one more variable weather throughout shoulder seasons, like the last couple of weeks, we've seen a lot of kind of heat waves or cold waves and that all of a sudden stresses the grid in unique ways. And so it's a lot more hours of the year where you're dealing with these kind of mini peaks on the system that the system really wasn't built for. And so how do we kind of leverage more of an ongoing continuous resource to support that? But then I also think that the idea when we start to incorporate in some of the distribution and location value of these things where in which there's actually a lot more value continuously throughout the year, hundreds of hours of the year, where in which customers can save more money by helping support the grid in unique ways that would be different from traditional infrastructure is also really compelling. And I think a really good direction for us to be going in. Okay, so tell me about how continuous demand response works. These subtle personalized continuous shifts. How does it actually work? Yeah, so I think a huge part of it comes down to this idea of control and personalization. At the end of the day, like as part of its core specifically for a smart thermostat, it wants to do its job, its job and its promise to a household is to optimize comfort while minimizing costs. And so when we think about kind of extending that more holistically, traditionally that was just really around efficiency, because we didn't have time varying pricing. In the world we're moving to where in which we have more now time of use rates. And we also have more stress on the system on a continuous basis where in which households can benefit from reducing that stress and getting rewards for that, it makes sense for us to lean much more into this idea of personalization. And really going deeper around, hey, we understand the unique rhythms and habits of your household, like kind of the flow of your day and where you're going and kind of what your preferences for temperature are during a given day. And we also have anticipation, because you have to remember like specifically heating and cooling is an asynchronous optimization. Right, it's something that like we want to get the house to the right temperature in 30 minutes or an hour, and so kind of have to be able to project what the next couple of hours of cost and great congestion, and your time to temp or time to heating or cooling your home based on the thermal envelope, all of those things are really well incorporated into something that, you know, through deeper personalization and optimization that we can do that's really targeted to households in terms of their preferences and minimizing their costs. And so back to this idea of continuousness. The only way to do that well is by really getting these things right and being highly personalized for households, so that we can incorporate all these benefits to be able to deliver the core promise, which is you're comfortable all the time. And we are minimizing your cost and helping supporting deeper aspirations that you may have around minimizing your consumption of carbon rich energy or minimizing the stress on the grid and these other things that you might also care about as well. And what are you looking at for opt-in rates so far? Yeah, so I think that's one of the biggest things that like at its core we can talk about these things, right? Like it's a really it's a cool concept to talk about it in the abstract and I think a lot of the industry has for a long time. And what has been really unique I think across the industry is what we've been able to prove out through opt-in rates. And so we have actually seen both opt-in and engagement that we're getting nearly 75% of all new Nest thermostat customers that install a device are opting into energy shifting. And what's great about that is that it's not only that happening in terms of engagement and opt-in, we're also seeing nearly all of those folks years later still engaged and still leveraging it and having really high satisfaction around it. And so to me, you know, kind of proves out the central point that we've been trying to articulate for a decade, which is with users having more control and a better experience in their home, you actually can get to an order of magnitude higher engagement and opt-in rate than what we have seen traditionally. Right, if we think about like the traditional demand response programs from 15 years ago, you know, the industry was probably seeing 10 to 20% opt-in rates. And so if we think about a world where in which we can engage a much larger population and then be able to have personalization, like there still might only be 20 to 30 or 40% that want to kind of maybe trade off more comfort for higher rewards or cost savings. And that's great. And we can segment out that population, but it means we can, it would be great to still have the other 40 or 50% engaged even if the optimizations are more subtle. So there's this very, sometimes very intense debate in the industry about utility control or customer control, you know, along the spectrum of distributed resources. And you firmly believe that customer control can bring better outcomes. Why? I think it's important for us to not look at that choice through a singular lens, which I also think can be somewhat flawed sometimes. So to me, customer control is a feature, not a bug. And the reason I say that is because the more customers feel empowered, the more they feel engaged in this overall part of supporting the energy system, dealing with kind of rising challenges to the system that have been increasing costs for a lot of folks in terms of, you know, the increased demand that we've been seeing across holistically, but also some of the climate oriented challenges that we've been seeing. And so having customers engaged in part of this is a really important feature because they now feel more empowered and the collective part of the solution going forward. And so I think that's just a one fundamental thing that I think sometimes gets kind of overlooked. The second important thing to my mind is if we're trying to build a resource when we think about like the power plant side of the virtual power plant analogy, a lot of it is actually you're trying to build a resource that can perform for 15 years plus, right? If that's kind of us trying to say that a residential aggregated resource is as good as a natural gas power plant. And I think if we're trying to push in that direction, in order for folks to want to engage and be supportive of the system longer term, they have to feel like they're in control. If they don't, and we kind of, if we kind of don't have trust in that system, and we don't kind of in continuously engage and reward customers around that, then it's one of those things that we could see folks Peter out of that over time. And then it does not have the same kind of benefits that you would think about from a power plant in terms of longevity. And then I think the last part about it is the whole benefit of a distributed system, you know, from like, you know, kind of all of our, you know, backgrounds and statistics and whatnot is like the power of large numbers, which is the reality is, when you give individuals control or a long system and you have hundreds of thousands of customers or a million customers, you know, stochastically, we can predict, you know, how these things will perform in aggregate. And so actually having control the entire time leads towards less of these kind of asymmetric outcomes where all of a sudden something happens because people are in control and it's more stochastically predictable versus another outcome, which we'd go the other direction. So there are many models that are approaching batteries as core to virtual power plants. And you really think that HVAC systems represent a really important resource. So you talked about why you're focusing on HVAC. First, that you're expanding to all these other connected devices in the home. How do you see these grid interactive devices evolving over the next five to 10 years as part of the foundation of the VPPs you're developing? You know, we tend to sometimes get really excited by the, you know, kind of silver bullet technologies, or we get excited about something that feels like is a new, a new evolution that is not actually has not had a massive adoption yet, but feels like if it did have adoption would have a bunch of, you know, beneficial characteristics in terms of supporting the needs we have going forward. This is a all hands on deck moment. We have, you know, we'd very different than where we've been for the last couple decades, as you mentioned, we have mostly had flat demand. And so now as demand is increasing substantially, and you're just going to increase substantially for the coming decade, you know, we really do need to look at all of the solutions that are in front of us. And so to me, the idea of not incorporating what is by far kind of the largest existing set of resources in infrastructure we have in the country, which is the 80 million plus central HVAC systems and 80 million plus hot water heating systems that is existing thermal storage infrastructure that exists across our country would just be kind of insanity to me, given the size and scope of the problem. It doesn't mean that as we are adopting EVs at scale, and as we are adopting more and more battery storage at scale on the resi side, that we shouldn't of course incorporate those are, those are going to be critical resources. They have a lot of different benefits and characteristics that does kind of thermal storage from HVAC or from hot water heating. But we need to leverage all of those, because you know, from the benefits of both the scale that we need, and the adoption curves that we have to ride, it is important that we're having a solution that is, you know, benefiting from the fabric of those things working together in concert. I presume a VPP is a lot more cost effective than a natural gas speaker, and a lot faster to deploy. You're looking at a moment when it's really impossible to get equipment. Goodness knows what's going to happen with tariffs to make build out more expensive. So tell me about comparing a VPP to like say, an alternative gas speaker option for a utility. How should they be evaluating these things against each other? Yeah, so I think that there's three things. So one is time to market, which we've talked about. So like if you're, you know, if you're still waiting on a turbine for until 2032, that's one. Two is definitely cost effectiveness. You know, if you look at the Brattle Report, it's a good example of that. We believe that VPP similar capacity resource would be 60% of the cost of a natural gas speaker investment. And honestly, that's probably outdated because now we know that natural building natural gas, um, peakers are even more expensive over the last few years, just because of the wait times, uh, and some of the, uh, the additional costs that are going into it. And it would be, and then VPP would also be 40% of the cost of a utility scale, uh, battery, um, investment. So we believe those, you know, for the first two timeliness, cost effectiveness, and honestly, the third thing, which I think also just gets overlooked a lot, is the distributed nature of the resource. We've talked about that, and that's actually something that is not getting incorporated nearly enough, but we all know a huge part of our challenge going forward is updating the distribution infrastructure that we'll need on an ongoing basis, especially with new use cases coming online with more, um, you know, EV charging on the edge, um, more home electrification. These are challenges that are definitely going to be, um, a key part of our distribution challenge going forward. And so I think that the, um, the decentralized nature of a VPP represents when engaged properly and incentivized properly with homeowners, uh, represents a huge benefit. Um, that honestly will be dependent on, uh, you know, going forward. So you've got a plan to build out a gigawatt of capacity in Texas. What, what are the phases of scale for building that much capacity? You know, what's beneficial about the partnership we have with NRG, um, in Texas, which we announced earlier this year is that, uh, one, we have large existing customer base of, um, nest thermostat customers as well as other, uh, platform partners that we have in addition to, you know, obviously a large, uh, huge, large, base of NRG, uh, retail customers, uh, in Texas. And so what's nice about it is that when fully engaged and brought together, um, that already represents a fairly large resource, um, of the, uh, where we're starting from in terms of, you know, getting towards that one gigawatt goal. Uh, but a huge part of getting to the one gigawatt goal will also be, you know, starting to give access to low costs and no cost thermostats, smart thermostats across, you know, NRG's existing user base and growing user base, also deploying other, uh, targeted technologies, whether that's batteries, EV chargers, really thinking through how we support folks on the home electrification journey. And so, you know, we, we definitely have a great scale of households and engaged households across Texas. And so a large part of what we're going to be pushing as quickly as we can on, uh, with a great partner in NRG is really just distributing these technologies to folks. So what has changed the most since you've been working on this in terms of how utilities and grid operators view these resources? So I mean, I think, you know, the last 15 years has been first space, which we talked about was proving when we think about when we launch rush hour awards, then it was about proving to utility partners that if we gave more control to users, we would actually build a much larger population of folks that were enrolled, that would be a much more reliable resource. I think we approved that out very effectively, getting to over 1.5 million thermostats enrolled in programs over 100 plus utilities. I think that was a really important phase of like moving the model from non controlled resources to a place where customers had control. So I think that was the first model. I think the next step of where we've been proving out why we launched for new was proving out that small subtle energy shifts with deep personalization across, you know, millions and millions and millions of households would actually have a even bigger benefit, both from a peak perspective, but also from a continuous perspective. And to me, like that is a huge part of what we've been engaging with partners on over the last two years, which is, hey, let's prove out that this resource has huge benefits that are not necessarily what we had thought about before, that if we think about an even larger population, the 75% of folks that are getting into these, you know, now that are enrolling in energy shift, how do we think about kind of a more deeply personalized continuous way of engaging with those folks that prevent that provides a much larger resource across the country. So like a good example on that one, and we've talked about this, the reason we've been really public about the numbers is to try to help with this, you know, kind of this chicken and egg question. And we've been really clear that saying, hey, we have over 5 million households that have enrolled, which represents capacity resource that is shiftable across the country. So, you know, not just in Texas, not just across the programs that we've already enrolled folks in, but there's capacity sitting across on the sidelines across the country. And I think the reason we've been public about that is just saying, hey, we want to let you know that most likely in your market, there are probably 50 to 300 megawatts of resource ready to go. We'd love to engage with you on it. And I think that that to me is really important because a lot of what we've been talking about in the industry is if we support incentives for programs and we build certain capability sets with technology, then eventually we can bootstrap our way to a meaningful resource. And as we all know, unless we're talking, you know, in the 25 to 50 plus megawatts in terms of actual resource, it's harder for energy partners to see it as meaningful. And so the scale is really critical to speak to. And that's kind of why right out the gate, we've just been like, no, we already have a lot of scale. And now we want to scale it even more so that it is meaningful enough for energy partners to engage with. All right. So as we wind this down, I want to get your thoughts on either the tech or adoption trends that you think are going to shape the industry going forward. So you've been at this for a couple of decades now. What do you think is going to drive growth or change over the next half decade or decade? So I think thematically, we've talked about, I've talked about control, could a good bit around like user needs for more control over our energy costs, more control over homes. And actually, I think control is a good theme. Control and empowerment is a good thing to think about when it comes to like technology over the next decade, because when we think about generative AI, my view having worked on this stuff is that most everyone is developing tools that are meant to augment our capabilities and give us actually more control as people doing work, people building businesses, people trying to operate their, you know, manage their costs in their homes that like generative AI is a massive augmentation to skills. It's a great, very powerful tool that actually gives us more control and more empowerment than somehow trying to take it away from us. And so I think that is really critical because I think generative AI could, you know, I think people worry that we'll go the other direction. I actually think a lot of folks are investing in it. I actually think it's the same thing when it comes to its potential effects on costs for customers and costs for the grid, that we have to think about how we drive empowerment and control around giving households more control over their energy costs because of the effects of growing demand. That is another key thing that I think that if we don't push in that direction over the next decade of giving more control, more empowerment with solutions to customers, folks will get more and more unhappy with rising energy costs. And so I think there's like a really good trend there around giving more control, more empowerment with more demand side resources to households to help them navigate kind of a growing demand environment that we just haven't had to design for historically. And then I would say just lastly, I really believe because of the growing demand environment that the partnerships between, I actually feel like energy companies, utilities are going to have better, deeper relationships with customers. I actually think it will go in the other direction that we've seen trend wise historically where actually there's a huge opportunity to build really positive reaffirming relationships between energy companies and customers because of this more control over costs, more empowerment to customers with how they're leveraging technology in their home to mitigate costs and to have more control over the experience in their home like comfort. So all these things to me is like these are me looking at these challenges through an optimistic lens because I feel like that's what we're in the business of is trying to build solutions here. Obviously, if we don't go in that direction, the other side of that coin can be very pessimistic. And so I'd prefer not to focus on that one. But I do think that these trends are coming. Like I think there's a lot of folks who are maybe don't aren't as aspirational about how much AI will grow in terms of its use cases. I haven't worked on this stuff. I deeply believe that we're in the infancy of how impressive and how powerful these use cases can get in terms of tools and customer empowerment and use cases. So I just think that's like that is going to happen. I also believe that like the benefits of home electrification technology around safety, around costs mitigation, around things like a better driving experience, which a lot of EVs just provide. These things are also going to be adopted. And so these things are coming. And I think it's a great opportunity for all of us in the industry to be a huge part of that solution. Ben Brown, CEO of Renew Home. Thank you so much. I really enjoyed this. Likewise, Steven, thank you so much for having me. This conversation was recorded live as part of Latitude Media's Frontier Forum with Renew Home. And there is so much more. This is an edited version of the conversation. If you want to watch the full video with lots of listener questions about the design and operation of VPPs, head on over to latitudemedia.com slash events and click watch recording. There's a lot more technical conversation there. And if you want to learn more about partnering with Renew Home, visit renewhome.com. Thanks so much for listening.",
    "release_date": "2025-05-06",
    "duration_ms": 1576000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI3769855352.mp3?updated=1746574419",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-13T01:49:38.782840"
  },
  {
    "title": "Catalyst Live at SF Climate Week",
    "description": "It’s a Catalyst first-of-a-kind: our very first live event! We hosted it last Wednesday at San Francisco Climate week. In this episode, Shayle talks to Mike Schroepfer, co-founder and partner at Gigascale Capital and former CTO of Meta, and Nick Chaset, CEO of Octopus Energy US. Together they cover:\n\n\n  \nLessons on building products that consumers love\n\n\n\n  \n Over and under hyped trends, including data center load growth, carbon removal, and fusion\n\n\n\n  \nWhat areas will benefit most from the current administration\n\n\n\n  \nThe most important, least appreciated category of climate tech\n\n\n\n  \nThe craziest idea that just might work\n\n\n\n\nRecommended resources:\n\n\n  \nCatalyst: A skeptic’s take on AI electricity load growth\n\n\n\n  \nCatalyst: The geopolitics of rare earth elements\n\n\n\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.\n\nThis special Catalyst Live was sponsored by JP Morgan Chase and DLA Piper.\n\nCatalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, & increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data and tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.\n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "In this podcast episode of Catalyst by Latitude Media, Shel Khan discusses the hype around carbon removal, introduces Energy Hub's virtual power plant platform, and ANSA's energy storage data analytics platform. The live recording at San Francisco Climate Week features guests Nick Chaset and Mike Shrepper discussing the challenges and successes of consumer-facing climate tech products. They delve into the importance of delivering a delightful consumer experience or cost savings, emphasizing the need to focus on tangible benefits over climate impact. The episode concludes with a game of determining if trends like data center load growth are overhyped, underhyped, or just right.",
    "transcript": " Latitude Media. Podcasts at the Frontier of Climate Technology. I'm Shel Khan, and this is Catalyst. OK, audience. Carbon removal over hyped. Reasonable votes there, carbon removal under hyped. I feel like that was less people, but with stronger opinions, which I respect. Carbon removal hyped just right. OK, not a lot of moderates in this audience, which I appreciate. Coming up, we're live. Or we were live anyway. Imagine a world where connected devices like EVs, home batteries, and smart thermostats work together to support a more efficient and reliable power grid. Well, you don't have to imagine it anymore. This vision is a reality today thanks to Energy Hub. With Energy Hub's Edge Derm's platform, utilities can create virtual power plants through customer-centric flexibility programs, making it easy to manage distributed energy resources and balance the grid. Unlock grid flexibility and reliability through cross-DER management with Energy Hub, the trusted Edge Derm's leader. Visit energyhub.com to learn more. Do you want instant access to energy storage supplier pricing that's project-specific? Or the ability to compare domestically-made battery and PCS options across the market? ANSA now offers the industry's first battery energy storage data and analytics platform to make better development and procurement decisions. ANSA provides in-depth commercial, technical, and risk data and analytics to help developers choose the best equipment for any project. Improve your returns and save months of evaluation time with ANSA. Learn more about ANSA's energy storage subscriptions at go.ansarunuables.com or click the link in the show notes. I'm Shale Khan. I lead the Frontier Strategy at Energy Impact Partners. Welcome. All right, this was a fun one. Our friends at JPMorgan and DLA Piper offered to sponsor a live recording of the Catalyst podcast last week at San Francisco Climate Week, which I'm sure many of you were at or heard about. We haven't done a lot of live episodes of this show in the past, not for any particular reason, except that we just haven't done it. So we decided to make this one a little bit more fun. I had two great guests, and we did a little bit of a normal panel-type conversation. I'll be a less panel-y. And then we spent some time playing some games. Hopefully you'll enjoy it. Hello, everyone. Oh, we're here. So before I introduce my venerated guests here, we do have to prove to the listeners of the podcast that this is actually live and real. So I'm going to ask you to make some noise for just two seconds to prove that we are actually live. Welcome to Catalyst. All right. So I've got two great guests with me today. The first one used to cost me a lot of money. That is Nick Chassett. Nick was previously the CEO of Ava Community Energy. Ava is the Community Choice aggregator, the California-specific phenomenon that allows you to select your own retail electricity provider in a non-retail choice market. He was the CEO of the CCA in the East Bay, which is where I live. I live in Berkeley. So Nick used to sell me really expensive power. I'm sure he will blame PG&E for that, but nonetheless. Nowadays, Nick is the CEO of Octopus Energy US. I'm sure many of you have heard of Octopus. Octopus is a behemoth climate tech company based in the UK. Nick runs the US operation there. They do lots of different things and they have really cute pink octopuses as their spokesman. Another guest today is Mike Shrepper. Mike used to cost me a lot of my time. Mike had a long career, a successful entrepreneur in the tech industry, but then spent a really long time as the CTO of a little company you might have heard of called Meta, Naif Facebook. And then I guess three years ago, Mike, where did Joe leave? Three years ago, left Meta and decided to dedicate himself to climate tech for reasons unbeknownst to any of us and started a firm called Gigascale Capital, which is an early-stage venture capital firm that has become a great partner to me and Energy Impact Partners Briarworks. So Nick Shrepper, welcome to both of you. Thank you. Glad to be here. Yeah. Okay. So here's the topic I want to talk about with both of you before we get into games. I was thinking about this. One of the things that I think is a knock on the climate tech world is that there just are not that many examples of big generational success stories from a startup perspective. There just aren't that many of them. From an investor perspective, there aren't that many fund returners, right? But to the extent that there are proven ones, I think that a disproportionate share of them to date have been consumer products, consumer companies. So the obvious examples of this being like Tesla, obviously, or you could say Nest, maybe Octopus is going to be one of these as well. And so that is interesting because I find that in climate tech world, actually, it's the minority share of companies today. So maybe the majority share of historical big outcomes. And both of you have different and interesting experience selling or sort of building consumer products. So I don't think we talk enough about that. Trep, I guess I'm going to ask you this first. What have you taken? What are the lessons from all your time at meta building Facebook and Instagram and what's up and so on? What are the lessons that you think apply in the world of climate tech? Well in the consumer space, I'd say the lesson is it is really really hard to build a great consumer product. And I think anyone who hasn't built it will really underestimate how difficult it is. So your average consumer is like quite a demanding customer. The flip side of that coin is if you can cross that chasm and build a product that people love, then you have just like a runaway success business. And I think that's the thing you're seeing. In the climate tech space, I think the up and comer there is Mill. They make a home composting device that sort of makes your trash not stink. But the thing that really caught my attention is when I looked at their net promoter scores when they share with like how much your customers like it. It's in the zone of like, you'll know if your friend has one because they will tell you about it six times. Like have I told you about my mill? Do you want to see my mill? That's how much people love this product. And once you get a product like that, you get consumer board of mouth, right? And you get influencers and you get a whole bunch of other things that just self reinforce. And then you have just a runaway success business. So the lesson there is like high bar. It's difficult because consumers are discerning. But when you cross the bar, like the rewards are the rewards. Awesome. Yes. And how do you think about getting the attention of the consumer in the first place, right? Like there's one thing which is, I guess this is your point. And a promoter score, which is, is it word of mouth that drives? Like are we looking for viral adoption of of climate tech products driven by word of mouth? Is that the path to glory here? Yeah. I mean, it needs to, it needs to cross two chasms actually. One is, it has to be something people love. And it's like solves a problem that people really care about. And then that that problem in that class of people has to be big enough to build a great business. Because I built an awesome consumer hardware product that people loved that wasn't a big enough business. And build this thing at medical, or Facebook at the time called the portal. And it was a video chat device. And it was amazing. It was basically center stage before you had to get stick in the corner and video chat with your kids and it would follow you around. If you talk to people who love this bought this product, they love it. And they tell other friends about it. But a like dedicated video chat device just wasn't a big enough market. Right? Everyone's like, well, I can kind of use my iPad. It's like good enough. Right? So that cost one, but not the other. So but if you can get both of them and say like, is this a problem like literally every consumer has, and it's a like top three problem that they really care about. And this is like when I first was looking at joining Facebook, it was just going to like the basic process I went through my head of like, what problem is this company solving? And at the time it was keeping in touch with my friends and family. It's like, well, who on earth cares about that? It's like, well, basically everyone. Right? So this is a universal product. So the most extreme version of that, I think that's hard to find in climate tech. But I think like who here likes taking out their trash? Anyone? You have to get a hand raised on that one. Right? And who likes to like have their trash be stinky and smelly? Nobody. Right? And so like Mill sort of solves that problem. And it's pretty high up in people's like taking the trash out sort of sucks and you do it every day. So so I think you've got to get into that zone. If you love it and it's a big enough problem. That's a good bridge to talking about consumer products and energy where Nick, you have an interesting experience there because I can make an argument, I think of either thing one, one which is people really do care about it a lot. I mean, certainly we see rising rates all over the place. All three of us live in the Bay Area and PG&E territory and not to keep knocking on PG&E but the rates are crazy. Right? So people care about it. It like affects it's a decent chunk of their, their monthly spend in their house. On the other hand, like notoriously nobody cares about it at the same time and it's like invisible to everybody. So, so Nick, you used to sell retail electricity but also you were getting involved in a bunch of behind the meter solar and storage and EV charging and all that kind of stuff. How do you think about that question of like getting above that threshold? Is it a big enough thing that people care enough about that you can actually get adoption? I think you actually actually solve a real problem. So some of the most successful sort of true climate tech companies have been solar, rooftop solar companies that obviously are sort of in the downslope perhaps now but have had some, some, some quite high highs and it's because they were solving that problem. My bill is too damn high. Okay, I can save 25% on my electric bill that I'm, feels too high by signing on an iPad. Some construction crew will come put some panels on a roof. Cool, I don't have to think about it. I just save money, right? So I think they're, the challenge in energy is that largely energy is invisible. You don't interact with it, right? So, you know, the mill is a great example. Great product solves a tangible problem that I interact with on a daily basis. I, for instance, am really, when I was at Ava, less interaction now but was really excited about some of these really interesting induction cooktop technologies, right? Because you're actually solving problems. It is better to cook with induction than gas. Once you do it, you're like, this is easier. Like, I come home, my kids are hungry. It takes me seven minutes to boil water for pasta with my, you know, typical, not super crazy BTU gas stove. I induction, it's three minutes. So that five minute period that I get food on the table faster is like the five minute period that's the difference between me having a pleasant evening with my family or like an evening where my kids are like, I'm hungry, I'm screaming, and I've like crossed that threshold of no return. And so I think in energy or electricity specifically, like there are not too many of the climate tech products are not really products that people interact with in their daily life that solve daily life problems. So the companies that have done really well, Tesla, they made a product that was just better than internal combustion. The car is better. Now we're in a place where lots of EVs are better. Once you drive an EV, you don't go back to driving an ICE car. Mill, as people, I would be interested to see what the stats for mill are. Once you actually have a mill, well, you're like, I don't want this anymore. I'm going to go back to like having compost, I open the bin and it smells. And I think that is probably one of the fundamental challenges is the consumer sentiment of like, is this making my life better? There's a lot of products that don't really make people's lives better in a tangible way day to day. What's interesting is there's two archetypes that you described there. And I guess success stories in both, right? And I think of it as being like, you are delivering a delightful consumer experience. It's better than whatever other thing is. I'm boiling my water in three minutes or I get to throw my thing in what would have gone to a compost and it just eats it up and turns it into dust, which is basically what Mill does, or I get to drive a Tesla. That's the delightful consumer experience. The rooftop solar example is a different one, right? It's not a delightful consumer experience. It's basically no consumer experience. What it is is an economic experience. It's a savings. And the thing that unlocked residential solar was the introduction of the lease in the PPA model where at that time, like SolarCity and Sunrun and Sun Jevity and the companies that were pioneering that were able to offer you basically savings on day one. So you could just save money on your bill. You get solar on your roof and you feel good about it. But the question that I have, there's like, I think there's a trope in climate tech, which is if you're developing a consumer product, you shouldn't sell the climate benefit. Like that shouldn't be at least not your primary sales pitch. It should be something else. And if it happens to be good for climate, great. Nest didn't sell that you were saving energy. Nest sold the experience of it. Do you believe that to be true? Should you not put climate or environment energy at the front and center? I would actually say it even slightly stronger, which is we use this word climate tech like it's an actual good definition of a market segment. When we just talked about like, I sell products to consumers that save the money. I also sell products to consumers that make their life better in the kitchen, trash or peeding water. I sell products to businesses that save the money, sell products to businesses that help them grow. Like, those are businesses. And the tech, heart tech or others. So I think that adding the word climate on actually confuses the equation because at the end of the day, somebody is paying you for this and they have to pay you for it because they really want it because it saves the money, makes some lives, saves their solves a problem for them. You can put whatever word you want in front of it, but it's a business. And so I think that that is the thing that you just can't lose the threat on is that at the end of the day, you have to deliver that value. Otherwise, people aren't going to pay for it. Well, Nick, when you were out there chilling residential solar batteries or whatever it might be, what's the pitch? Resilience. So if you live in the East Bay and you're out in Dublin or Pleasanton and you live on a feeder line where you're getting 15 times a year, the power is going out because I'm shut off. You're like, I don't like that. I just lost $200 worth of food in my fridge because I lost power for two days. So like, how do I solve that problem? Well, if I can put solar and storage on, great, I solve that problem. So it's resilience and spill savings. The number of consumers we would engage with who are really focused first and foremost on why want to be green was actually pretty low. That's a side benefit. And they want to talk about it, but really they're talking about as long as it does this first two things, sort of the hierarchy of needs, then I'm happy for it to be green. And maybe being green is why I might do it revelate to putting a diesel gen set or a gas gen set if the price is about the same. Yeah, I would just like throw out the very simple, like, if you go back and do it, if the Tesla Roadster and Model S were ugly and slow, would they have been so successful? Right. It's got to be a delightful consumer experience or save you money, something. You got to have something. We just had the Nissan Leaf and that was sort of what introduced people to EVs. I think we'd all be driving. I had one. The first one I could buy, I test a robot here in San Francisco and I almost didn't make it back and forth to a to a science game. So I definitely had range anxiety on that one. But I'm a very special stuff like this segment sponsored by Nissan. All right, let's get to a game. We're going to play a game of over hyped under hyped or hyped just right. So I'm going to name some, this is a Goldilocks game. I'm going to name some trends, categories, surprises. By the way, there's some surprises. There may be some prizes. Okay, great. Yeah. And you guys each have to decide whether they, this thing is currently, so this is obviously your subjective determination as to how hyped it is today. But relative to your determination as to the current hype, is it currently over hyped, currently under hyped or currently hyped just right? All right. We're going to start with the topic of the year, I guess data center driven load growth, electricity, load growth, Nick over hyped under hyped, hyped just over hyped over hyped. Yeah. All right. All right. So yeah, so over hyped because there's only so much connection capacity in the system and the ability to sort of expand connection capacity is reliant on utilities who are then in turn reliant on their regulatory commissions to give them authority to build new things. And the time scales at which they operate are so designed to be slow time scales. It's not necessary that the utilities fall. I'm sure the utilities would love to put more capital to work faster, but they just are not allowed to do it by their regulator and they have to go through a ratecase. And so the idea that we have tens of gigawatts of capacity, they're somehow going to bypass these planning processes that have been in place for decades. I think as a reflection of like maybe a lack of understanding of like how utilities build things and how regulators evaluate how and when things get built. You're saying that the actual amount of new capacity we get is over hyped, right? But you're not necessarily saying that demand isn't there. You're saying we're just not going to be able to build the number. Correct. OK. Shrap over hyped under hyped. I'm going to be annoying and say it is both. And here's what I mean. I'm going to clarify. So yeah, we're just getting started. Buckle in. There's no early exit from this podcast. So over hyped in the sense that people over tribute data center load growth with electricity demand inside the United States. You know, manufacturing and EVs are are a huge portion of that. So people think it's all data centers. It's not. So that's the overhyped part. I would say under hyped in the sense that I like respectfully disagree with Nick, which is just look at Nvidia's earning calls like people are buying those chips and powering them up. So and I think companies are I spent a lot of time being incredibly creative about finding ways around getting power all across the world and figuring out how to do it. So there are well-resourced companies with lots of money, very smart engineers. Trying to figure these problems out. So I think that a lot of stuff is going to get built. All right. This is the last time you get to say overhyped and under hyped. You get one. All right. This is your mulligan. That was not in the rule book. All right. I'm going to do a quick audience poll on this. You have to you have to clap or shout with this who thinks that data center driven load growth and electricity is overhyped. Okay. Respectable showing. How about underhyped? Less people. How many people think it's hype? Just right. All right. Hype's just right. I think is a winner there surprisingly enough. Catalyst is brought to you by Energy Hub. Energy Hub helps utilities build next generation virtual power plants that unlock reliable flexibility at every level of the grid. The energy hub platform takes the guesswork at a balancing energy supply and demand. It uses machine learning to control customer own distributed energy resources like EVs, home batteries and smart thermostats to precisely shape load profiles for grid flexibility and reliability. As the industry leader, energy hub helps more than 80 utilities manage 1.6 million devices. That's more than any other edge derms on the market. Click the link in the show notes to learn more or go to energyhub.com. Catalyst is brought to you by ANSA. ANSA offers a one of a kind data and analytics platform and advisory services to support better project development and procurement decisions. For energy storage developers, ANSA's platform provides crucial information that you never had easy access to before. Now at your fingertips is real time pricing for a long list of system configurations to suit any project. ANSA provides a 360 degree view of the market with a lifecycle cost analytics and commercial technical and risk data. With ANSA, developers can easily determine which products to use in their designs, finance models and RFPs. Learn more about how ANSA helps save time and maximize profit at go.ansarunuables.com slash latitude. OK, we're going to move on to another one over hyped under hyped type. Just write nuclear fusion. Let's go fusion. Shrap, you go for a sentence one. I'm going to say it's. You said one as I just said, just one. I'm going to go with under hyped under hyped. Make your case. I think the timeframes are hard to define exactly, but the idea that you can give me 40, 100 acres of land and I can make you gigawatts of power with almost no inputs and outputs and no other exciting requirements. And I can do this like right next to a major highway and all the people around me are cool with that because it's an inherently safe thing. I think is just utterly transformational. And so I think this is a very binary thing that if we can actually hit unit economics that are competitive and fusion, it'll create the largest companies we've ever seen. Does it important and big if at the end of that sentence? So I, I, I, I, it's under hyped. I think if you say like there's a 10% chance that it actually works, but if it works, it is so massively transformational that the 10% is sort of worth the bet. Then I would say maybe I would agree with the under hyped because I, I struggle a little bit with the, again, the time scale on which these companies are going to be able to build and deliver and local communities, it may be safe, but like, I don't think local communities are necessarily going to buy into the idea that it is safe. It's going to take a while to get people to sort of be comfortable in the US in other parts of the world. Perhaps that's not as much of an issue. But if it does work, it's a total sort of game changer. Now I was having a conversation with a fusion founder a month or so ago and I was sort of saying, my biggest concern about fusion is this is really the catalyst for, you know, AI to really take over. Once you have fusion and AI, they don't need the humans anymore because they don't, we need to like to build solar panel, fair accuracy. And he's like, fair enough, we just have to tell the AI that fusion came from us. And that's why they should be treating us well for the foreseeable future. And I was kind of like, I'm just a real bank shot. Yeah. I mean, I'm just there, you know, I'm trying to like think about how do we, how do we align AI and I think like fusion being from our gift to you is that? Yeah. I don't know what your answer was to the question. So under hyped. Oh, you agree. I'm not under. You're taking points off, right? Yeah. So we're clear. OK. Oh, it's noted. OK, audience gets to vote on this one as well. Nuclear fusion over hyped. OK, fairly strong vote for a right. Nuclear fusion under hyped. Just a lot of strong opinions about nuclear fusion. I think nuclear fusion hyped just right. No one thinks that. Wow. That actually kind of makes sense to me. No one thinks that. OK. All right. Carbon removal. Carbon removal over hyped under hyped. Hyped just right. Nick, you're up first. I think it's overhyped. I think it's overhyped sort of the conversation we're having about sort of the consumer poll for big investments. Unless you can really drive down costs such a sort of meaningful point that consumers are sort of comfortable paying for it with and consumers having sort of a short term view, you know, like carbon removal is really a long term view. I need to remove carbon now so that in 10, 15, 20 years, catastrophic things don't happen. That's not how most people think. You need governments to be bought in. And I think we're in a space today where most governments are sort of pivoting away for making those investments. So I would say it's overhyped at least for the time being. Trep, I'm going to go under hyped. That was good. Concise. Oh, you want some more? Sure. I think we will be shocked at how fast low cost particularly nature based carbon removal systems. And I want to say nature based, I don't mean planning trees. I mean, advanced rock weathering. I mean, ocean alkalinity enhancement. I mean, biochar. These are systems that we can do actual real good MRV. So we know that we're actually sequestering carbon in a multi-hundred gear time frame and we'll be able to do it, you know, sub hundred dollars. And I think once you do that, you just like the market explodes. I don't think consumers give a crap. But I think governments in the long run actually do and we have plenty of places as a hundred percent economics problem. You can't pay three, four or five hundred dollars a ton. People can't afford that under a hundred a ton. You start to get to the place where you can start affording it. And so I think our ability to scale these things out is going to be way faster than people realize. I was saying one thing that for me gives me some pause about carbon removal at the highest level as a broad category is geoengineering, which like, look, if things get bad enough that we're in a situation where we're doing we should be doing gigatons a year, tens of gigatons a year. I don't know of carbon removal. We could probably do the equivalent cooling effect of geoengineering for like one one thousandth the cost. Probably now it has its own challenges, of course. But, you know, do you serve out a lot in billion a year to like lock in current, current temperatures? Right. But I mean, relative to a hundred dollar a ton, ten gigatons, we're talking what's that hundred billion dollars a year? So, you know, it's a, it's an order of magnitude, at least different. So, yeah, it's an interesting question of like, you know, it speaks to, do you believe the world's governments will get their act together fast enough to do carbon removal instead of waiting too long and needing to do geoengineering, which cheaper. Okay, audience. Carbon removal over hyped. Reasonable votes there, carbon removal under hyped. I feel like that was less people, but with stronger opinions. Which I respect, carbon removal hyped just right. Okay, not a lot of moderates in this audience, which I appreciate. Okay, we're going to do, we're going to do one more. No, we'll do two more. All right, virtual power plants. Virtual power plants. Now, this is an interesting one because I would say the hype cycle on virtual power plants has gone through a full hype cycle, certainly as of, I don't know, a decade ago, and then came back and now it's kind of back. So you have to, you have to calibrate the current level of hype around virtual power plants here before you give your answer. They're both deep in thought. All right, Nick, virtual power plants. Underhype, but I wouldn't call it a virtual power plant. I would say like flexibility as a category. I don't even know what a virtual power plant is. I talk 10 people to give you 10 sort of slightly different answers. I think load flexibility though is massively underhiped. Um, because a lot of the flexibility is free. Managing when you charge an EV is essentially free. You just go to like we at Octopus, we 50% of our customers that have EVs have signed up to allow us to manage when we charge their EV in the last 18 months. That's 250, 300,000 EVs. Because it doesn't cost the making. They just say, I plugged my car in and by six o'clock in the morning, it's 80, 90, 100% charged. I don't really care what happens between 9 p.m. and 6 a.m. And as long as the user experience to like enroll my car is easy and I get some benefit, all right, get some cheaper charging, I'll just give it to you. That's fine. Um, I actually think the hardest flexibility, uh, at least in the U.S. is, is a thermostat because you're actually asking someone to be less comfortable. But EVs, batteries, uh, water heaters, pool, like there's so many loads. That's just residential in commercial. It's the same dynamic. So I think the challenge is the consumer side is that we actually have. Build up a ton of systems within our utilities to make it really hard for consumers to actually like make the decision to make, to allow their flexibility to be accessible and to have some level of monetization. When you make it easy for the consumer, it, uh, it's going to scale. So that's my argument for being under hyped because we have some work to do to make it easy. Under hyped, Mike. Um, Nick is probably going to really disagree with me on this. So I'm going to say consumer sort of demand response is overhyped. It's just like so damn hard to get consumers to sign up for these things. It's such a fragmented market that getting to reasonable scales is hard. And I, I think, um, enterprise and commercial demand responses is sort of underhyped. There's just so much, there's big money there to be saved when you're, when I'm operating many hundred megawatt plant, like I can save a lot of money. And so it really starts to be relevant. There's also, I mean, there's so much more at those scales, whether it's aggregated from residential or commercial, it's easier to get there with commercial industrial data center, et cetera. But like, there's so much more need for it now because the grid is so constrained. But they get down to this thing of like the market mechanisms have to be there. The economics have to be there and relies upon your belief about this, the, the evolution of the electricity market and the regulatory compact. And that's always where things tend to get more complicated. I'll just say though, in Texas, uh, one gigawatt of peak load is attributable to pull pumps. These are pull pumps that don't have to run during peak periods. It doesn't affect the consumer experience of like the peeding and cooling of their pool. But it's really hard to your point. It's really hard to get them engaged. I think the, the unlock for residential flexibility is the consumer experience. I locked up, we figured out how to make it really easy. And as a result, we have built massive low costs flexibility portfolios. The challenges, you know, a lot of utilities don't have the consumer systems in place to do it. I think the one place that I'm optimistic is like, if, like large enough consumer demand is EVs, because EV charging is like a huge load source. And you can, you can integrate at the car level. So it's a lot easier. Like good luck integrating with the pool automation systems. My understanding is that the state motto of Texas is don't step on my pool pump. Um, okay. Audience virtual power plants or whatever you want to call it, load flexibility. Uh, if you prefer under hyped. All right. Strong vote over hyped. Yes, I love the one, whoever the one person is. Brave enough to hate on virtual power plants. Hype just right. Just a few. All right. A lot of lovers of, of load flexibility here. Our last one, AI for climate tech. This is applications of AI that will solve big problems in decarbonization. Trep, this is up your alley. Yeah. All right. Overhyped, gone. You should know. Um, I think that the eye look on my huge believer in AI. It's going to transform a lot of stuff. Obviously a huge believer in climate tech. I think that you always have to ask yourself a very simple question. We talk about AI for X, which is if you show me a pie chart of the most valuable parts of these problems, the most difficult parts of the problem, and then you overlay another pie chart, which like what part of this problem does AI solve? Many climate tech things fail. So AI for material science, great for discovering new materials. The manufacturing scale up is usually the hard part. It's a great. I've got this new moth. I've got to make a lot of it very cheaply. AI doesn't really help me very much with that. Like in theory, maybe I make something that's slightly easier to manufacture, but I've still got all these massive scale problems. AI for cancer therapeutics is real hard for me to find the exact right protein that will target, you know, something. But once I do the scale of manufacturing is relatively straightforward and I'm producing a very high value molecule per unit made. So I think that like it works very well there, but I'm, I think it's massively people just slapping AI on top of something without having a good explanation of why AI is like a state change in the most important part of the problem for whatever they're trying to solve. We'll put Nick. I'll go on. I'll go over hyped and I will sort of add limited comics. I think Mike covered a lot of it, but it's that I don't see AI as being uniquely suited to solving climate tech problems. These are where businesses solving business challenges, be it manufacturing or software development or discovery of molecules. So to the degree that AI is a good fit for this particular business use, irrespective of the climate use case, it's going to be helpful. And to the degree that it's not useful today for scaling up manufacturing, then it's not going to be helpful. So I don't think it's something unique to climate that AI is particularly attributable to. All right. I suspect we have some AI climate founders in the audience. So let's see what you all think. AI applied to climate tech over hyped. All right. Team Shrap under hyped. A few hyped just right. All right. I think over hyped wins it. I must say I tend to agree with that. It'll do lots of things in lots of companies and climate tech. I guess we all agree there. OK. We're done with over hyped under hyped. Hyped just right. We're going to give out some awards to finish out this conversation. The first award is the climate tech sector or the sector of whatever you want to call this, this market that we're in that stands to benefit the most from the current political environment in the United States and benefit the most from the current political environment. This is a multiple choice or you can name your own. It's a multiple choice. Options are geothermal power, nuclear power, critical minerals, carbon capture. Can you name any of those four or go off on your own? Mike, I'm going to go with C, critical minerals. Critical minerals. Why? I mean, we're embarking on trade war. China just, you know, banned the export of six major critical minerals. We make none of these in the United States. So that seems like a real big problem. Sure does. One of the challenges I think we're critical minerals. One of the challenges is critical minerals is that there's a, is that there's like a real difference in the timeline between when you can impose an import tariff or a ban on the import of something and how long it takes to actually build a new mine or refining project or whatever it might be. And so one of the risks here is like, yeah, we're going to, we're going to stop the flow of graphite from China into the US for anode materials, but like standing up a new graphite operation in the United States is going to go, it's going to run past Trump's first, second, Jesus current term. So anyway, the point being like that I think it is undeniably true that that is a cornerstone of the current geopolitical wars that are that are underway. The question is, does it actually sufficiently galvanize investment in domestic mining and refining and so on to make the difference? Yeah, the time scales here are tough, but I'm sorry Nick, but I'll let him get it too. But I do think that there, we've seen lots of companies that have very creative, fast to deploy ways to make graphite, to precision mine copper, to refine rare earths in a way that, you know, a lot of the problems with these techniques, we wouldn't actually be able to permit them in the United States. Like they're too dirty and messy. And so it's not just like you need to build exactly what they're doing there here. It's a real, real challenge. But I think the opportunity then is if you have new techniques that are both faster, easier to build and cleaner, then they might be able to run that window. It's a tight window. Yes, so I would see none of them because they all require large capital investments that require certainty. And we are in a period of massive uncertainty across the board. So I would actually say I'm fairly bearish on all of those in the near term because I think we are going to continue to see sort of a shift one way and then another way, tariffs. Oh, actually fewer tariffs. So actually tariffs interest rates, they're going to come down. Oh, they're not. Yes, they are. Yes. No, they're not. So forth and so forth. So I'm actually much more bullish on this is sort of gets the flexibility. We got to squeeze more out of what we have because we're not going to be able to attract or make big investments or get things permitted because actually we've fired all the people who work in the agency to actually do the entitlements for the land. It's not that we don't want to permit the thing at Department of Interior. There's are no people that actually go through the exercise of approving the permit. So I would say flexibility or resource efficiency squeezing more out of what we already have in the near term. I think in the long term, I think I generally agree with you because of the geopolitics. I don't remember listing Debbie downer as an option, but that's all out at this time. I would say that the that retort that I agree with your concerns that the one thing that I think we don't talk enough about is domestic sourcing from the Defense Department for critical things. I figured out that the Ukraine war is a war of drones. And if you want to have US manufactured drones with batteries and electric motors in them from US source materials, there's some departments in the government who are going to really want to do that. And I think you see some more things and energies with fission and others. So I think there's an opportunity to start building that infrastructure with a buyer who's a little bit longer term. I hope you're right. Says Debbie downer. Okay, so next award that we're going to give. I sir than I expected. Did you know we were going to be oppositional on all of these things? I planned for it. Next award. Most important least appreciated category of climate tech. What deserves more love than it gets? I'll list a few, but again, you can name your own or just shit on all of it like Nick probably will. All right, most most importantly, is to appreciate a category of climate tech energy efficiency. I guess that's what kind of you were saying on the last one resource efficiency public transit. Natural gas question mark. Forestry and land use or name your own. Trap you go. Wave power. Wave power. Most important least appreciate certainly least appreciated gone. There's a tremendous I mean, wave power is basically concentrated wind energy and there's a tremendous amount of it out there and we're harnessing very little of it. So it's probably the largest single untapped energy source on the planet. Okay. There's a zag Nick. You're also going to say wave power. I assume. I think we're sort of down right now in the US on electric vehicles. And I think, you know, we're down on Tesla because for variety of reasons. We're down on. Sometimes. I, you know, we're down on US auto OEMs ability to scale up manufacturing and I think getting to the thing that opened this conversation about just better products. Consumers wanting better products. I think electric vehicles. Ford is making, you know, mockeys that are just better to drive than the alternative Ford and Hyundai and Kia like they're just better vehicles. And I think we're sort of in sort of a down sort of view from a down cycle from a sentiment perspective for EVs. And I just think consumers are going to keep buying them. And like when you buy one, then you tell your neighbor, this is just so great. The neighbor buys it and like you have the referral cycle and suddenly like you're Norway and you have 90% of new vehicles are EVs just because they're better. And it's there's a lot of flexibility. I actually think that's what I'll say. It's suddenly your Norway is exactly what the other side is worried about happening. All right. So none of my answers resonated with anything. That's fine. That's fine. I didn't spend much time but awesome. Thank you. Thank you so much. I appreciate that. Okay. We're going to do one more craziest idea that just might work. Okay. Here's my list. But of course, come up with your own wave power. There's one. Okay. So this is just my work. Space-based solar power. A lot of these are space related I found as I was thinking about it. I don't know why that is space-based solar power data centers and I by the way, I will say every one of these has at least one and generally multiple startups doing this. So these are these are real attempts. Space-based solar power data centers in space. Deep geothermal, geothermal anywhere, let's call it drill deep enough. You get geothermal power literally anywhere. Deep sea mining of critical minerals. Asteroid mining. We're going to name your own. I'm going to name my own. I. Gee. I love all those. I just don't know very much about them. So while I'm excited, I'm going to focus on the lane that I'm in. The company I'm really excited about is a company called Water. I knew it. You texted me about this last week. So water is they put two NVIDIA GPUs on top of a water heater. And it creates heat. They suck it into the water. It heats the water. And it creates a 10x ratio of compute revenue to electricity costs. So they can actually give water heaters away for free. They monetize the compute. And it's a Bitcoin mine water heater. Yeah, but it can be for Bitcoin. Yeah, exactly. There's not for this. There's not for this. There's not for this. There's not for this. There's not for this. There's not for this. That includes as well. Everyone says that. And as a retailer, the idea that I could go to a consumer and say, I'm going to give you fixed price electricity irrespective of consumption for, say, $50 a month, as long as you install this water heater, and then we split the compute revenue. I'm kind of like, this is a real differentiator compared to, hey, I'm going to give you five bucks to let me manage your thermostat. I'm going to install a battery. I'm going to lose a bunch of money on that battery that's being installed and hopefully I'll figure out how to manufacture batteries and get my costs down. I'll go with the water heater with the Bitcoin mine there. I feel like there's some risk. If they give you two NVIDIA GPUs, you're just going to take those and resell them. That's maybe part of the strategy there. All right. This is good selection. It's a real company. You texted me there once. It's interesting. All right. My craziest idea that just might work. If I say offshore open ocean data centers, we're using my answer to the last question. Do you want me to do something different? Great. Okay. Great. That's sort of my answer. But then I'll go with the super deep geothermal. Super deep geothermal. Yeah. Okay. This was a lot of fun. Please, everyone, join me in thanking my guests, Mike and Nick for bringing you back. Nick Chasset is the CEO of Octopus Energy US. Mike Shrepper is the founder and a partner at Gigascale Capital. This shows a production of latitude media. You can head over to latitudemedia.com for links to today's topics. Latitude is supported by Prelude Ventures. Prelude backs visionaries accelerating climate innovation that will reshape the global economy for the betterment of people and planet. Learn more at PreludeVentures.com. This episode was produced by Daniel Waldorf, mixing and theme song by Sean Marquan. Steven Lacey is our executive editor. I'm Shale Khan, and this is Catalyst.",
    "release_date": "2025-05-01",
    "duration_ms": 2815000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI7666361718.mp3?updated=1746075752",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-13T01:55:29.482186"
  },
  {
    "title": "The geopolitics of rare earth elements",
    "description": "China’s new export controls on rare earth elements (REEs) are a problem for EVs, renewables, and other industries that rely on the minerals, especially the permanent magnets they’re used in. The vast majority of the global supply chain is in China. Plus, Chinese companies control supply chain operations around the world. \n\nSo is it possible to stand up a rare earth supply chain outside of China’s control?\n\nIn this episode, Shayle talks to Ahmad Ghahreman, co-founder and CEO of REE recycler Cyclic Materials. (Energy Impact Partners, where Shayle is a partner, invests in Cyclic.) They cover topics like:\n\n\nREE 101: the basket of 17 minerals, how they’re mined and processed, and the most important five\n\nWhy an REE supply chain hasn’t been built outside of China, even though the raw materials exist outside the country\n\nThe timeline of Chinese export controls leading up to the April escalation and what could come next\n\nThe specifics of what’s limited, including oxides, alloys, and magnets\n\nWhy Ahmad is optimistic about building an ex-China supply chain\n\nOther potential pathways, like recycling and designing more REEs-efficient products\n\n\nRecommended resources:\n\nThe New York Times: The Mine Is American. The Minerals Are China’s.\nThe New York Times: How China Took Over the World’s Rare Earths Industry\nAxios: China trade war risks stifling America's electric car movement\nHeatmap:  China’s Minerals Pause All Pain, No Gain for U.S\nLatitude Media: Building a supply chain for rare earth elements\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.\n\nCatalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, & increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data and tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.\n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "The podcast discusses China's dominant role in the rare earth supply chain, particularly in magnet manufacturing. China's recent export controls on rare earth elements have significant implications for global markets, especially for industries like electric vehicles and defense. The host interviews Ahmad Gariman, CEO of Cyclic Materials, a rare earth element recycling company, to delve into the geopolitical and economic impact of China's actions. China's strategic moves to control the rare earth supply chain through technology bans, nationalization, and export controls are analyzed, highlighting the challenges for countries outside of China to develop their own rare earth processing capabilities.",
    "transcript": " Latitude media, podcasts at the frontier of climate technology. I'm Shail Khan and this is Catalyst. So for 30 years, China has been building strength on the supply chain of rare earth elements and they became absolutely the dominant force in the market for manufacturing magnets. Coming up, we're talking rare earths in geopolitics. Imagine a world where connected devices like EVs, home batteries and smart thermostats work together to support a more efficient and reliable power grid. Well, you don't have to imagine it anymore. This vision is a reality today, thanks to Energy Hub. With Energy Hub's Edge Derm's platform, utilities can create virtual power plants through customer-centric flexibility programs, making it easy to manage distributed energy resources and balance the grid. Unlock grid flexibility and reliability through cross-DER management with Energy Hub, the trusted Edge Derm's leader. Visit energyhub.com to learn more. Do you want instant access to energy storage supplier pricing that's project-specific? Or the ability to compare domestically-made battery and PCS options across the market? Anza now offers the industry's first battery energy storage data and analytics platform to make better development and procurement decisions. Anza provides in-depth commercial, technical, and risk data and analytics to help developers choose the best equipment for any project. Improve your returns and save months of evaluation time with Anza. Learn more about Anza's energy storage subscriptions at go.ansarunuables.com slash latitude, or click the link in the show notes. I'm Shail Khan. I leave the Frontier Strategy and Energy Impact Partners. Welcome. All right, so we have talked about rare earth elements on this show before. And even then, we focused a fair bit on the geopolitics of their supply chain because China dominates rare earths more than basically any other area of critical minerals, which is saying something because China is pretty dominant in a bunch of areas. And that probably also explains why rare earth elements have emerged as maybe the epicenter of the current trade war between the United States and China. It's a big deal because rare earths are very, very important. Yes, for the magnets that go into the motors and electric vehicles, but also for defense and a variety of other applications too. And China has made some significant moves in the past few weeks. But I have found the media reporting on this to be severely lacking. At worst, the media sometimes doesn't seem to understand the difference between rare earth elements and other critical minerals. But even at best, they seem to understand the basket of rare earth elements, but not the nuances of the different types of rare earths and what the export controls that China has introduced actually mean. And who better to bring back than Ahmad Gariman? Ahmad is a CEO and founder of Cyclic Materials, which is building a local rare earth element recycling supply chain. I should note as well that we and energy impact partners are proud investors in cyclic materials. Regardless of that, Ahmad knows this category and this market and the supply chain for both recycled and virgin rare earth elements better than basically anybody. So let's talk through it. Here's Ahmad. Ahmad, welcome back. Thank you very much. Great to be back. All right, let's start with a bit of a, I guess a deeper version of a rare earths 101 because I think it's important. I've seen too many headlines that don't seem to catch it. Remind me what rare earths actually are rare earth elements. What are they? What are they used for? So, Shayo, I was on the program about a year ago. Lots have happened. So great to be back here. Rare earths elements. Those are the metals that sit at the bottom of periodic table. We have 17 of those on periodic table that usually when you mine for rare earths elements, they come all in one basket altogether. But only few of them are absolutely critical for us and those are rare earths elements that we use in magnets. More specifically, light rare earths such as neodymium and praisidimium and heavy ones such as dysprosium and terbium and also samarium which we use them in specific kind of magnets. Those are the magnet rare earths elements which are the most critical ones. Now, very briefly, when we use rare earths elements in magnets, we end up with the most strong magnets that we are aware of or we can produce on our planet. And when we use very strong magnets in electric motors, we end up with highest efficiency in those electric motors. That's why it's those electric motors and rare earths magnet because of the supply chain is critical for electrification and those applications. So worth noting that there's a basket of 17. They come in a basket when you extract them, at least from virgin mining. But then you have to separate them out because we actually really only care about up to five of them. In some cases, less than that. Well, I think we'll come back to those five, but that's the first nuance I wanted to make sure that we get across. Obviously what's going on in the world right now is lots of geopolitical turmoil in general, but particularly geopolitical turmoil that directly relates to rare earths. And so what I want to talk about is what's actually happening there. But before we get to what's happening today, it's been kind of a journey with rare earth elements where China, I think more so than other critical minerals in areas of critical minerals where China has done an extraordinary job of getting a stranglehold on many of those supply chains. I think it's particularly true in rare earths. So can you walk me through the history of China and its role in dominance and in the rare earth supply chain? So absolutely. So China some 30 years ago, 25 years ago, they came to the conclusion that they want to be the country that controls or processes majority of rare earths magnets in the world. So with that planning, they basically pushed forward. They started the mining operations in China. They broadened the supply chain of magnets into China. They started mining, separation, metalization, magnets manufacturing. Now availability of magnets in China helped China to bring in the balance of the supply chain, the risk of the supply chain into China. Now why this is important? Rare earth elements may be a few billion dollar market, 20, 25 billion dollar market. But rare earth magnets unlock multi trillion dollar market for companies. So with that mindset, Chinese wanted to hold the rare earth magnets supply chain in their country and they did the planning and they actually did implement that. But I will give you a few numbers here. 63% of rare earths mining happens in China. Which by the way, can I just draw a distinction there? This is one thing that I think is important to understand as a distinction from some other areas of critical minerals where China has an important role to place. So take lithium, take copper or whatever it might be. There the vast majority of the mining takes place outside China, right? In lithium, it's in Australia or South America, in copper, it's in Chile or whatever, where China has built strength in those markets is just in the refining step. So stuff gets mined elsewhere, gets sent to China, gets refined in China and then shipped out. But that is different in rare earths where China actually is the majority of the mining in addition to the refining. Correct. So they basically started with mining, they created the supply chain and then they acted like vacuum cleaner. So they go outside and bring in most of the other mined rare earth minerals and concentrates into China. That number becomes 90%. So 90% of rare earths elements now are processed and refined in China. And then they go one step ahead again and they bring in even more material to China and they manufacture 93% of magnets in China. So basically they control and hold a majority of supply chain for magnets in the world. But one thing that sometimes we don't really look into is 99% of heavy rare earths elements, more specifically terbium and dysprosium, comes from China, within China and goes into magnets. So those are not available in mines outside China. And that's really one of the challenging pieces in the supply chain of earths elements. Because when you use dysprosium, now your magnet is capable of tolerating higher temperature. And when you use that magnet in electric motor for an electric vehicle, for instance, or other applications, you do need that electric motor to be able to tolerate high temperature. And that's where heavy rare earths elements play really significant role. 99% of those metals are produced and used and implemented in products within China. So that's one of the biggest distinctions there. Is that because, you know, I guess what you're saying is that China's dominant in all of rare earth production is especially dominant, almost a complete monopoly in heavy rare earths. Is that because the resources that we've got where there are mines outside of China just don't have as much heavy rare earths? It's a geological thing or is it something else? It's a geological thing. So it happens that majority of heavy rare earths that comes in the deposits are concentrated in Chinese deposits rather than Australia or the US. For instance, MP materials in the US basically has almost no heavy rare earths in the deposit, but they have a lot of lights in the PR. Now, neodymium, crazy-dimium, NDPR are used in magnets as well to a really substantial amount, but that high temperature control thing only comes with heavy rare earths elements on magnets. Let's talk a little bit more about the geology just for a second. You know, obviously the US is finding itself in a tricky situation, or even just the US or the rest of the world, but particularly the US because we're in such a tense geopolitical moment with China and rare earths are, you know, I think China has correctly identified an area of significant leverage because they've got such a stranglehold in that market. In the interest of standing up a supply chain outside of China, one way to do it, of course, is what you're doing. It's like look materials, which is to make sure that we're actually recycling rare earths, which we generally don't do. But aside from that, if we want to stand up a virgin supply chain, do we have the geology? Do we have the resources to do so in the West? Or would it be difficult just because there aren't sufficient resources? So there are resources that carries heavy rare earths elements. We just simply haven't advanced those projects significantly just yet. And the key reason for that is because the supply chain is heavily tied up to China, it just makes sense to make the rare earths elements to be processed within China and used in China. And the market price for rare earths elements often is artificially controlled by Chinese government. So makes the projects, mining projects outside China less attractive time to time. And those levers that China has basically helps them to have better control on the market as we go through. But some of the deposits in, let's say, Brazil and other countries do carry a good amount of heavy rare earths elements, but none of those deposits are being mined today. Okay, so it's one thing for China to have built up this dominant market position, but it's another thing for China to start exerting that leverage in a geopolitical context and making it difficult for other countries to compete with production of whatever you need to produce using permanent magnets. So we obviously have some recent announcements in the past few weeks, but I don't think that's the first of it. China has been using rare earths as leverage for some number of years. Oh, that's absolutely true. So, and I've been very vocal about this, that this day is coming. And I don't have a crystal ball, I just connect the dots really. So for 30 years, China has been building strength on the supply chain of earths elements. And they became absolutely the dominant force in the market for manufacturing magnets. Now, back in December of 2023, they enforced ban on the export of equipment and technology related to rare earths elements. So this was really a significant event happening back in December of 2023. I don't think it got enough attention in this space. To clarify what that means, that is not a ban on the export of rare earth elements or magnets for that matter. That is a ban on the export of technology to refine rare earth elements, right? So in the value chain of mining, separation, metalization, magnet production, it's those middle two steps, is that right? And also magnet manufacturing, correct. So that was the ban on two things, export of technology and equipment related to processing of rare earth elements, as well as making magnets. So that happened in 2023. Do we know, is that technology, is whatever technology China has developed, whatever process is, as opposed to China has developed for separation, metalization, magnet production, are they so distinct and so much better because they've been so dominant that it would be difficult to replicate outside China? Or if not replicate, then develop our own process technology? I believe we can develop our own technology outside China, but those technologies readily available in China are not for free for other part of the world to be, to be bought and imported to those countries anymore. So we can't really rely on those Chinese technologies anymore and we can't have them. And for instance, in the US, in fact, I am aware of companies that they really relied on those Chinese technologies and now they are having challenges with bringing those equipment into the US and Europe. So their projects have been suffering from that. So one thing that happens in mining, sorry, I'm processing and magnet manufacturing side is those industries are heavily dependent on IPs, patents on how to make, for instance, very strong magnets, very efficient magnets with minimum consumption of heavy rarer sentiments. And Chinese magnet manufacturers in the past many years have been investing a lot of dollars on that. And now they own a good portfolio of patents and IPs that helps them to basically quarter the market on how to make those magnets within the borders of China and not export the technology outside. So, Catalyst is brought to you by Energy Hub. Energy Hub helps utilities build next generation virtual power plants that unlock reliable flexibility at every level of the grid. The Energy Hub platform takes the guesswork at a balancing energy supply and demand. It uses machine learning to control customer own distributed energy resources, like EVs, home batteries and smart thermostats, to precisely shape load profiles for grid flexibility and reliability. As the industry leader, Energy Hub helps more than 80 utilities manage 1.6 million devices that's more than any other edge derms on the market. Click the link in the show notes to learn more or go to energyhub.com. Catalyst is brought to you by ANSA. ANSA offers a one-of-a-kind data analytics platform and advisory services to support better project development and procurement decisions. For energy storage developers, ANSA's platform provides crucial information that you never had easy access to before. Now at your fingertips is real-time pricing for a long list of system configurations to suit any project. ANSA provides a 360-degree view of the market with lifecycle cost analytics and commercial technical and risk data. With ANSA, developers can easily determine which products to use in their designs, finance models and RFPs. Learn more about how ANSA helps save time and maximize profit at go.ansarunuables.com. latitude. Okay, so 2023, China says we're banning export of both technology and equipment for refining and magnet production. So that basically says, you know, either you need to do, if you're outside China and you're trying to develop that part of the supply chain, everything past mining, you need to come up with your own process and equipment, and that is going to be harder than leveraging what's existed in China for 30 years. So that's the first sell though, but not the last one. Oh, not the last one. So then comes summer of last year. China basically nationalized various industries within the borders of China. What does that mean? It consolidated the companies. It made fewer companies to have better control on the supply chain. And every single step in the process was controlled by the government from pricing of her settlements all the way to products and what happens to products. China has been controlling how much of those rare earth settlements they were exporting since 10, 15 years ago. So that was a new thing, but consolidating those companies and having more power on them was a new development. And then the last step was taken only three weeks ago when they implemented export control on rare earth settlements. Just to be clear, the export control actually does apply to a few different variety of materials and products. Those would be rare earth oxides, which is basically the raw materials or ingredients that you would need for your magnets manufacturing outside China. Just to be clear, that comes post separation. Correct. Right? Yeah. So you do mining, you do separation, then you get your rare earth oxides. And so that basically that export control says we're going to make it very difficult for you to produce magnets outside China. 100%. Yes. And the next step was the next item on the list is the metal. So you take the oxides and you make the metal that is pretty much the same composition or chemistry as your magnet composition. And that metals export also is now controlled. And the third one is basically heavy rare earth elements. We use them in different applications, but any alloy or metal that has heavy rare earth elements probably will be heavily controlled for export. And the last piece is magnets. And I can tell you why magnets have immediate impact on some companies versus metals and oxides because a lot of companies in Detroit in other jurisdictions relied on those supply of magnets every day. To put those into electric motors and make their EVs, make their e-bikes, e-scooters and many other products. And now those magnets shipment to other countries in Europe, in the US, are significantly delayed. And that's what causes a lot of stress out there in the market today. So just to repeat, as we said before, there's four steps in the value chain, the high level, right? There's mining, separation, metalization, magnet production. And what China did three weeks ago is instituted export controls on all four steps. Effectively. Basically, yes. What do we know about what export controls means, right? It could be nothing and it could be a strangle. It's going to be really a step that China is going to use it. So usually when I want to explain this, I say, when you create a process for something, it's only with the intention that you want to do that thing. So process makes it easier for you to have a control on it. Now, China has been signaling that rare earth elements are absolutely important for them. They want to maintain their dominance and they are not shy to utilize their dominance in the market whenever they need to enforce something. Now, they control the export of, or band export of technology and equipment. So the world is really connected and in need of the magnets that come from China, then they nationalize the companies. So now they have better control on the products that are being exported from China. And the last step is export control. This is where there is a specific paperwork needed for every batch of exported material from China that contains any of those rare earth elements that you have to do the paperwork. My understanding and my conversations with companies, different companies in this space is that it's been two months now that companies are waiting for some of those export control documentations to be implemented. And it's communicated with them that they should wait for a few more months of work before the export control process is fully in place for Chinese government to see which of those materials end up in the market. And who's the end buyer of the products? So as of today, it's more uncertainty than anything else. Like the flow of magnets and earlier steps in the value chain, the flow has continued unabated to date, but the expectation is that these export controls will take hold at some point in the next few months and then it's sort of uncertain exactly how problematic that's going to be. Fair to say it's a bit more than that. So today the shipment of the magnets is really disrupted. It's not being shipped today. Magnets, oxides, metals, all of them, all the above are delayed in shipments. But one critical signal here, two things I will point out here. The first one is the emphasize on heavy rare earth elements. China knows 99% of those heavy rare earth elements come from China and any alloy or magnet material that has heavy rare earth elements in them have been singled out in those documentations. And again, those are the stronger, the magnets to be used in stronger motors. That's the short way to think about it. Or the heavy duty or higher performance electric motors. For instance, electric motor of EVs because when those cars drive at say, 70, 80 miles an hour, the electric motor heats up a little bit and those heavy rare earth elements makes them capable of tolerating higher temperature in the electric motor. So basically, singling out heavy rare earth elements in the export is unique. So they are not shy of using their power that they control 99% of those metals. And my strong belief is the process for export control will be utilized a bit more in the future. And this will basically signal again that China is not really reliable on sourcing of earth magnets in the future as we go forward because they will use it as a tool to change behavior outside China. Okay, so obviously it would be in our collective best interest to have a rare supply chain that is not entirely reliant on China as it is today effectively. And lots of folks are thinking about that. I'm curious your perspective on how hard that's going to be and how long it's going to take for us to build it out. And when I say us, I guess I mean the West in general, but maybe you could tell me specifically North America or the US. So I'm an optimistic person. So I will give you an optimistic perspective. 63% of mining for rare earth is happening in China. That immediately tells you 37% is happening outside China. So realistically, we do have the raw material outside China to process and produce magnets. It won't happen within 24 hours. But if we really wanted to happen and we spend money on it, it will eventually happen. Now, a few strong steps have been taken in the past couple of years or so, three years or so. So, for instance, magnet manufacturing companies are building up capacity in the US and within Europe. Vacuum Ischmittes is building a large magnet manufacturing facility in South Carolina and P materials and takes us and few other companies are building capacity. On separation of earth's elements, there are a few projects. Just last week, our own partners always started their plant in France again to separate earth's elements. And the line is an Australian company is building capacity and takes us, I believe. So there are pieces and parts happening in different states or countries. So, I'm optimistic that eventually because the feedstock is available to get extended outside China and also that supply chain is building up in other countries. So we likely will have access to magnets and rare earth's elements in the future. But one large piece of supply chain will always be circularity and recycling of end-of-life products. What I mean by that is that in the past 10, 20 years, we have imported products into US, Europe, other countries that do carry magnets in them, do have magnets in them. And with that, we have actually built the largest overground deposit of rare earth's elements in our countries. And it just happens that we don't recycle those, we don't use those, we don't mind those urban mining operations, basically. And the beauty of those end-of-life products is because those were produced 10, 15 years ago, they do carry quite a bit of heavy rare earth's elements. 10 years ago, we were a bit more generous in using those heavy rare earth elements in the products we manufactured then. And because of their costs and availability, the engineering departments work very hard on cutting the consumption of those rare earth's elements, reducing the consumption of those heavy rare earth's elements. We do still consume a little bit, but much less than what we use to consume in, say, 2000s. And those products are available for recycling, so that's our immediate source of rare earth's elements in the market with heavy in it. Yeah, you basically have at least two benefits if you're recycling rather than virgin. One is that the initial separation already occurred before the initial magnet was produced. That separation of just the rare earth elements that are actually valuable out of the basket of 17, that already occurred. You're taking something where that separation has already been done. And then the second, as you said, is that you might actually get something that is heavier in rare earth, sorry, that is heavier in heavy rare earth, I should say, than the equivalent product would be today if it were produced, meaning you're getting a higher proportion of the stuff that is most challenging to develop outside China. So you have kind of a double whammy of a benefit if you can actually recycle. Agreed. So the product we produced today and shipped to our customer makes rare earth's oxide that we produce actually does have only five rare earth's elements in it. Rather than 17 that usually comes from mining industry. That makes the creation of those rare earth's elements much, much simpler than what it is from mining industry. And yes, our heavy rare earth's elements oftentimes is closer to 10% of our product, which is, I'm going to say, really unique and one of the highest quality rare earth's elements out there in the market in respect to heavy rare earth's elements. All right, so I guess final question for you is, is there another level of escalation that we could see here? You mentioned that there's been sort of increasing escalations from 2023, then 2024, then this year. Things don't seem to be calming down between the US and China at the moment. I'm not one to predict the future, but let's assume things generally escalate and China continues to want to use the leverage it's gotten in rare earth's. You could imagine a full export ban, I suppose, which would, I imagine, you know, short of those who can use the, to the extent that we have a tiny, tiny bit of X, China, midstream industry. You'd imagine that freezing a bunch of supply chains basically overnight. Is that like the next level of escalation that you could imagine here? Well, shale, unfortunately, I believe it is. So this is not going to be a new thing in our critical minerals space overall. For instance, germanium, gallium exports a few years ago, a couple of years ago, were banned, and those are another level of critical metals that we need in different applications in the western countries. Now, various elements, my understanding and my belief is the next. So the whole process of putting export control and creating the capability to control the export of these metals and alloys, basically is the tool that the government of China will need to implement that if and when they want to. We'll add that the relationship between US and China are not the warmest that has been in the past years. So my expectation is China will be more willing to use this tool in the future if they wanted to, to basically enforce the control that they have on the broader market. All right, Ahmad, informative as always, somewhat terrifying. I want you to get up to scale as fast as humanly possible. So get back to it. Absolutely, Shay. We are working the fastest weekend. In fact, I will tell you in past three weeks, we have spoken to more car companies than others. Then we have spoken, we had spoken in past one and a half years or so. So things are really going fast and we are also scaling up pretty fast in the next couple of years. Ahmad Garaman is the CEO and co-founder of Sick Click Materials. This shows a production of Latitude Media. You can head over LatitudeMedia.com for links to today's topics. Latitude is supported by Prelude Ventures. Prelude Backs Visionaries, Accelerating Climate Innovation that will reshape the global economy for the betterment of people and planet. Learn more at PrayLoudVentures.com. This episode was produced by Daniel Waldorf, Mixing and Theme Song by Sean Marquand. Stephen Lacey is our executive editor. I'm Shayl Khan, and this is Catalyst.",
    "release_date": "2025-04-24",
    "duration_ms": 2064000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI1312009216.mp3?updated=1745478650",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-13T01:58:53.892908"
  },
  {
    "title": "What’s next for the battery storage boom? [partner content]",
    "description": "The U.S. storage market is experiencing hockey-stick growth, with multiple gigawatts being installed quarterly. But new policy uncertainties around tariffs and the Inflation Reduction Act are threatening this momentum.\n\nBut Jeff Waters, the CEO of Powin, remains optimistic.\n\n\"This industry will figure out a way to work with it,\" says Waters, who brings decades of experience from the semiconductor and solar industries. \"What we're doing is important.\"\n\nPowin is a leading storage integrator that designs, commissions, and services some of the largest utility-scale batteries in the world. As Waters puts it, \"If you are a utility or if you are an IPP, if you want to integrate storage and own and operate a storage asset, we are that one throat to choke.\"\n\nIn this episode, produced in partnership with Powin, Stephen Lacey talks with Jeff about why he's still optimistic about the market despite significant headwinds. Drawing from his experience in semiconductors, Waters makes a case for how America should approach domestic battery manufacturing.\n\n\"When I hear people talk about storage and say, 'We don't want Chinese companies investing or getting taxpayer money to build plants,' I think it's a ridiculous notion,\" Waters explains. \"The only way we're going to get anywhere in the U.S. market with storage is by partnering with the Chinese.\"\n\nThey discuss the extraordinary scaling of project sizes, the surge in electricity demand from data centers, technology trends beyond lithium-iron phosphate batteries, diverse deployment models, regional market opportunities, and the remarkable resilience of an industry used to navigating policy volatility.\n\nThis is a partner episode, brought to you by Powin. Powin is pushing the frontiers of energy storage. To learn more about Powin's integrated energy storage systems and to read case studies of how the company is executing projects, go to powin.com.",
    "summary": "Jeff Waters, CEO of Powin, discusses the evolution of the semiconductor industry, drawing parallels to the current state of the energy storage market. He emphasizes the need for the US to adopt strategies similar to those used by countries like Japan and China to strengthen its position in the battery storage supply chain. With insights on market growth, project sizing, deployment models, attractive markets, pricing trends, and policy challenges, Waters underscores the industry's resilience amid uncertainty and the importance of stable policies for sustainable growth. Looking ahead, he anticipates larger utility scale battery projects, advancements in technology like sodium batteries, and increased focus on cybersecurity.",
    "transcript": " This is a branded podcast from Latitude Studios. Jeff Waters started his career in the semiconductor industry in the late 1980s, right when the industry was going through a major shift. You know, at the time, the US was the dominant player in semis. The Japanese, however, were making significant gains. Japan was a dominant force in consumer electronics, but it wanted to control the entire supply chain. And that meant bringing semiconductor manufacturing to the country. And they went to the semiconductor companies and said, if you want to sell them to our market, we're going to tear up your up. Or if you come and enjoy, set up JVs with Japanese companies and do production here within Japan, we'll give you better access and entry into the market. The policy had many dimensions, tariffs, incentives for manufacturers, and university programs to build a skilled workforce. They created no infrastructure to build up a wealth of knowledge of semiconductors. And within about a decade's time, you now saw Japan as a player in semis. Later you saw Taiwan do the same approach, you saw Korea do a similar type of approach, and you're seeing China do the same kind of thing. Later, Jeff went to work in solar manufacturing. Today, he's the CEO of Paoin, a leading energy storage integrator. And after seeing the centers of power for semiconductor shift, he watched China execute the exact same playbook for solar and batteries. And as he told Stephen Lacey, America needs to learn from it. What does that tell you about what we need to do today to own in America more of the battery storage supply chain? When I hear people talk about storage and say, well, you know, we don't want, you know, Chinese companies investing or getting tax payer money to build plants, I think it's a ridiculous notion. The only way we're going to get anywhere in the US market with storage is by partnering with the Chinese. It can be with their technology, licensing the technology. It can be helping them build plants within the United States. And not just that. I think we need to do the other pieces to the puzzle, right? The other parts of the playbook get universities investing into creating students that will have that kind of capability, allowing employees to come in from overseas to help train us up on how to get it done and all the equipment that goes along with it. If you do that and you partner it up with building the infrastructure like the Japanese did for semis, you can result, you know, in five to 10 years from now with the US having that same capability. Let's piggyback on what's been done and make the US a strong player within storage. In the last five years, the storage market has seen hockey stick growth. In the US, batteries were the second biggest source of new capacity on the grid last year. But uncertainty around domestic incentives and tariffs is challenging growth. And they are conflicting views on how best to support manufacturing. In this episode, producing partnership with Powin, Stephen Lacey talks with Jeff Waters, the CEO of Powin, about the state of the US storage market. He explains why he's still optimistic, even with policy headwinds. Nearly two years ago, Jeff took the helm at Powin, a leading storage integrator that designs commissions and services some of the biggest utility scale batteries in the world. So the way we like to think about it is if you are a utility or if you're an IPP, if you want to integrate storage and own and operate a storage asset, we are that one throw to choke. After decades in semiconductors and solar, Jeff turned his attention to batteries. I saw storage as a good place for the US, for my home country, to kind of reestablish itself and create an important technology that would help with renewables, but also grid stability. Jeff has a unique view of the battery storage market, which is seeing immense growth and also emerging uncertainty in the US. He recently sat down with Stephen Lacey to take stock of the market. They talked about project sizing, technology trends, policy shifts, and why batteries are so critical for meeting surging electricity demand. The US storage market is booming. Right now on a quarterly basis, we're seeing multiple gigawatts installed. Just in Q2 of last year, we saw a 74% increase in deployments. So if you look at the different factors that are driving this acceleration, what stands out to you? Yeah, I would say it all kind of gets back to electrification. I think that drove the big boom. Going back, let's say four or five years ago, now what you see is data centers. And with the strong surge in data centers, and Michigan is a good example of that, but you're seeing it in Virginia and all across the country, just the amount of demand that's putting on the grid is just really upping the stakes on growth. And that's why you're seeing even the projections for 5% year growth for power demand in the US. And that's why we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it in the US, and we're seeing it there in the US, and you know, we won't see the simmering economy the 90%. These are honey nights, a couple of months, out of the city have episodes of technology that you'll zombies 30 cents have the 500 cups. So having access to infrastructure and that is how you're seeing it. And for example, forhiste you don't even seeShe is still going to master very beautiful waste, and the reason is that I try to try to put that in my website I Hey Ska Carlton to help reduce their costs and help meet the demand. Virginia is 10 gigawatt by 2045. Michigan has their 2.5 gigawatts by 2030. It's expected just to give you a broad number. By 2033, the market is projected in the US to hit about 170 gigawatts of storage. You can look at it as something that is kind of a hot trend that people are talking about today, but there's really a long-term need for this. Given the flexibility, given the small footprint, given the fact that the technology is here, and then on top of it that there's been such a, I would say a large supply chain around it that you've seen costs come down very significantly as well. Let's talk about sizing and deployment models. You and I talked previously and you said around 18 months ago, your average project size was in the 100 to 300 megawatt hour range, and then 300 megawatt hours became the average. Now you're seeing projects well over 500 megawatt hours. What is behind this astonishing scaling of project sizes? Yeah, I think part of it is cost. So the cost for LFP batteries have come down nearly 50% over the course of the last year or two. That contributes, makes the economics easier. The other is just the interconnection piece. When you have an interconnection, you want to capitalize on it as much as you can, and that's one of the other reasons why I think we're seeing people saying, hey, given the value of that interconnect, if it's already permitted ready to go, let's maximize the full extent that we can. And then I think it's also just the demand. Seeing that surge, seeing the off takers, expressing the need for even more demand, and maybe what was even originally cited when they first sat down and had the conversations on putting in storage, all that's contributing. When we see a 500 megawatt hour project now, it is by far the rarity. I mean, typically now we're seeing one gigawatt hour, two gigawatt hour projects. What about actual deployment models? There are three different categories. You've got market trading, you have co-location with renewables, and then you've got standalone storage that harness existing grid connections. Which of these applications dominates, power and deployment, and what's growing the fastest right now? You know, if you'd asked me this question maybe two years ago, we probably would have said that the standalone storage for trading was probably one of the biggest growth areas that we saw. I think now it's really around co-located storage. Given all the renewables that you have out there, even in the state of Michigan, how do you really monetize them in the best way that you can and help serve the grid? Standalone is still, I would say, something that we're seeing, and it really gets to situations where you've got grids that are maybe imbalanced. And so I would say we still see a fair amount of growth there. The market trading piece has softened a little bit, just because those markets have been reasonably saturated, both in Iracott and Kaiso. But right now I would say it's really the co-located piece. I want to get your thoughts on where the most attractive markets are. So California, Arizona, Texas, those are really hot markets. What kind of activity do you see there? And beyond the established markets, do you see anything emerging for upcoming significant growth? Yeah, I would say just generically speaking, you're looking at markets that have high renewable penetration, ones that have strong mandates around retiring fossil assets, and more broadly, just aggressive clean energy mandates. And that's where you're going to see most of the growth. And right now I would say New York, PJM, MISO, those are all regions where we expect to see a lot more growth than we've seen historically. You know, I would say the traditional markets are still going to keep growing. I mean, California will still keep cranking along. It's at, you know, whatever it is, 19. I think the target right now for them is 19 gigawatts by 2035. But I would say the where you're going to see more of the growth are relative to what you've seen historically will be New York, PJM, MISO. So battery system prices have continued to decline. Over the last year, we've seen them decline by about a third. Where do you see battery pricing headed and balance of systems pricing headed? Well, I'd say let's set aside tariffs for a moment. I think if you just look at battery pricing, I think for as much as the costs of LFPs have come down, I think, you know, people are thinking that there's going to be a bit of a saturation on it. Kind of from what we're hearing from the supply chain is if you go out over the next couple of years, there's a decent likelihood we'll continue to see pricing go down. You know, I've heard some claims that you could see it go down as far as, you know, from $50 down to even $25 over the course of the next couple of years. I think it's realistic to think about that. I mean, the supply chains for LFPs have been largely within China. You're seeing that now spread more broadly. So Indonesia, Morocco, or all areas now, where you're seeing a lot more investment going into it. So you see an expansion of the supply chain. I think for the rest of the balance of system, you know, I would expect that to track as well. Having lived through solar, you know, we continue to hit points in solar where we thought, you know, between panels and everything that goes into panels that you would hit some kind of a saturation point. You know, the reality of it, it keeps grinding down. I mean, I just even what's happened in the last two years with solar astounds me. Given the volume that you're going to have with storage, the attractiveness of the growth, a lot of money is going to flow into that and people investing in a way where profit margin isn't going to be the priority. It's going to be more around growth. You mentioned tariffs and I want to talk about tariffs. How will those impact the battery supply chain specifically? How much heartburn are you getting from the prospect of tariffs? And what else is giving you heartburn right now in the market? Yeah, I would say within the US market, we're a global player. So we, you know, we do a lot in Australia. We do a lot in Europe and increasingly Southeast Asia. But when you look at the US market, it has been rough. I mean, it's been rough for about the last year. I think as soon as there was anticipation about the upcoming election and the impact that that could have on tariffs and also on the IRA, it has really put things into a bit of a state of suspended animation. You know, right now I was at a show a couple of weeks ago, solar and wind show and we're talking with various developers. And you're hearing that right now, it's effectively the market is waiting to see what happens once we get through reconciliation. I think people are thinking that could be as late as Q3, Q4 of this year. They're waiting for tariffs to stabilize. And effectively what's happening now is you're seeing a bit of a push from off takers to try and push more of the tariff risk onto developers and developers trying to push it more onto, you know, guys like us, like the integrators and the cell suppliers. And the challenge is that the risk is just far too high for anybody to take on. And that's why you see the delays. But regardless, you do have a number of utilities that need to build out. They're really going to hit a point where they're not going to have much of a choice. And so then what you'll see is anything around tariffs or IRA incentives getting cut will likely get passed on to the rate pairs. That's my best guess from what I'm seeing. One thing that we have learned over the decades is that the renewables industry and now the battery storage industry, the energy storage development sector is very resilient. This has been an industry that has been characterized by stocks and starts and policies. It really extreme volatility. What does that tell you about the industry's ability to get through this really uncertain moment? And what kind of policy consistency would you like to see? Well, I think resilience is the key word. It's a word I use all the time, you know, going back to when I first started in solar. And almost, to be honest, it almost doesn't matter what the clarity is. If it's higher tariffs than we currently have, if it's a reduction in the IRA incentives, this industry will figure out a way to work with it. Right? They'll come up with a balance of kind of cost sharing and other mitigating actions to help keep things rolling forward. What's hard is when you don't know if things are going to change. And then when it comes to the IRA, whatever you're going to have around domestic content incentives, whatever you're going to have around the tax credits and the incentives that drive that, let's just get them stabilized and we'll roll forward from there. It is an industry that knows how to deal with this. What we're doing is important. And it's not just important anymore from an ecological perspective. It still is, but it's not just that anymore. It's really how do we create the right energy portfolio in the US to help us be successful? Storage in particular is a critical part of that. Okay. So in 18 months, a leading integrator like Powen is going from 100 to 300 megawatt hour projects now to 500 megawatt hour projects. If we look out in the coming years, what do you think the typical utility scale battery storage project is going to look like in terms of size, duration, use case? Yeah, I think you're going to see them continue to grow in size. I would expect if we were to even talk two years from now, I think two gigawatt hours will probably be the size of projects that will be more than median than even maybe 800 megawatt hour that you have today. LFP will, I think, remain dominant in that time frame just because you're going to see the cost curves continue to drive down. What you are going to see, though, I think more, is more of a push toward long duration. You know, in some ways, LFPs can, there's a crossover point where LFPs are probably not going to be as cost effective as other technologies. I think that'll get extended because you'll see margins start to drop in a way that people will keep pushing just to try and keep taking advantage of factories that have been created. But you will start to see more eight hour, 12 hour type applications emerging. And I think as that happens, you'll see other technologies kick into gear that will enable that better than LFP. I think where that sits right now, it's a bit tough to say. The other one I would talk about is sodium. You know, sodium is, it has the promise of being very, very safe, you know, in that you don't have a lot of the same issues that you do with lithium ion batteries. I think it remains to be seen if it'll ever hit the cost points that will allow it to be adopted. And I think as well, the other challenge you have with sodium is that the safety around LFPs just continues to get better and better. So as that becomes less of an issue, I think sodium has a little bit of a steeper hill to climb there. But it's something we still track. We think still think there's a lot of promise and depending on the application, we think it's something that will have some potential out there. The last piece I would just throw in is I think you're going to see a heightened sensitivity around cybersecurity. It's something we're putting a lot of juice into as a company. You know, we do have systems that have electronics and computing and communications that reach into the grid. So it does create access points for bad actors. Our utility customers talk about the thousands and thousands of intrusions and attempts they have at the grid to try and shut pieces of it down. I think that's something that's going to be a significant push, especially when you look to two to three years from now in storage. So we could see 75 gigawatts or more deployed in the US, battery storage deployed in the US through 2028. If you look at what could happen between now and then, what are you worried about and what do you think is going to accelerate the industry? You know, we talked about the resilience before, I think in the industry, I think you always have to expect that every probably five or six years, you have two really bad years, and it usually goes back to something around with the exception of COVID. It usually goes back to something around policy. So I would say if everything, you know, the things that keep you awake at night are the things that you have a hard time controlling. So I would say policy continues to be just the challenge and how do you make yourself as nimble as you can to handle, you know, like changes in the IRA or changes in tariffs or in domestic content policies, supply chains, you know, if we do have a shutdown coming out of China, are we able to pivot to other supply chains to keep things rolling? That I think is the only thing that's going to stay in the way of storage getting adopted. And I think the numbers that, you know, we've been citing, I think those are conservative. I think they factor in a lot of these artificial barriers that could come up, remove those, and I think storage will be pervasive. Jeff Waters, CEO of Power and what a great tour of the utility scale battery storage industry. Thank you so much. Well, thank you, Steve, and I really appreciate the time. This episode was produced in partnership with Poughan. Poughan is pushing the frontiers of energy storage. To learn more about Poughan's integrated energy storage systems and to read case studies of how the company is executing projects, go to Poughan.com.",
    "release_date": "2025-04-23",
    "duration_ms": 1204000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI3970287601.mp3?updated=1745365193",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-13T02:01:31.698411"
  }
]