[
  {
    "title": "Catalyst Live at SF Climate Week",
    "description": "It’s a Catalyst first-of-a-kind: our very first live event! We hosted it last Wednesday at San Francisco Climate week. In this episode, Shayle talks to Mike Schroepfer, co-founder and partner at Gigascale Capital and former CTO of Meta, and Nick Chaset, CEO of Octopus Energy US. Together they cover:      Lessons on building products that consumers love        Over and under hyped trends, including data center load growth, carbon removal, and fusion       What areas will benefit most from the current administration       The most important, least appreciated category of climate tech       The craziest idea that just might work     Recommended resources:      Catalyst: A skeptic’s take on AI electricity load growth       Catalyst: The geopolitics of rare earth elements     Credits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.  This special Catalyst Live was sponsored by JP Morgan Chase and DLA Piper.  Catalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, & increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data and tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.  Catalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "It’s a Catalyst first-of-a-kind: our very first live event! We hosted it last Wednesday at San Francisco Climate week. Catalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid.",
    "release_date": "2025-05-01",
    "duration_ms": 2701871,
    "url": "https://open.spotify.com/episode/54DoPGiuimgtgb4rFwi6XO",
    "source": "The Energy Gang Podcast",
    "timestamp": "2025-05-03T21:28:00.445039"
  },
  {
    "title": "The geopolitics of rare earth elements",
    "description": "China’s new export controls on rare earth elements (REEs) are a problem for EVs, renewables, and other industries that rely on the minerals, especially the permanent magnets they’re used in. The vast majority of the global supply chain is in China. Plus, Chinese companies control supply chain operations around the world.   So is it possible to stand up a rare earth supply chain outside of China’s control?  In this episode, Shayle talks to Ahmad Ghahreman, co-founder and CEO of REE recycler Cyclic Materials. (Energy Impact Partners, where Shayle is a partner, invests in Cyclic.) They cover topics like:   REE 101: the basket of 17 minerals, how they’re mined and processed, and the most important five  Why an REE supply chain hasn’t been built outside of China, even though the raw materials exist outside the country  The timeline of Chinese export controls leading up to the April escalation and what could come next  The specifics of what’s limited, including oxides, alloys, and magnets  Why Ahmad is optimistic about building an ex-China supply chain  Other potential pathways, like recycling and designing more REEs-efficient products   Recommended resources:  The New York Times: The Mine Is American. The Minerals Are China’s. The New York Times: How China Took Over the World’s Rare Earths Industry Axios: China trade war risks stifling America's electric car movement Heatmap:  China’s Minerals Pause All Pain, No Gain for U.S Latitude Media: Building a supply chain for rare earth elements  Credits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.  Catalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, & increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data and tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.  Catalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "The vast majority of the global supply chain is in China. Plus, Chinese companies control supply chain operations around the world. So is it possible to stand up a rare earth supply chain outside of China’s control? The Minerals Are China’s.",
    "release_date": "2025-04-24",
    "duration_ms": 1950458,
    "url": "https://open.spotify.com/episode/78QoXmBKABeMlB6Gp1JHDJ",
    "source": "The Energy Gang Podcast",
    "timestamp": "2025-05-03T21:28:00.449669"
  },
  {
    "title": "What’s next for the battery storage boom? [partner content]",
    "description": "The U.S. storage market is experiencing hockey-stick growth, with multiple gigawatts being installed quarterly. But new policy uncertainties around tariffs and the Inflation Reduction Act are threatening this momentum.  But Jeff Waters, the CEO of Powin, remains optimistic.  \"This industry will figure out a way to work with it,\" says Waters, who brings decades of experience from the semiconductor and solar industries. \"What we're doing is important.\"  Powin is a leading storage integrator that designs, commissions, and services some of the largest utility-scale batteries in the world. As Waters puts it, \"If you are a utility or if you are an IPP, if you want to integrate storage and own and operate a storage asset, we are that one throat to choke.\"  In this episode, produced in partnership with Powin, Stephen Lacey talks with Jeff about why he's still optimistic about the market despite significant headwinds. Drawing from his experience in semiconductors, Waters makes a case for how America should approach domestic battery manufacturing.  \"When I hear people talk about storage and say, 'We don't want Chinese companies investing or getting taxpayer money to build plants,' I think it's a ridiculous notion,\" Waters explains. \"The only way we're going to get anywhere in the U.S. market with storage is by partnering with the Chinese.\"  They discuss the extraordinary scaling of project sizes, the surge in electricity demand from data centers, technology trends beyond lithium-iron phosphate batteries, diverse deployment models, regional market opportunities, and the remarkable resilience of an industry used to navigating policy volatility.  This is a partner episode, brought to you by Powin. Powin is pushing the frontiers of energy storage. To learn more about Powin's integrated energy storage systems and to read case studies of how the company is executing projects, go to powin.com.",
    "summary": "The U.S. storage market is experiencing hockey-stick growth, with multiple gigawatts being installed quarterly. \"The only way we're going to get anywhere in the U.S. market with storage is by partnering with the Chinese.\" Powin is pushing the frontiers of energy storage. To learn more about Powin's integrated energy storage systems and to read case studies of how the company is executing projects, go to powin.com.",
    "release_date": "2025-04-23",
    "duration_ms": 1204558,
    "url": "https://open.spotify.com/episode/62iwX71Qmkb17jF19vt7eb",
    "source": "The Energy Gang Podcast",
    "timestamp": "2025-05-03T21:28:00.453506"
  },
  {
    "title": "Serving data center load with carbon capture",
    "description": "Big tech’s data center construction boom is fueling a flurry of natural gas development, despite the fuel’s challenges, and it’s complicating big tech’s climate goals. But carbon capture and storage (CCS) could mitigate emissions from those new plants, and hyperscalers could secure low-carbon power while meeting their needs for speed and reliability.     So how could natural gas with CCS serve data center loads?    In this episode, Shayle talks to Julio Friedmann, chief scientist at Carbon Direct, who recently co-authored a couple pieces on the topic. Despite recent high profile cancellations of natural gas projects, Julio makes the case that gas-plus-CCS has attractive advantages, provided the carbon capture actually happens. Shayle and Julio cover topics like:       The surprisingly attractive economics, even at lower flue concentrations    Where it may compete with renewables, storage, and nuclear    The challenges of siting CO2 infrastructure and uncertainty around the 45Q tax credit    Whether “CCS-ready” kicks mitigation down the road, like H2 blending     Big tech companies like Meta that are signaling interest, but not taking action    The range of CCS technologies and the manufacturers jockeying to supply them    CCS’s uncertain political future in the U.S.     Recommended resources:    Carbon Direct: Carbon Capture for Natural Gas-Fired Power Generation  Carbon Direct: Carbon capture for natural gas-fired power generation: An opportunity for hyperscalers  Latitude Media: Where does gas fit in the puzzle of powering AI?  Latitude Media: High costs, delays prompt withdrawal of five more Texas gas plants  Latitude Media: Hydrogen-ready’ power plants aren’t actually ready for hydrogen  Latitude Media: Engie’s pulled project highlights the worsening economics of gas    Credits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.    Catalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, & increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data and tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.    Catalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "Big tech’s data center construction boom is fueling a flurry of natural gas development, despite the fuel’s challenges, and it’s complicating big tech’s climate goals. But carbon capture and storage (CCS) could mitigate emissions from those new plants, and hyperscalers could secure low-carbon power while meeting their needs for speed and reliability. So how could natural gas with CCS serve data center loads? Recommended resources:    Carbon Direct: Carbon Capture for Natural Gas-Fired Power Generation  Carbon Direct: Carbon capture for natural gas-fired power generation: An opportunity for hyperscalers  Latitude Media: Where does gas fit in the puzzle of powering AI?",
    "release_date": "2025-04-17",
    "duration_ms": 2234226,
    "url": "https://open.spotify.com/episode/2wI8d2gEasQtHikZWaWtmT",
    "source": "The Energy Gang Podcast",
    "timestamp": "2025-05-03T21:28:00.458817"
  },
  {
    "title": "How climate disasters are shaping insurance markets",
    "description": "Premiums are rising. Insurers are leaving markets. But people keep building in risk-prone areas, and the climate disasters just keep coming.  Can insurance markets adapt?  In this episode, Shayle talks to Dr. Judd Boomhower, an assistant professor of economics at the University of California-San Diego and a faculty research fellow at the National Bureau of Economic Research. He studies how insurance markets are reacting to climate change. Shayle and Judd cover topics like:   Why insurers are limiting coverage in California, Florida, and other high-risk markets  How disaster insurance, unlike auto or health insurance, faces a flood of claims all at the same time  How catastrophe models (or “cat models” for short) work and why AI and other improvements struggle the solve the fundamental problem: a lack of historical data needed to predict future events  The challenges of private “black-box” catastrophe models that can’t be reviewed by third parties  Reinsurance markets and why they’re not attracting more capital to shore up insurers  The pros and cons of parametric insurance, an emerging category of insurance products  Undercapitalized “fly-by-night” insurers that risk insolvency and failing to pay out claim   Recommended resources  NBER: How Are Insurance Markets Adapting to Climate Change? Risk Classification and Pricing in the Market for Homeowners Insurance Brookings: “How is climate change impacting home insurance markets?”  Credits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.  Catalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, & increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data and tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.  Catalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "Insurers are leaving markets. Can insurance markets adapt? He studies how insurance markets are reacting to climate change. Risk Classification and Pricing in the Market for Homeowners Insurance Brookings: “How is climate change impacting home insurance markets?”  Credits: Hosted by Shayle Kann.",
    "release_date": "2025-04-10",
    "duration_ms": 1987631,
    "url": "https://open.spotify.com/episode/4VDyv5C452IL2oNeeXA2sP",
    "source": "The Energy Gang Podcast",
    "timestamp": "2025-05-03T21:28:00.463476"
  },
  {
    "title": "Frontier Forum: Future-proofing data center power infrastructure",
    "description": "Data centers face a critical timing problem. They need massive amounts of power immediately, but grid upgrades can take more than seven years to complete. Microgrids could be a solution to this growing power gap.  \"How do you future-proof your systems through adaptability of technologies? Microgrids are really a nice technology to address that,\" explains Adib Nasle, CEO of Xendee.  In this episode, recorded as part of a live Frontier Forum, Latitude Media's Stephen Lacey speaks with Xendee co-founders Adib Nasle and Michael Stadler about how microgrids can help data centers get power quickly, while also preparing for future technology changes.  The conversation explores how the combination of combined heat and power systems with supplemental technologies like batteries and renewables can create flexible, adaptable power solutions for mission-critical facilities. Their research across different energy markets shows striking cost reductions.  \"We saw cost reductions up to 80 percent in California and 60 percent in Virginia,\" notes Dr. Michael Stadler, CTO of Xendee. \"If you really go with the utility, it's always the most expensive case.\"  Using a stepped approach to microgrid implementation, data centers can achieve electricity prices significantly below grid rates — while maintaining complete control over their power infrastructure and preparing for future technologies like small modular reactors.  \"One way to think about microgrids is really as a Swiss army knife of energy infrastructure,\" says Nasle. \"You're getting localized resilience, economics, flexibility, scalability, efficiency through controls, and the inherent benefits of a decentralized system.\"  This is a partner episode, brought to you by Xendee. It was recorded live as part of Latitude Media's Frontier Forum series. Watch the full video to hear more details about microgrid design for data centers.",
    "summary": "Data centers face a critical timing problem. They need massive amounts of power immediately, but grid upgrades can take more than seven years to complete. \"We saw cost reductions up to 80 percent in California and 60 percent in Virginia,\" notes Dr. Michael Stadler, CTO of Xendee. It was recorded live as part of Latitude Media's Frontier Forum series.",
    "release_date": "2025-04-07",
    "duration_ms": 1738840,
    "url": "https://open.spotify.com/episode/7GDBbAI56d55PQwZn6jSgX",
    "source": "The Energy Gang Podcast",
    "timestamp": "2025-05-03T21:28:00.467426"
  },
  {
    "title": "Specialized AI brains for physical industry",
    "description": "Everyone wants a piece of general purpose models. Instacart has deployed ChatGPT for recipes and meal planning. The Mayo Clinic is using it to summarize patient records. Schneider Electric is using an OpenAI LLM to generate sustainability reports.   With such powerful models, what’s the need for specialized models built for specific industries, especially in climate tech?  In this episode, Shayle talks to Sam Smith-Eppsteiner, partner at Innovation Endeavors. She recently wrote a blog post arguing that there may be a market that general purpose models struggle to meet: physical industries where training data is siloed, unstructured, and private. She talks through climate-relevant examples like Cadstrom’s copilot for electrical engineers, Hubflow’s automated trucker scheduling, WeaveBio’s AI-powered platform for regulatory approvals. Shayle and Sam also cover topics like:   Applicable cases, like cross referencing complicated technical manuals, repetitive manual work that employees dislike, and technical compliance  The technical knowledge lost when workers retire and how specialized AI could help  What it takes to build specialized models, including data access, vector embedding, prompt engineering, and fine tuning   What budget categories businesses might use to pay for specialized models  Selling the technology (i.e. the traditional SAAS model) vs selling the work (i.e. answers informed by models)   Recommended resources    Innovation Endeavors: Specialized brains for industry: the immense potential for domain-specific AI   Innovation Endeavors: The next industrial unicorn: Where is AI rapidly transforming the physical economy   Catalyst: The coming robotics wave   Latitude: How utilities are designing and embedding AI operating models   Credits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.  Catalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, & increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data and tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.  Catalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "Everyone wants a piece of general purpose models. With such powerful models, what’s the need for specialized models built for specific industries, especially in climate tech? In this episode, Shayle talks to Sam Smith-Eppsteiner, partner at Innovation Endeavors. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid.",
    "release_date": "2025-04-04",
    "duration_ms": 2228871,
    "url": "https://open.spotify.com/episode/1VT8LIe7xA4AbCp1tkvqmH",
    "source": "The Energy Gang Podcast",
    "timestamp": "2025-05-03T21:28:00.472403"
  }
]