[
  {
    "title": "Frontier Forum: Unlocking next-generation VPPs",
    "description": "In the mid-2000s, Ben Brown started his career designing demand response programs that relied on pagers and telephones. Today, as Renew Home's CEO, he's leveraging AI and tens of millions of connected smart devices to help households save energy and create an entirely new approach to grid management.\n\nRenew Home is building a new kind of virtual power plant that moves beyond occasional emergency events toward continuous, subtle energy shifts across millions of connected households.\n\n\"The biggest evolution is connected devices,\" explains Brown, who previously led energy product development at Google after its acquisition of Nest.\n\nDuring his time at Google Labs working on large language models, Brown also witnessed firsthand the massive energy demands that AI would place on our grid.\n\nThis realization, combined with his work on smart home technology, led Brown to envision a new approach to virtual power plants – one built on subtle, personalized adjustments across millions of homes rather than occasional disruptive events.\n\n“There's actually a lot more value continuously throughout the year, over hundreds of hours where customers can save more money by helping support the grid.\"\n\nWith DOE projections showing a 200 gigawatt peak on the US grid by 2030, Renew Home's approach offers a compelling alternative to building new power plants. By focusing on customer control and personalization, they've achieved 75% opt-in rates, while creating a resource that is far cheaper than gas peakers.\n\nIn this episode, recorded as part of a live Frontier Forum, Stephen Lacey talks with Ben Brown about the next generation of virtual power plants. \n\nHow does Renew Home’s approach differ from demand response or battery-based VPPs? And what role can it play in addressing the grid’s urgent needs?\n\nThis is a partner episode, brought to you by Renew Home. It was recorded live as part of Latitude Media's Frontier Forum series. Watch the full video to hear more details about next-generation VPPs.",
    "summary": "Today, as Renew Home's CEO, he's leveraging AI and tens of millions of connected smart devices to help households save energy and create an entirely new approach to grid management. \"The biggest evolution is connected devices,\" explains Brown, who previously led energy product development at Google after its acquisition of Nest. With DOE projections showing a 200 gigawatt peak on the US grid by 2030, Renew Home's approach offers a compelling alternative to building new power plants.",
    "transcript": "Transcription failed.",
    "release_date": "2025-05-06",
    "duration_ms": 1576000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI3769855352.mp3?updated=1746574419",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-07T02:54:38.590382"
  },
  {
    "title": "Catalyst Live at SF Climate Week",
    "description": "It’s a Catalyst first-of-a-kind: our very first live event! We hosted it last Wednesday at San Francisco Climate week. In this episode, Shayle talks to Mike Schroepfer, co-founder and partner at Gigascale Capital and former CTO of Meta, and Nick Chaset, CEO of Octopus Energy US. Together they cover:\n\n\n  \nLessons on building products that consumers love\n\n\n\n  \n Over and under hyped trends, including data center load growth, carbon removal, and fusion\n\n\n\n  \nWhat areas will benefit most from the current administration\n\n\n\n  \nThe most important, least appreciated category of climate tech\n\n\n\n  \nThe craziest idea that just might work\n\n\n\n\nRecommended resources:\n\n\n  \nCatalyst: A skeptic’s take on AI electricity load growth\n\n\n\n  \nCatalyst: The geopolitics of rare earth elements\n\n\n\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.\n\nThis special Catalyst Live was sponsored by JP Morgan Chase and DLA Piper.\n\nCatalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, & increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data and tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.\n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "It’s a Catalyst first-of-a-kind: our very first live event! We hosted it last Wednesday at San Francisco Climate week. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid.",
    "transcript": "Transcription failed.",
    "release_date": "2025-05-01",
    "duration_ms": 2815000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI7666361718.mp3?updated=1746075752",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-07T02:54:41.226305"
  },
  {
    "title": "The geopolitics of rare earth elements",
    "description": "China’s new export controls on rare earth elements (REEs) are a problem for EVs, renewables, and other industries that rely on the minerals, especially the permanent magnets they’re used in. The vast majority of the global supply chain is in China. Plus, Chinese companies control supply chain operations around the world. \n\nSo is it possible to stand up a rare earth supply chain outside of China’s control?\n\nIn this episode, Shayle talks to Ahmad Ghahreman, co-founder and CEO of REE recycler Cyclic Materials. (Energy Impact Partners, where Shayle is a partner, invests in Cyclic.) They cover topics like:\n\n\nREE 101: the basket of 17 minerals, how they’re mined and processed, and the most important five\n\nWhy an REE supply chain hasn’t been built outside of China, even though the raw materials exist outside the country\n\nThe timeline of Chinese export controls leading up to the April escalation and what could come next\n\nThe specifics of what’s limited, including oxides, alloys, and magnets\n\nWhy Ahmad is optimistic about building an ex-China supply chain\n\nOther potential pathways, like recycling and designing more REEs-efficient products\n\n\nRecommended resources:\n\nThe New York Times: The Mine Is American. The Minerals Are China’s.\nThe New York Times: How China Took Over the World’s Rare Earths Industry\nAxios: China trade war risks stifling America's electric car movement\nHeatmap:  China’s Minerals Pause All Pain, No Gain for U.S\nLatitude Media: Building a supply chain for rare earth elements\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.\n\nCatalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, & increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data and tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.\n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "The vast majority of the global supply chain is in China. Plus, Chinese companies control supply chain operations around the world. So is it possible to stand up a rare earth supply chain outside of China’s control? The Minerals Are China’s. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid.",
    "transcript": "Transcription failed.",
    "release_date": "2025-04-24",
    "duration_ms": 2064000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI1312009216.mp3?updated=1745478650",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-07T02:54:43.654971"
  },
  {
    "title": "What’s next for the battery storage boom? [partner content]",
    "description": "The U.S. storage market is experiencing hockey-stick growth, with multiple gigawatts being installed quarterly. But new policy uncertainties around tariffs and the Inflation Reduction Act are threatening this momentum.\n\nBut Jeff Waters, the CEO of Powin, remains optimistic.\n\n\"This industry will figure out a way to work with it,\" says Waters, who brings decades of experience from the semiconductor and solar industries. \"What we're doing is important.\"\n\nPowin is a leading storage integrator that designs, commissions, and services some of the largest utility-scale batteries in the world. As Waters puts it, \"If you are a utility or if you are an IPP, if you want to integrate storage and own and operate a storage asset, we are that one throat to choke.\"\n\nIn this episode, produced in partnership with Powin, Stephen Lacey talks with Jeff about why he's still optimistic about the market despite significant headwinds. Drawing from his experience in semiconductors, Waters makes a case for how America should approach domestic battery manufacturing.\n\n\"When I hear people talk about storage and say, 'We don't want Chinese companies investing or getting taxpayer money to build plants,' I think it's a ridiculous notion,\" Waters explains. \"The only way we're going to get anywhere in the U.S. market with storage is by partnering with the Chinese.\"\n\nThey discuss the extraordinary scaling of project sizes, the surge in electricity demand from data centers, technology trends beyond lithium-iron phosphate batteries, diverse deployment models, regional market opportunities, and the remarkable resilience of an industry used to navigating policy volatility.\n\nThis is a partner episode, brought to you by Powin. Powin is pushing the frontiers of energy storage. To learn more about Powin's integrated energy storage systems and to read case studies of how the company is executing projects, go to powin.com.",
    "summary": "The U.S. storage market is experiencing hockey-stick growth, with multiple gigawatts being installed quarterly. Powin is pushing the frontiers of energy storage. To learn more about Powin's integrated energy storage systems and to read case studies of how the company is executing projects, go to powin.com.",
    "transcript": "Transcription failed.",
    "release_date": "2025-04-23",
    "duration_ms": 1204000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI3970287601.mp3?updated=1745365193",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-07T02:54:44.988643"
  },
  {
    "title": "Serving data center load with carbon capture",
    "description": "Big tech’s data center construction boom is fueling a flurry of natural gas development, despite the fuel’s challenges, and it’s complicating big tech’s climate goals. But carbon capture and storage (CCS) could mitigate emissions from those new plants, and hyperscalers could secure low-carbon power while meeting their needs for speed and reliability. \n\n\n\nSo how could natural gas with CCS serve data center loads?\n\n\n\nIn this episode, Shayle talks to Julio Friedmann, chief scientist at Carbon Direct, who recently co-authored a couple pieces on the topic. Despite recent high profile cancellations of natural gas projects, Julio makes the case that gas-plus-CCS has attractive advantages, provided the carbon capture actually happens. Shayle and Julio cover topics like:\n\n\n\n\n  The surprisingly attractive economics, even at lower flue concentrations\n\n  Where it may compete with renewables, storage, and nuclear\n\n  The challenges of siting CO2 infrastructure and uncertainty around the 45Q tax credit\n\n  Whether “CCS-ready” kicks mitigation down the road, like H2 blending\n\n\n  Big tech companies like Meta that are signaling interest, but not taking action\n\n  The range of CCS technologies and the manufacturers jockeying to supply them\n\n  CCS’s uncertain political future in the U.S.\n\n\n\n\nRecommended resources:\n\n\n\nCarbon Direct: Carbon Capture for Natural Gas-Fired Power Generation\n\nCarbon Direct: Carbon capture for natural gas-fired power generation: An opportunity for hyperscalers\n\nLatitude Media: Where does gas fit in the puzzle of powering AI?\n\nLatitude Media: High costs, delays prompt withdrawal of five more Texas gas plants\n\nLatitude Media: Hydrogen-ready’ power plants aren’t actually ready for hydrogen\n\nLatitude Media: Engie’s pulled project highlights the worsening economics of gas\n\n\n\nCredits: Hosted by Shayle Kann. Produced and edited by Daniel Woldorff. Original music and engineering by Sean Marquand. Stephen Lacey is executive editor.\n\n\n\nCatalyst is brought to you by Anza, a platform enabling solar and storage developers and buyers to save time, reduce risk, & increase profits in their equipment selection process. Anza gives clients access to pricing, technical, and risk data and tools that they’ve never had access to before. Learn more at go.anzarenewables.com/latitude.\n\n\n\nCatalyst is brought to you by EnergyHub. EnergyHub helps utilities build next-generation virtual power plants that unlock reliable flexibility at every level of the grid. See how EnergyHub helps unlock the power of flexibility at scale, and deliver more value through cross-DER dispatch with their leading Edge DERMS platform, by visiting energyhub.com.",
    "summary": "Big tech’s data center construction boom is fueling a flurry of natural gas development, despite the fuel’s challenges, and it’s complicating big tech’s climate goals. But carbon capture and storage (CCS) could mitigate emissions from those new plants, and hyperscalers could secure low-carbon power while meeting their needs for speed and reliability. Recommended resources:\n\n\n\nCarbon Direct: Carbon Capture for Natural Gas-Fired Power Generation\n\nCarbon Direct: Carbon capture for natural gas-fired power generation: An opportunity for hyperscalers\n\nLatitude Media: Where does gas fit in the puzzle of powering AI?",
    "transcript": "Transcription failed.",
    "release_date": "2025-04-17",
    "duration_ms": 2347000,
    "url": "https://chrt.fm/track/G78F99/traffic.megaphone.fm/PSMI4083114695.mp3?updated=1745902278",
    "source": "Catalyst with Shayle Kann",
    "timestamp": "2025-05-07T02:54:47.419140"
  }
]